[Survived] BooleanLiteral
learnvault/client/src/App.jsx:31:44
   const [loggedInUser, setLoggedInUser] = useState('');
   const [timerId, setTimerId] = useState('');
   const prefersDarkMode = useMediaQuery('(prefers-color-scheme: dark)');
-  const [darkMode, setDarkMode] = useState(false);
+  const [darkMode, setDarkMode] = useState(true);
 
   const theme = React.useMemo(

[Survived] ArrowFunction
learnvault/client/src/App.jsx:34:5
   const [darkMode, setDarkMode] = useState(false);
 
   const theme = React.useMemo(
-    () => createMuiTheme({
-      overrides: {
-        MuiAppBar: {
-          colorDefault: {
-            color: 'white',
-            backgroundColor: darkMode ? '#424242' : '#1976d2',
-          },
-        },
-      },
-      palette: {
-        type: darkMode ? 'dark' : 'light',
-        primary: {
-          main: darkMode ? '#90caf9' : '#1976d2',
-        },
-      },
-    }),
+    () => undefined,
     [darkMode],
   );

[Survived] ObjectLiteral
learnvault/client/src/App.jsx:34:26
   const [darkMode, setDarkMode] = useState(false);
 
   const theme = React.useMemo(
-    () => createMuiTheme({
-      overrides: {
-        MuiAppBar: {
-          colorDefault: {
-            color: 'white',
-            backgroundColor: darkMode ? '#424242' : '#1976d2',
-          },
-        },
-      },
-      palette: {
-        type: darkMode ? 'dark' : 'light',
-        primary: {
-          main: darkMode ? '#90caf9' : '#1976d2',
-        },
-      },
-    }),
+    () => createMuiTheme({}),
     [darkMode],
   );

[Survived] ObjectLiteral
learnvault/client/src/App.jsx:35:18
 
   const theme = React.useMemo(
     () => createMuiTheme({
-      overrides: {
-        MuiAppBar: {
-          colorDefault: {
-            color: 'white',
-            backgroundColor: darkMode ? '#424242' : '#1976d2',
-          },
-        },
-      },
+      overrides: {},
       palette: {
         type: darkMode ? 'dark' : 'light',

[Survived] ObjectLiteral
learnvault/client/src/App.jsx:37:25
     () => createMuiTheme({
       overrides: {
         MuiAppBar: {
-          colorDefault: {
-            color: 'white',
-            backgroundColor: darkMode ? '#424242' : '#1976d2',
-          },
+          colorDefault: {},
         },
       },

[Survived] StringLiteral
learnvault/client/src/App.jsx:39:53
         MuiAppBar: {
           colorDefault: {
             color: 'white',
-            backgroundColor: darkMode ? '#424242' : '#1976d2',
+            backgroundColor: darkMode ? '#424242' : "",
           },
         },

[Survived] StringLiteral
learnvault/client/src/App.jsx:44:26
         },
       },
       palette: {
-        type: darkMode ? 'dark' : 'light',
+        type: darkMode ? "" : 'light',
         primary: {
           main: darkMode ? '#90caf9' : '#1976d2',

[Survived] StringLiteral
learnvault/client/src/App.jsx:44:35
         },
       },
       palette: {
-        type: darkMode ? 'dark' : 'light',
+        type: darkMode ? 'dark' : "",
         primary: {
           main: darkMode ? '#90caf9' : '#1976d2',

[Survived] StringLiteral
learnvault/client/src/App.jsx:54:11
   );
 
   useEffect(() => {
-    fetch('/api/checkToken')
+    fetch("")
       .then((res) => {
         if (res.status === 200) {

[Survived] BlockStatement
learnvault/client/src/App.jsx:55:22
 
   useEffect(() => {
     fetch('/api/checkToken')
-      .then((res) => {
-        if (res.status === 200) {
-          return res.json();
-        }
-        const error = new Error(res.statusText);
-        if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
-          console.error(
-            'Error: fetch /api/checkToken did not return status 200',
-            error,
-          );
-          throw error;
-        }
-      })
+      .then((res) => {})
       .then((data) => {
         if (process.env.NODE_ENV === 'development'

[Survived] EqualityOperator
learnvault/client/src/App.jsx:56:13
   useEffect(() => {
     fetch('/api/checkToken')
       .then((res) => {
-        if (res.status === 200) {
+        if (res.status !== 200) {
           return res.json();
         }

[Survived] BlockStatement
learnvault/client/src/App.jsx:56:33
   useEffect(() => {
     fetch('/api/checkToken')
       .then((res) => {
-        if (res.status === 200) {
-          return res.json();
-        }
+        if (res.status === 200) {}
         const error = new Error(res.statusText);
         if (process.env.NODE_ENV === 'development'

[Survived] ConditionalExpression
learnvault/client/src/App.jsx:60:13
           return res.json();
         }
         const error = new Error(res.statusText);
-        if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
+        if (false) {
           console.error(
             'Error: fetch /api/checkToken did not return status 200',

[Survived] ConditionalExpression
learnvault/client/src/App.jsx:60:13
           return res.json();
         }
         const error = new Error(res.statusText);
-        if (process.env.NODE_ENV === 'development'
+        if (false
           || process.env.NODE_ENV === 'test') {
           console.error(

[Survived] BlockStatement
learnvault/client/src/App.jsx:61:47
         }
         const error = new Error(res.statusText);
         if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
-          console.error(
-            'Error: fetch /api/checkToken did not return status 200',
-            error,
-          );
-          throw error;
-        }
+          || process.env.NODE_ENV === 'test') {}
       })
       .then((data) => {

[Survived] EqualityOperator
learnvault/client/src/App.jsx:61:14
         }
         const error = new Error(res.statusText);
         if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
+          || process.env.NODE_ENV !== 'test') {
           console.error(
             'Error: fetch /api/checkToken did not return status 200',

[Survived] StringLiteral
learnvault/client/src/App.jsx:63:13
         if (process.env.NODE_ENV === 'development'
           || process.env.NODE_ENV === 'test') {
           console.error(
-            'Error: fetch /api/checkToken did not return status 200',
+            "",
             error,
           );

[Survived] BlockStatement
learnvault/client/src/App.jsx:69:23
           throw error;
         }
       })
-      .then((data) => {
-        if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
-          console.log('Success: fetch /api/checkToken', data);
-        }
-        setLoggedInUser(data);
-      })
+      .then((data) => {})
       .catch((err) => {
         if (process.env.NODE_ENV === 'development'

[Survived] EqualityOperator
learnvault/client/src/App.jsx:70:13
         }
       })
       .then((data) => {
-        if (process.env.NODE_ENV === 'development'
+        if (process.env.NODE_ENV !== 'development'
           || process.env.NODE_ENV === 'test') {
           console.log('Success: fetch /api/checkToken', data);

[Survived] ConditionalExpression
learnvault/client/src/App.jsx:70:13
         }
       })
       .then((data) => {
-        if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
+        if (true) {
           console.log('Success: fetch /api/checkToken', data);
         }

[Survived] ConditionalExpression
learnvault/client/src/App.jsx:71:14
       })
       .then((data) => {
         if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
+          || true) {
           console.log('Success: fetch /api/checkToken', data);
         }

[Survived] BlockStatement
learnvault/client/src/App.jsx:71:47
       })
       .then((data) => {
         if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
-          console.log('Success: fetch /api/checkToken', data);
-        }
+          || process.env.NODE_ENV === 'test') {}
         setLoggedInUser(data);
       })

[Survived] BlockStatement
learnvault/client/src/App.jsx:76:23
         }
         setLoggedInUser(data);
       })
-      .catch((err) => {
-        if (process.env.NODE_ENV === 'development'
-        || process.env.NODE_ENV === 'test') {
-          console.error('Error: fetch /api/checkToken caught error', err);
-        }
-        setLoggedInUser('');
-      });
+      .catch((err) => {});
   }, []);
 

[Survived] LogicalOperator
learnvault/client/src/App.jsx:77:13
         setLoggedInUser(data);
       })
       .catch((err) => {
-        if (process.env.NODE_ENV === 'development'
-        || process.env.NODE_ENV === 'test') {
+        if (process.env.NODE_ENV === 'development' && process.env.NODE_ENV === 'test') {
           console.error('Error: fetch /api/checkToken caught error', err);
         }

[Survived] EqualityOperator
learnvault/client/src/App.jsx:77:13
         setLoggedInUser(data);
       })
       .catch((err) => {
-        if (process.env.NODE_ENV === 'development'
+        if (process.env.NODE_ENV !== 'development'
         || process.env.NODE_ENV === 'test') {
           console.error('Error: fetch /api/checkToken caught error', err);

[Survived] ConditionalExpression
learnvault/client/src/App.jsx:78:12
       })
       .catch((err) => {
         if (process.env.NODE_ENV === 'development'
-        || process.env.NODE_ENV === 'test') {
+        || false) {
           console.error('Error: fetch /api/checkToken caught error', err);
         }

[Survived] BlockStatement
learnvault/client/src/App.jsx:78:45
       })
       .catch((err) => {
         if (process.env.NODE_ENV === 'development'
-        || process.env.NODE_ENV === 'test') {
-          console.error('Error: fetch /api/checkToken caught error', err);
-        }
+        || process.env.NODE_ENV === 'test') {}
         setLoggedInUser('');
       });

[Survived] StringLiteral
learnvault/client/src/App.jsx:81:25
         || process.env.NODE_ENV === 'test') {
           console.error('Error: fetch /api/checkToken caught error', err);
         }
-        setLoggedInUser('');
+        setLoggedInUser("Stryker was here!");
       });
   }, []);
