[Survived] ObjectLiteral
client/src/components/Login.jsx:20:14
   withoutLabel: {
     marginTop: theme.spacing(3),
   },
-  textField: {
-    width: '40ch',
-  },
+  textField: {},
 }));
 

[Survived] StringLiteral
client/src/components/Login.jsx:21:12
     marginTop: theme.spacing(3),
   },
   textField: {
-    width: '40ch',
+    width: "",
   },
 }));

[Survived] StringLiteral
client/src/components/Login.jsx:29:13
   const classes = useStyles();
   const [email, setEmail] = useState('');
   const [password, setPassword] = useState({
-    amount: '',
+    amount: "Stryker was here!",
     password: '',
     weight: '',

[Survived] ConditionalExpression
client/src/components/Login.jsx:40:9
   const login = (e) => {
     e.preventDefault();
 
-    if (!email || !password.password) return;
+    if (true) return;
 
     fetch('/api/login', {

[Survived] BooleanLiteral
client/src/components/Login.jsx:40:19
   const login = (e) => {
     e.preventDefault();
 
-    if (!email || !password.password) return;
+    if (!email || password.password) return;
 
     fetch('/api/login', {

[Survived] StringLiteral
client/src/components/Login.jsx:42:11
 
     if (!email || !password.password) return;
 
-    fetch('/api/login', {
+    fetch("", {
       method: 'POST',
       headers: {

[Survived] BlockStatement
client/src/components/Login.jsx:50:23
       body: JSON.stringify({ email, password: password.password }),
     })
       .then((response) => response.json())
-      .then((data) => {
-        // If login was successful, redirect to homepage
-        if (data.attempt === 'success') {
-          clearTimeout(timerId);
-          const newTimerId = setTimeout(() => {
-            setLoggedInUser('');
-            history.push('/login');
-          }, 3600000);
-          setTimerId(newTimerId);
-          setLoggedInUser(data.userId);
-          history.push('/');
-        }
-      })
+      .then((data) => {})
       .catch((err) => {
         // TODO: handle error if fetch attempt fails

[Survived] EqualityOperator
client/src/components/Login.jsx:52:13
       .then((response) => response.json())
       .then((data) => {
         // If login was successful, redirect to homepage
-        if (data.attempt === 'success') {
+        if (data.attempt !== 'success') {
           clearTimeout(timerId);
           const newTimerId = setTimeout(() => {

[Survived] ConditionalExpression
client/src/components/Login.jsx:52:13
       .then((response) => response.json())
       .then((data) => {
         // If login was successful, redirect to homepage
-        if (data.attempt === 'success') {
+        if (false) {
           clearTimeout(timerId);
           const newTimerId = setTimeout(() => {

[Survived] BlockStatement
client/src/components/Login.jsx:54:47
         // If login was successful, redirect to homepage
         if (data.attempt === 'success') {
           clearTimeout(timerId);
-          const newTimerId = setTimeout(() => {
-            setLoggedInUser('');
-            history.push('/login');
-          }, 3600000);
+          const newTimerId = setTimeout(() => {}, 3600000);
           setTimerId(newTimerId);
           setLoggedInUser(data.userId);

[Survived] StringLiteral
client/src/components/Login.jsx:56:26
           clearTimeout(timerId);
           const newTimerId = setTimeout(() => {
             setLoggedInUser('');
-            history.push('/login');
+            history.push("");
           }, 3600000);
           setTimerId(newTimerId);

[Survived] BlockStatement
client/src/components/Login.jsx:63:23
           history.push('/');
         }
       })
-      .catch((err) => {
-        // TODO: handle error if fetch attempt fails
-        console.log('Error on login: ', err);
-      });
+      .catch((err) => {});
   };
 

[Survived] BlockStatement
client/src/components/Login.jsx:69:45
       });
   };
 
-  const handleChange = (prop) => (event) => {
-    setPassword({ ...password, [prop]: event.target.value });
-  };
+  const handleChange = (prop) => (event) => {};
 
   const handleClickShowPassword = () => {

[Survived] ArrowFunction
client/src/components/Login.jsx:69:24
       });
   };
 
-  const handleChange = (prop) => (event) => {
-    setPassword({ ...password, [prop]: event.target.value });
-  };
+  const handleChange = () => undefined;
 
   const handleClickShowPassword = () => {

[Survived] ArrowFunction
client/src/components/Login.jsx:86:88
       <h1>Login</h1>
       <form>
         <FormControl className={clsx(classes.margin, classes.textField)} variant="outlined">
-          <TextField id="outlined-required" label="Email" variant="outlined" onChange={(e) => setEmail(e.target.value)} value={email} />
+          <TextField id="outlined-required" label="Email" variant="outlined" onChange={() => undefined} value={email} />
         </FormControl>
         {/* </label> */}

[Survived] StringLiteral
client/src/components/Login.jsx:96:36
             id="outlined-adornment-password"
             type={password.showPassword ? 'text' : 'password'}
             value={password.password}
-            onChange={handleChange('password')}
+            onChange={handleChange("")}
             endAdornment={(
               <InputAdornment position="end">
