[Survived] ArrowFunction
client/src/components/Nav.jsx:20:30
 
 // import './Nav.css';
 
-const useStyles = makeStyles((theme) => ({
-  root: {
-    display: 'flex',
-    justifyContent: 'space-between',
-  },
-  left: {
-    display: 'flex',
-    alignItems: 'center',
-  },
-  right: {
-    display: 'flex',
-    alignItems: 'center',
-  },
-  menuButton: {
-    marginRight: theme.spacing(2),
-  },
-  title: {
-  },
-  links: {
-  },
-  link: {
-    margin: '0px 10px',
-  },
-}));
+const useStyles = makeStyles(() => undefined);
 
 const Nav = ({

[Survived] ObjectLiteral
client/src/components/Nav.jsx:20:42
 
 // import './Nav.css';
 
-const useStyles = makeStyles((theme) => ({
-  root: {
-    display: 'flex',
-    justifyContent: 'space-between',
-  },
-  left: {
-    display: 'flex',
-    alignItems: 'center',
-  },
-  right: {
-    display: 'flex',
-    alignItems: 'center',
-  },
-  menuButton: {
-    marginRight: theme.spacing(2),
-  },
-  title: {
-  },
-  links: {
-  },
-  link: {
-    margin: '0px 10px',
-  },
-}));
+const useStyles = makeStyles((theme) => ({}));
 
 const Nav = ({

[Survived] ObjectLiteral
client/src/components/Nav.jsx:21:9
 // import './Nav.css';
 
 const useStyles = makeStyles((theme) => ({
-  root: {
-    display: 'flex',
-    justifyContent: 'space-between',
-  },
+  root: {},
   left: {
     display: 'flex',

[Survived] StringLiteral
client/src/components/Nav.jsx:23:21
 const useStyles = makeStyles((theme) => ({
   root: {
     display: 'flex',
-    justifyContent: 'space-between',
+    justifyContent: "",
   },
   left: {

[Survived] StringLiteral
client/src/components/Nav.jsx:27:17
   },
   left: {
     display: 'flex',
-    alignItems: 'center',
+    alignItems: "",
   },
   right: {

[Survived] StringLiteral
client/src/components/Nav.jsx:30:14
     alignItems: 'center',
   },
   right: {
-    display: 'flex',
+    display: "",
     alignItems: 'center',
   },

[Survived] ObjectLiteral
client/src/components/Nav.jsx:40:9
   },
   links: {
   },
-  link: {
-    margin: '0px 10px',
-  },
+  link: {},
 }));
 

[Killed] BlockStatement
client/src/components/Nav.jsx:55:24
 }) => {
   const history = useHistory();
 
-  const logout = () => {
-    // console.log('logging out');
-    fetch('/api/logout')
-      .then((response) => response.json())
-      .then((data) => {
-        if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
-          console.log('Success /api/logout: ', data);
-        }
-        return data;
-      })
-      .catch((err) => {
-        if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
-          console.log('Error /api/logout: ', err);
-        }
-        // throw error
-      });
-    clearTimeout(timerId);
-    setTimerId('');
-    setLoggedInUser('');
-    history.push('/');
-  };
+  const logout = () => {};
 
   const classes = useStyles();

[Survived] StringLiteral
client/src/components/Nav.jsx:57:11
 
   const logout = () => {
     // console.log('logging out');
-    fetch('/api/logout')
+    fetch("")
       .then((response) => response.json())
       .then((data) => {

[Survived] ArrowFunction
client/src/components/Nav.jsx:58:13
   const logout = () => {
     // console.log('logging out');
     fetch('/api/logout')
-      .then((response) => response.json())
+      .then(() => undefined)
       .then((data) => {
         if (process.env.NODE_ENV === 'development'

[Survived] BlockStatement
client/src/components/Nav.jsx:59:23
     // console.log('logging out');
     fetch('/api/logout')
       .then((response) => response.json())
-      .then((data) => {
-        if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
-          console.log('Success /api/logout: ', data);
-        }
-        return data;
-      })
+      .then((data) => {})
       .catch((err) => {
         if (process.env.NODE_ENV === 'development'

[Survived] ConditionalExpression
client/src/components/Nav.jsx:60:13
     fetch('/api/logout')
       .then((response) => response.json())
       .then((data) => {
-        if (process.env.NODE_ENV === 'development'
+        if (false
           || process.env.NODE_ENV === 'test') {
           console.log('Success /api/logout: ', data);

[Survived] ConditionalExpression
client/src/components/Nav.jsx:60:13
     fetch('/api/logout')
       .then((response) => response.json())
       .then((data) => {
-        if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
+        if (false) {
           console.log('Success /api/logout: ', data);
         }

[Survived] StringLiteral
client/src/components/Nav.jsx:62:23
       .then((data) => {
         if (process.env.NODE_ENV === 'development'
           || process.env.NODE_ENV === 'test') {
-          console.log('Success /api/logout: ', data);
+          console.log("", data);
         }
         return data;

[Survived] BlockStatement
client/src/components/Nav.jsx:66:23
         }
         return data;
       })
-      .catch((err) => {
-        if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
-          console.log('Error /api/logout: ', err);
-        }
-        // throw error
-      });
+      .catch((err) => {});
     clearTimeout(timerId);
     setTimerId('');

[Survived] ConditionalExpression
client/src/components/Nav.jsx:67:13
         return data;
       })
       .catch((err) => {
-        if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
+        if (false) {
           console.log('Error /api/logout: ', err);
         }

[Survived] ConditionalExpression
client/src/components/Nav.jsx:67:13
         return data;
       })
       .catch((err) => {
-        if (process.env.NODE_ENV === 'development'
+        if (false
           || process.env.NODE_ENV === 'test') {
           console.log('Error /api/logout: ', err);

[Survived] StringLiteral
client/src/components/Nav.jsx:69:23
       .catch((err) => {
         if (process.env.NODE_ENV === 'development'
           || process.env.NODE_ENV === 'test') {
-          console.log('Error /api/logout: ', err);
+          console.log("", err);
         }
         // throw error

[Survived] StringLiteral
client/src/components/Nav.jsx:74:16
         // throw error
       });
     clearTimeout(timerId);
-    setTimerId('');
+    setTimerId("Stryker was here!");
     setLoggedInUser('');
     history.push('/');

[Killed] LogicalOperator
client/src/components/Nav.jsx:108:12
           >
             Home
           </Link>
-          {!loggedInUser && (
-          <>
-            <Link
-              component={RouterLink}
-              to="/login"
-              color="inherit"
-              className={classes.link}
-              variant="h6"
-              id="nav-login"
-            >
-              Login
-            </Link>
-            <Link
-              component={RouterLink}
-              to="/register"
-              color="inherit"
-              className={classes.link}
-              variant="h6"
-              id="nav-register"
-            >
-              Register
-            </Link>
-          </>
-          )}
+          {!loggedInUser || <>
+            <Link component={RouterLink} to="/login" color="inherit" className={classes.link} variant="h6" id="nav-login">
+              Login
+            </Link>
+            <Link component={RouterLink} to="/register" color="inherit" className={classes.link} variant="h6" id="nav-register">
+              Register
+            </Link>
+          </>}
           {loggedInUser && (
           <>

[Killed] BooleanLiteral
client/src/components/Nav.jsx:108:12
           >
             Home
           </Link>
-          {!loggedInUser && (
+          {loggedInUser && (
           <>
             <Link

[Killed] StringLiteral
client/src/components/Nav.jsx:146:19
             </Link>
             <Link
               component={RouterLink}
-              to={`/collections/user/${loggedInUser}`}
+              to={""}
               color="inherit"
               className={classes.link}

[Survived] BooleanLiteral
client/src/components/Nav.jsx:186:91
             </Link>
           </>
           )}
-          <Button aria-label="toggle dark mode" variant="text" onClick={() => setDarkMode(!darkMode)}>
+          <Button aria-label="toggle dark mode" variant="text" onClick={() => setDarkMode(darkMode)}>
             {darkMode && <Brightness7Icon style={{ color: 'white' }} />}
             {!darkMode && <Brightness4Icon style={{ color: 'white' }} />}

[Survived] ArrowFunction
client/src/components/Nav.jsx:186:73
             </Link>
           </>
           )}
-          <Button aria-label="toggle dark mode" variant="text" onClick={() => setDarkMode(!darkMode)}>
+          <Button aria-label="toggle dark mode" variant="text" onClick={() => undefined}>
             {darkMode && <Brightness7Icon style={{ color: 'white' }} />}
             {!darkMode && <Brightness4Icon style={{ color: 'white' }} />}

[Survived] ConditionalExpression
client/src/components/Nav.jsx:187:14
           </>
           )}
           <Button aria-label="toggle dark mode" variant="text" onClick={() => setDarkMode(!darkMode)}>
-            {darkMode && <Brightness7Icon style={{ color: 'white' }} />}
+            {false}
             {!darkMode && <Brightness4Icon style={{ color: 'white' }} />}
           </Button>

[Survived] ConditionalExpression
client/src/components/Nav.jsx:187:14
           </>
           )}
           <Button aria-label="toggle dark mode" variant="text" onClick={() => setDarkMode(!darkMode)}>
-            {darkMode && <Brightness7Icon style={{ color: 'white' }} />}
+            {true}
             {!darkMode && <Brightness4Icon style={{ color: 'white' }} />}
           </Button>

[Survived] ConditionalExpression
client/src/components/Nav.jsx:188:14
           )}
           <Button aria-label="toggle dark mode" variant="text" onClick={() => setDarkMode(!darkMode)}>
             {darkMode && <Brightness7Icon style={{ color: 'white' }} />}
-            {!darkMode && <Brightness4Icon style={{ color: 'white' }} />}
+            {true}
           </Button>
         </div>

[Survived] LogicalOperator
client/src/components/Nav.jsx:188:14
           )}
           <Button aria-label="toggle dark mode" variant="text" onClick={() => setDarkMode(!darkMode)}>
             {darkMode && <Brightness7Icon style={{ color: 'white' }} />}
-            {!darkMode && <Brightness4Icon style={{ color: 'white' }} />}
+            {!darkMode || <Brightness4Icon style={{
+  color: 'white'
+}} />}
           </Button>
         </div>
