[Survived] BooleanLiteral
client/src/components/WithAuth.jsx:8:42
 const WithAuth = ({
   Component, setLoggedInUser, loggedInUser, id,
 }) => {
-  const [loading, setLoading] = useState(true);
+  const [loading, setLoading] = useState(false);
   const [redirect, setRedirect] = useState(false);
 

[Survived] BooleanLiteral
client/src/components/WithAuth.jsx:9:44
   Component, setLoggedInUser, loggedInUser, id,
 }) => {
   const [loading, setLoading] = useState(true);
-  const [redirect, setRedirect] = useState(false);
+  const [redirect, setRedirect] = useState(true);
 
   // console.log('props', Component, setLoggedInUser, loggedInUser, id);

[Survived] BlockStatement
client/src/components/WithAuth.jsx:17:22
 
   useEffect(() => {
     fetch('/api/checkToken')
-      .then((res) => {
-        if (res.status === 200) {
-          setLoading(false);
-          return res.json();
-        }
-        const error = new Error(res.statusText);
-        if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
-          console.error('Error: fetch /api/checkToken did not return status 200', error);
-        }
-        // throw error;
-      })
+      .then((res) => {})
       .then((data) => {
         if (process.env.NODE_ENV === 'development'

[Survived] ConditionalExpression
client/src/components/WithAuth.jsx:18:13
   useEffect(() => {
     fetch('/api/checkToken')
       .then((res) => {
-        if (res.status === 200) {
+        if (false) {
           setLoading(false);
           return res.json();

[Survived] BlockStatement
client/src/components/WithAuth.jsx:18:33
   useEffect(() => {
     fetch('/api/checkToken')
       .then((res) => {
-        if (res.status === 200) {
-          setLoading(false);
-          return res.json();
-        }
+        if (res.status === 200) {}
         const error = new Error(res.statusText);
         if (process.env.NODE_ENV === 'development'

[Survived] BooleanLiteral
client/src/components/WithAuth.jsx:19:22
     fetch('/api/checkToken')
       .then((res) => {
         if (res.status === 200) {
-          setLoading(false);
+          setLoading(true);
           return res.json();
         }

[Survived] ConditionalExpression
client/src/components/WithAuth.jsx:23:13
           return res.json();
         }
         const error = new Error(res.statusText);
-        if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
+        if (true) {
           console.error('Error: fetch /api/checkToken did not return status 200', error);
         }

[Survived] ConditionalExpression
client/src/components/WithAuth.jsx:23:13
           return res.json();
         }
         const error = new Error(res.statusText);
-        if (process.env.NODE_ENV === 'development'
+        if (true
           || process.env.NODE_ENV === 'test') {
           console.error('Error: fetch /api/checkToken did not return status 200', error);

[Survived] BlockStatement
client/src/components/WithAuth.jsx:24:47
         }
         const error = new Error(res.statusText);
         if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
-          console.error('Error: fetch /api/checkToken did not return status 200', error);
-        }
+          || process.env.NODE_ENV === 'test') {}
         // throw error;
       })

[Survived] StringLiteral
client/src/components/WithAuth.jsx:25:25
         const error = new Error(res.statusText);
         if (process.env.NODE_ENV === 'development'
           || process.env.NODE_ENV === 'test') {
-          console.error('Error: fetch /api/checkToken did not return status 200', error);
+          console.error("", error);
         }
         // throw error;

[Killed] BlockStatement
client/src/components/WithAuth.jsx:36:23
         }
         setLoggedInUser(data);
       })
-      .catch((err) => {
-        if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
-          console.error('Error: fetch /api/checkToken caught error', err);
-        }
-        setLoggedInUser('');
-        setLoading(false);
-        setRedirect(true);
-      });
+      .catch((err) => {});
   }, []);
 

[Survived] BooleanLiteral
client/src/components/WithAuth.jsx:42:20
           console.error('Error: fetch /api/checkToken caught error', err);
         }
         setLoggedInUser('');
-        setLoading(false);
+        setLoading(true);
         setRedirect(true);
       });

[Survived] BooleanLiteral
client/src/components/WithAuth.jsx:43:21
         }
         setLoggedInUser('');
         setLoading(false);
-        setRedirect(true);
+        setRedirect(false);
       });
   }, []);

[Survived] BlockStatement
client/src/components/WithAuth.jsx:56:17
     return null;
   }
 
-  if (redirect) {
-    // console.log('redirecting...');
-    return (
-      <Redirect to="/login" />
-    );
-  }
+  if (redirect) {}
 
   // console.log('rendering Component', Component);
