[Survived] ArrowFunction
client/src/components/Profile.jsx:3:20
 import React, { useState, useEffect } from 'react';
 import './Profile.css';
-const RenderUser = (user) =>(<>
-<div className='wrap summary'>
-<div><span className="initials">{user.username.slice(0,2)}</span></div>
- <div> 
-  <h2>{user.username}</h2>
-  <h2> {user.email}</h2>
-  </div>
-  </div>
-</>);
+const RenderUser = () => undefined;
 
 const RenderInfo = ({data}) =>(

[Survived] ArrowFunction
client/src/components/Profile.jsx:13:20
   </div>
 </>);
 
-const RenderInfo = ({data}) =>(
-  <div className='card'>
-    {data.likesTitle !=''? <p><strong>Title you liked: </strong>{data.likesTitle}</p>: null}
-    {data.likesText !=''? <p><strong>Text you liked: </strong>{data.likesText}</p>: null}
-    {data.likesAuthor !=''? <p><strong>likesAuthor: </strong>{data.likesAuthor},</p>: null}
-    {data.category !=''? <p><strong>Category:</strong> {data.category}</p>: null}
-    {data.tags !=''? <p><strong>Tags:</strong>{data.tags}</p>: null}
-    { String(data.links) != '' ? <ul><strong>Links:</strong>{Object.keys(data.links).map((item, index)=>(<li key={index}><a  href={ data.links[item]}>{data.links[item]}</a></li>))
-    
-   }</ul>: null}
-    </div>
-);
+const RenderInfo = () => undefined;
 
 const Summary = ({data}) =>{

[Survived] EqualityOperator
client/src/components/Profile.jsx:15:6
 
 const RenderInfo = ({data}) =>(
   <div className='card'>
-    {data.likesTitle !=''? <p><strong>Title you liked: </strong>{data.likesTitle}</p>: null}
+    {data.likesTitle == ''? <p><strong>Title you liked: </strong>{data.likesTitle}</p>: null}
     {data.likesText !=''? <p><strong>Text you liked: </strong>{data.likesText}</p>: null}
     {data.likesAuthor !=''? <p><strong>likesAuthor: </strong>{data.likesAuthor},</p>: null}

[Survived] ConditionalExpression
client/src/components/Profile.jsx:15:6
 
 const RenderInfo = ({data}) =>(
   <div className='card'>
-    {data.likesTitle !=''? <p><strong>Title you liked: </strong>{data.likesTitle}</p>: null}
+    {true? <p><strong>Title you liked: </strong>{data.likesTitle}</p>: null}
     {data.likesText !=''? <p><strong>Text you liked: </strong>{data.likesText}</p>: null}
     {data.likesAuthor !=''? <p><strong>likesAuthor: </strong>{data.likesAuthor},</p>: null}

[Survived] ConditionalExpression
client/src/components/Profile.jsx:16:6
 const RenderInfo = ({data}) =>(
   <div className='card'>
     {data.likesTitle !=''? <p><strong>Title you liked: </strong>{data.likesTitle}</p>: null}
-    {data.likesText !=''? <p><strong>Text you liked: </strong>{data.likesText}</p>: null}
+    {true? <p><strong>Text you liked: </strong>{data.likesText}</p>: null}
     {data.likesAuthor !=''? <p><strong>likesAuthor: </strong>{data.likesAuthor},</p>: null}
     {data.category !=''? <p><strong>Category:</strong> {data.category}</p>: null}

[Survived] ConditionalExpression
client/src/components/Profile.jsx:16:6
 const RenderInfo = ({data}) =>(
   <div className='card'>
     {data.likesTitle !=''? <p><strong>Title you liked: </strong>{data.likesTitle}</p>: null}
-    {data.likesText !=''? <p><strong>Text you liked: </strong>{data.likesText}</p>: null}
+    {false? <p><strong>Text you liked: </strong>{data.likesText}</p>: null}
     {data.likesAuthor !=''? <p><strong>likesAuthor: </strong>{data.likesAuthor},</p>: null}
     {data.category !=''? <p><strong>Category:</strong> {data.category}</p>: null}

[Survived] EqualityOperator
client/src/components/Profile.jsx:17:6
   <div className='card'>
     {data.likesTitle !=''? <p><strong>Title you liked: </strong>{data.likesTitle}</p>: null}
     {data.likesText !=''? <p><strong>Text you liked: </strong>{data.likesText}</p>: null}
-    {data.likesAuthor !=''? <p><strong>likesAuthor: </strong>{data.likesAuthor},</p>: null}
+    {data.likesAuthor == ''? <p><strong>likesAuthor: </strong>{data.likesAuthor},</p>: null}
     {data.category !=''? <p><strong>Category:</strong> {data.category}</p>: null}
     {data.tags !=''? <p><strong>Tags:</strong>{data.tags}</p>: null}

[Survived] ConditionalExpression
client/src/components/Profile.jsx:17:6
   <div className='card'>
     {data.likesTitle !=''? <p><strong>Title you liked: </strong>{data.likesTitle}</p>: null}
     {data.likesText !=''? <p><strong>Text you liked: </strong>{data.likesText}</p>: null}
-    {data.likesAuthor !=''? <p><strong>likesAuthor: </strong>{data.likesAuthor},</p>: null}
+    {true? <p><strong>likesAuthor: </strong>{data.likesAuthor},</p>: null}
     {data.category !=''? <p><strong>Category:</strong> {data.category}</p>: null}
     {data.tags !=''? <p><strong>Tags:</strong>{data.tags}</p>: null}

[Survived] ConditionalExpression
client/src/components/Profile.jsx:18:6
     {data.likesTitle !=''? <p><strong>Title you liked: </strong>{data.likesTitle}</p>: null}
     {data.likesText !=''? <p><strong>Text you liked: </strong>{data.likesText}</p>: null}
     {data.likesAuthor !=''? <p><strong>likesAuthor: </strong>{data.likesAuthor},</p>: null}
-    {data.category !=''? <p><strong>Category:</strong> {data.category}</p>: null}
+    {false? <p><strong>Category:</strong> {data.category}</p>: null}
     {data.tags !=''? <p><strong>Tags:</strong>{data.tags}</p>: null}
     { String(data.links) != '' ? <ul><strong>Links:</strong>{Object.keys(data.links).map((item, index)=>(<li key={index}><a  href={ data.links[item]}>{data.links[item]}</a></li>))

[Survived] EqualityOperator
client/src/components/Profile.jsx:18:6
     {data.likesTitle !=''? <p><strong>Title you liked: </strong>{data.likesTitle}</p>: null}
     {data.likesText !=''? <p><strong>Text you liked: </strong>{data.likesText}</p>: null}
     {data.likesAuthor !=''? <p><strong>likesAuthor: </strong>{data.likesAuthor},</p>: null}
-    {data.category !=''? <p><strong>Category:</strong> {data.category}</p>: null}
+    {data.category == ''? <p><strong>Category:</strong> {data.category}</p>: null}
     {data.tags !=''? <p><strong>Tags:</strong>{data.tags}</p>: null}
     { String(data.links) != '' ? <ul><strong>Links:</strong>{Object.keys(data.links).map((item, index)=>(<li key={index}><a  href={ data.links[item]}>{data.links[item]}</a></li>))

[Survived] ConditionalExpression
client/src/components/Profile.jsx:19:6
     {data.likesText !=''? <p><strong>Text you liked: </strong>{data.likesText}</p>: null}
     {data.likesAuthor !=''? <p><strong>likesAuthor: </strong>{data.likesAuthor},</p>: null}
     {data.category !=''? <p><strong>Category:</strong> {data.category}</p>: null}
-    {data.tags !=''? <p><strong>Tags:</strong>{data.tags}</p>: null}
+    {true? <p><strong>Tags:</strong>{data.tags}</p>: null}
     { String(data.links) != '' ? <ul><strong>Links:</strong>{Object.keys(data.links).map((item, index)=>(<li key={index}><a  href={ data.links[item]}>{data.links[item]}</a></li>))
     

[Survived] ConditionalExpression
client/src/components/Profile.jsx:19:6
     {data.likesText !=''? <p><strong>Text you liked: </strong>{data.likesText}</p>: null}
     {data.likesAuthor !=''? <p><strong>likesAuthor: </strong>{data.likesAuthor},</p>: null}
     {data.category !=''? <p><strong>Category:</strong> {data.category}</p>: null}
-    {data.tags !=''? <p><strong>Tags:</strong>{data.tags}</p>: null}
+    {false? <p><strong>Tags:</strong>{data.tags}</p>: null}
     { String(data.links) != '' ? <ul><strong>Links:</strong>{Object.keys(data.links).map((item, index)=>(<li key={index}><a  href={ data.links[item]}>{data.links[item]}</a></li>))
     

[Survived] ConditionalExpression
client/src/components/Profile.jsx:20:7
     {data.likesAuthor !=''? <p><strong>likesAuthor: </strong>{data.likesAuthor},</p>: null}
     {data.category !=''? <p><strong>Category:</strong> {data.category}</p>: null}
     {data.tags !=''? <p><strong>Tags:</strong>{data.tags}</p>: null}
-    { String(data.links) != '' ? <ul><strong>Links:</strong>{Object.keys(data.links).map((item, index)=>(<li key={index}><a  href={ data.links[item]}>{data.links[item]}</a></li>))
+    { true ? <ul><strong>Links:</strong>{Object.keys(data.links).map((item, index)=>(<li key={index}><a  href={ data.links[item]}>{data.links[item]}</a></li>))
     
    }</ul>: null}

[Survived] EqualityOperator
client/src/components/Profile.jsx:20:7
     {data.likesAuthor !=''? <p><strong>likesAuthor: </strong>{data.likesAuthor},</p>: null}
     {data.category !=''? <p><strong>Category:</strong> {data.category}</p>: null}
     {data.tags !=''? <p><strong>Tags:</strong>{data.tags}</p>: null}
-    { String(data.links) != '' ? <ul><strong>Links:</strong>{Object.keys(data.links).map((item, index)=>(<li key={index}><a  href={ data.links[item]}>{data.links[item]}</a></li>))
+    { String(data.links) == '' ? <ul><strong>Links:</strong>{Object.keys(data.links).map((item, index)=>(<li key={index}><a  href={ data.links[item]}>{data.links[item]}</a></li>))
     
    }</ul>: null}

[Survived] BlockStatement
client/src/components/Profile.jsx:27:19
 );
 
 const Summary = ({data}) =>{
-  let newTags=()=>{
-    let tags=String(Object.keys(data).map(item => data[item].tags).join(',')).split(',');
-    let cache=[];
-      for(let i=0; i<tags.length;i++){
-          if(tags[i] !=='' && cache.indexOf(tags[i])==-1 )cache+=[tags[i]]+' ';   
-      }
-      return cache;
-  };
+  let newTags=()=>{};
 
   let newCat=()=>{ 

[Survived] ArrowFunction
client/src/components/Profile.jsx:28:43
 
 const Summary = ({data}) =>{
   let newTags=()=>{
-    let tags=String(Object.keys(data).map(item => data[item].tags).join(',')).split(',');
+    let tags=String(Object.keys(data).map(() => undefined).join(',')).split(',');
     let cache=[];
       for(let i=0; i<tags.length;i++){

[Survived] StringLiteral
client/src/components/Profile.jsx:28:85
 
 const Summary = ({data}) =>{
   let newTags=()=>{
-    let tags=String(Object.keys(data).map(item => data[item].tags).join(',')).split(',');
+    let tags=String(Object.keys(data).map(item => data[item].tags).join(',')).split("");
     let cache=[];
       for(let i=0; i<tags.length;i++){

[Survived] EqualityOperator
client/src/components/Profile.jsx:30:20
   let newTags=()=>{
     let tags=String(Object.keys(data).map(item => data[item].tags).join(',')).split(',');
     let cache=[];
-      for(let i=0; i<tags.length;i++){
+      for(let i=0; i <= tags.length;i++){
           if(tags[i] !=='' && cache.indexOf(tags[i])==-1 )cache+=[tags[i]]+' ';   
       }

[Survived] ConditionalExpression
client/src/components/Profile.jsx:30:20
   let newTags=()=>{
     let tags=String(Object.keys(data).map(item => data[item].tags).join(',')).split(',');
     let cache=[];
-      for(let i=0; i<tags.length;i++){
+      for(let i=0; false;i++){
           if(tags[i] !=='' && cache.indexOf(tags[i])==-1 )cache+=[tags[i]]+' ';   
       }

[Survived] ArithmeticOperator
client/src/components/Profile.jsx:31:66
     let tags=String(Object.keys(data).map(item => data[item].tags).join(',')).split(',');
     let cache=[];
       for(let i=0; i<tags.length;i++){
-          if(tags[i] !=='' && cache.indexOf(tags[i])==-1 )cache+=[tags[i]]+' ';   
+          if(tags[i] !=='' && cache.indexOf(tags[i])==-1 )cache+=[tags[i]] - ' ';   
       }
       return cache;

[Survived] ConditionalExpression
client/src/components/Profile.jsx:31:14
     let tags=String(Object.keys(data).map(item => data[item].tags).join(',')).split(',');
     let cache=[];
       for(let i=0; i<tags.length;i++){
-          if(tags[i] !=='' && cache.indexOf(tags[i])==-1 )cache+=[tags[i]]+' ';   
+          if(true && cache.indexOf(tags[i])==-1 )cache+=[tags[i]]+' ';   
       }
       return cache;

[Survived] BlockStatement
client/src/components/Profile.jsx:36:18
       return cache;
   };
 
-  let newCat=()=>{ 
-    let cat=String(Object.keys(data).map(item => data[item].category).join(',')).split(',');
-    let cache=[];
-    for(let i=0; i<cat.length;i++){
-        if(cat[i] !=='' && cache.indexOf(cat[i])==-1 )cache+=[cat[i]]+' ';  
-    }
-    return cache;
-  };
+  let newCat=()=>{};
 
   let newTitles=()=>{ 

[Survived] ArrowFunction
client/src/components/Profile.jsx:37:42
   };
 
   let newCat=()=>{ 
-    let cat=String(Object.keys(data).map(item => data[item].category).join(',')).split(',');
+    let cat=String(Object.keys(data).map(() => undefined).join(',')).split(',');
     let cache=[];
     for(let i=0; i<cat.length;i++){

[Survived] EqualityOperator
client/src/components/Profile.jsx:39:18
   let newCat=()=>{ 
     let cat=String(Object.keys(data).map(item => data[item].category).join(',')).split(',');
     let cache=[];
-    for(let i=0; i<cat.length;i++){
+    for(let i=0; i <= cat.length;i++){
         if(cat[i] !=='' && cache.indexOf(cat[i])==-1 )cache+=[cat[i]]+' ';  
     }

[Survived] UpdateOperator
client/src/components/Profile.jsx:39:31
   let newCat=()=>{ 
     let cat=String(Object.keys(data).map(item => data[item].category).join(',')).split(',');
     let cache=[];
-    for(let i=0; i<cat.length;i++){
+    for(let i=0; i<cat.length;i--){
         if(cat[i] !=='' && cache.indexOf(cat[i])==-1 )cache+=[cat[i]]+' ';  
     }

[Survived] LogicalOperator
client/src/components/Profile.jsx:40:12
     let cat=String(Object.keys(data).map(item => data[item].category).join(',')).split(',');
     let cache=[];
     for(let i=0; i<cat.length;i++){
-        if(cat[i] !=='' && cache.indexOf(cat[i])==-1 )cache+=[cat[i]]+' ';  
+        if(cat[i] !== '' || cache.indexOf(cat[i]) == -1 )cache+=[cat[i]]+' ';  
     }
     return cache;

[Survived] ArithmeticOperator
client/src/components/Profile.jsx:40:62
     let cat=String(Object.keys(data).map(item => data[item].category).join(',')).split(',');
     let cache=[];
     for(let i=0; i<cat.length;i++){
-        if(cat[i] !=='' && cache.indexOf(cat[i])==-1 )cache+=[cat[i]]+' ';  
+        if(cat[i] !=='' && cache.indexOf(cat[i])==-1 )cache+=[cat[i]] - ' ';  
     }
     return cache;

[Survived] BlockStatement
client/src/components/Profile.jsx:45:21
     return cache;
   };
 
-  let newTitles=()=>{ 
-    let cat=String(Object.keys(data).map(item => data[item].likesTitle).join(',')).split(',');
-    let cache=[];
-    for(let i=0; i<cat.length;i++){
-        if(cat[i] !=='' && cache.indexOf(cat[i])==-1 )cache+=`${[cat[i]]} , `;  
-    }
-    return cache;
-  };
+  let newTitles=()=>{};
 
 

[Survived] ArrowFunction
client/src/components/Profile.jsx:46:42
   };
 
   let newTitles=()=>{ 
-    let cat=String(Object.keys(data).map(item => data[item].likesTitle).join(',')).split(',');
+    let cat=String(Object.keys(data).map(() => undefined).join(',')).split(',');
     let cache=[];
     for(let i=0; i<cat.length;i++){

[Survived] StringLiteral
client/src/components/Profile.jsx:46:78
   };
 
   let newTitles=()=>{ 
-    let cat=String(Object.keys(data).map(item => data[item].likesTitle).join(',')).split(',');
+    let cat=String(Object.keys(data).map(item => data[item].likesTitle).join("")).split(',');
     let cache=[];
     for(let i=0; i<cat.length;i++){

[Survived] ArrayDeclaration
client/src/components/Profile.jsx:47:15
 
   let newTitles=()=>{ 
     let cat=String(Object.keys(data).map(item => data[item].likesTitle).join(',')).split(',');
-    let cache=[];
+    let cache=["Stryker was here"];
     for(let i=0; i<cat.length;i++){
         if(cat[i] !=='' && cache.indexOf(cat[i])==-1 )cache+=`${[cat[i]]} , `;  

[Survived] ConditionalExpression
client/src/components/Profile.jsx:49:12
     let cat=String(Object.keys(data).map(item => data[item].likesTitle).join(',')).split(',');
     let cache=[];
     for(let i=0; i<cat.length;i++){
-        if(cat[i] !=='' && cache.indexOf(cat[i])==-1 )cache+=`${[cat[i]]} , `;  
+        if(false && cache.indexOf(cat[i])==-1 )cache+=`${[cat[i]]} , `;  
     }
     return cache;

[Survived] ConditionalExpression
client/src/components/Profile.jsx:49:12
     let cat=String(Object.keys(data).map(item => data[item].likesTitle).join(',')).split(',');
     let cache=[];
     for(let i=0; i<cat.length;i++){
-        if(cat[i] !=='' && cache.indexOf(cat[i])==-1 )cache+=`${[cat[i]]} , `;  
+        if(false )cache+=`${[cat[i]]} , `;  
     }
     return cache;

[Survived] StringLiteral
client/src/components/Profile.jsx:58:84
 let titlesData = newTitles();
 let tagsData = newTags();
 const catData =newCat();
- let color=["#efd9ce","#dec0f1","#b79ced","#957fef","#7161ef", "#efd9ce","#dec0f1","#b79ced","#957fef","#7161ef"];
+ let color=["#efd9ce","#dec0f1","#b79ced","#957fef","#7161ef", "#efd9ce","#dec0f1","","#957fef","#7161ef"];
 
 

[Survived] StringLiteral
client/src/components/Profile.jsx:58:94
 let titlesData = newTitles();
 let tagsData = newTags();
 const catData =newCat();
- let color=["#efd9ce","#dec0f1","#b79ced","#957fef","#7161ef", "#efd9ce","#dec0f1","#b79ced","#957fef","#7161ef"];
+ let color=["#efd9ce","#dec0f1","#b79ced","#957fef","#7161ef", "#efd9ce","#dec0f1","#b79ced","","#7161ef"];
 
 

[Survived] ArithmeticOperator
client/src/components/Profile.jsx:66:34
   <div>
     <h2>Summary:</h2>
     <div className="summary-p">
-    <div>You have liked <strong>{Object.keys(data).length-1}</strong> items.</div>
+    <div>You have liked <strong>{Object.keys(data).length + 1}</strong> items.</div>

[Survived] ArrowFunction
client/src/components/Profile.jsx:71:67
 
     <div className="line"><strong>Book titles you liked:</strong></div>
-    <ul className='bookTitle'>{String(titlesData).split(' ,').map((e, i)=><li key={`title-data${i}`} style={{backgroundColor: color[Math.floor(Math.random()*color.length)]}}>{e}</li>) }</ul>
+    <ul className='bookTitle'>{String(titlesData).split(' ,').map(() => undefined) }</ul>
 </div>
     {/* <div>category {[String(data[item].category)].reduce((a,b) => a.includes(b) ? a.concat(b)  : null)}</div> */}

[Survived] ArithmeticOperator
client/src/components/Profile.jsx:71:144
 
     <div className="line"><strong>Book titles you liked:</strong></div>
-    <ul className='bookTitle'>{String(titlesData).split(' ,').map((e, i)=><li key={`title-data${i}`} style={{backgroundColor: color[Math.floor(Math.random()*color.length)]}}>{e}</li>) }</ul>
+    <ul className='bookTitle'>{String(titlesData).split(' ,').map((e, i)=><li key={`title-data${i}`} style={{backgroundColor: color[Math.floor(Math.random() / color.length)]}}>{e}</li>) }</ul>
 </div>
     {/* <div>category {[String(data[item].category)].reduce((a,b) => a.includes(b) ? a.concat(b)  : null)}</div> */}

[Survived] StringLiteral
client/src/components/Profile.jsx:80:15
 
 
 const Profile =  ( {loggedInUser} ) => {
-  console.log('Profile',loggedInUser );
+  console.log("",loggedInUser );
 const [user, setUser]=useState({
   username:'',

[Survived] StringLiteral
client/src/components/Profile.jsx:99:15
 
 //useEffect for RenderUser
   useEffect(() => {
-        fetch(`/api/user/profile?_id=${loggedInUser}`)
+        fetch("")
         .then((res) => res.json())
         .then((result) => {

[Survived] ArrowFunction
client/src/components/Profile.jsx:100:15
 //useEffect for RenderUser
   useEffect(() => {
         fetch(`/api/user/profile?_id=${loggedInUser}`)
-        .then((res) => res.json())
+        .then(() => undefined)
         .then((result) => {
            setUser({

[Survived] BlockStatement
client/src/components/Profile.jsx:101:27
   useEffect(() => {
         fetch(`/api/user/profile?_id=${loggedInUser}`)
         .then((res) => res.json())
-        .then((result) => {
-           setUser({
-            ...user,
-            username: result.username,
-            email: result.email
-          });
-          return user
-        });
+        .then((result) => {});
 
 //useEffect for RenderInfo

[Survived] ObjectLiteral
client/src/components/Profile.jsx:102:20
         fetch(`/api/user/profile?_id=${loggedInUser}`)
         .then((res) => res.json())
         .then((result) => {
-           setUser({
-            ...user,
-            username: result.username,
-            email: result.email
-          });
+           setUser({});
           return user
         });

[Survived] ArrowFunction
client/src/components/Profile.jsx:112:13
 
 //useEffect for RenderInfo
     fetch('/api/collections')
-      .then((res) => res.json())
+      .then(() => undefined)
       .then((result) => {
        result.forEach((val) => {

[Survived] BlockStatement
client/src/components/Profile.jsx:113:25
 //useEffect for RenderInfo
     fetch('/api/collections')
       .then((res) => res.json())
-      .then((result) => {
-       result.forEach((val) => {
-          if(val.likes.indexOf(loggedInUser)>-1  && (val.title) !=''){
-            let responseData={
-              likesTitle:val.title,
-              likesText:val.description,
-              likesAuthor:val.author,
-              category:val.category,
-              text:val.text,
-              tags:val.tags,
-              links:val.links,
-            };
-            setData(prev=> [...prev,responseData]);
-          }
-          
-      });
-              return data;
-  });
+      .then((result) => {});
   }, []);
 return (  

[Survived] BlockStatement
client/src/components/Profile.jsx:114:32
     fetch('/api/collections')
       .then((res) => res.json())
       .then((result) => {
-       result.forEach((val) => {
-          if(val.likes.indexOf(loggedInUser)>-1  && (val.title) !=''){
-            let responseData={
-              likesTitle:val.title,
-              likesText:val.description,
-              likesAuthor:val.author,
-              category:val.category,
-              text:val.text,
-              tags:val.tags,
-              links:val.links,
-            };
-            setData(prev=> [...prev,responseData]);
-          }
-          
-      });
+       result.forEach((val) => {});
               return data;
   });

[Survived] ConditionalExpression
client/src/components/Profile.jsx:115:53
       .then((res) => res.json())
       .then((result) => {
        result.forEach((val) => {
-          if(val.likes.indexOf(loggedInUser)>-1  && (val.title) !=''){
+          if(val.likes.indexOf(loggedInUser)>-1  && false){
             let responseData={
               likesTitle:val.title,

[Survived] EqualityOperator
client/src/components/Profile.jsx:115:14
       .then((res) => res.json())
       .then((result) => {
        result.forEach((val) => {
-          if(val.likes.indexOf(loggedInUser)>-1  && (val.title) !=''){
+          if(val.likes.indexOf(loggedInUser) >= -1  && (val.title) !=''){
             let responseData={
               likesTitle:val.title,

[Survived] ObjectLiteral
client/src/components/Profile.jsx:116:30
       .then((result) => {
        result.forEach((val) => {
           if(val.likes.indexOf(loggedInUser)>-1  && (val.title) !=''){
-            let responseData={
-              likesTitle:val.title,
-              likesText:val.description,
-              likesAuthor:val.author,
-              category:val.category,
-              text:val.text,
-              tags:val.tags,
-              links:val.links,
-            };
+            let responseData={};
             setData(prev=> [...prev,responseData]);
           }

[Survived] ArrowFunction
client/src/components/Profile.jsx:125:21
               tags:val.tags,
               links:val.links,
             };
-            setData(prev=> [...prev,responseData]);
+            setData(() => undefined);
           }
           

[Survived] BlockStatement
client/src/components/Profile.jsx:141:47
      <Summary data={data}/>
      <div className='cardWrap'>
      { 
-       Object.keys(data).map((item, index) => {
-        return  <RenderInfo 
-        key={index} 
-        data={data[item]}/>
-      })
+       Object.keys(data).map((item, index) => {})
      }
      </div>
