[Survived] ConditionalExpression
client/src/components/Login.jsx:12:9
   const login = (e) => {
     e.preventDefault();
 
-    if (!email || !password) return;
+    if (false) return;
 
     fetch('/api/login', {

[Survived] LogicalOperator
client/src/components/Login.jsx:12:9
   const login = (e) => {
     e.preventDefault();
 
-    if (!email || !password) return;
+    if (!email && !password) return;
 
     fetch('/api/login', {

[Survived] StringLiteral
client/src/components/Login.jsx:15:15
     if (!email || !password) return;
 
     fetch('/api/login', {
-      method: 'POST',
+      method: "",
       headers: {
         'Content-Type': 'application/json',

[Survived] ObjectLiteral
client/src/components/Login.jsx:16:16
 
     fetch('/api/login', {
       method: 'POST',
-      headers: {
-        'Content-Type': 'application/json',
-      },
+      headers: {},
       body: JSON.stringify({ email, password }),
     })

[Survived] ObjectLiteral
client/src/components/Login.jsx:19:28
       headers: {
         'Content-Type': 'application/json',
       },
-      body: JSON.stringify({ email, password }),
+      body: JSON.stringify({}),
     })
       .then((response) => response.json())

[Survived] ArrowFunction
client/src/components/Login.jsx:52:23
             type="text"
             className="input-label__input"
             id="login-email"
-            onChange={(e) => setEmail(e.target.value)}
+            onChange={() => undefined}
             value={email}
           />

[Survived] ArrowFunction
client/src/components/Login.jsx:63:23
             type="password"
             className="input-label__input"
             id="login-password"
-            onChange={(e) => setPassword(e.target.value)}
+            onChange={() => undefined}
             value={password}
           />
