[Killed] BlockStatement
client/src/components/WithAuth.jsx:15:19
   // console.log('useState loading', loading);
   // console.log('useState redirect', redirect);
 
-  useEffect(() => {
-    fetch('/api/checkToken')
-      .then((res) => {
-        if (res.status === 200) {
-          setLoading(false);
-          return res.json();
-        }
-        const error = new Error(res.statusText);
-        console.error('Error: fetch /api/checkToken did not return status 200', error);
-        // throw error;
-      })
-      .then((data) => {
-        console.log('Success: fetch /api/checkToken', data);
-        setLoggedInUser(data);
-      })
-      .catch((err) => {
-        console.error('Error: fetch /api/checkToken caught error', err);
-        setLoggedInUser('');
-        setLoading(false);
-        setRedirect(true);
-      });
-  }, []);
+  useEffect(() => {}, []);
 
   // console.log('useEffect loading', loading);

[Survived] BlockStatement
client/src/components/WithAuth.jsx:17:22
 
   useEffect(() => {
     fetch('/api/checkToken')
-      .then((res) => {
-        if (res.status === 200) {
-          setLoading(false);
-          return res.json();
-        }
-        const error = new Error(res.statusText);
-        console.error('Error: fetch /api/checkToken did not return status 200', error);
-        // throw error;
-      })
+      .then((res) => {})
       .then((data) => {
         console.log('Success: fetch /api/checkToken', data);

[Survived] StringLiteral
client/src/components/WithAuth.jsx:27:21
         // throw error;
       })
       .then((data) => {
-        console.log('Success: fetch /api/checkToken', data);
+        console.log("", data);
         setLoggedInUser(data);
       })

[Killed] BlockStatement
client/src/components/WithAuth.jsx:30:23
         console.log('Success: fetch /api/checkToken', data);
         setLoggedInUser(data);
       })
-      .catch((err) => {
-        console.error('Error: fetch /api/checkToken caught error', err);
-        setLoggedInUser('');
-        setLoading(false);
-        setRedirect(true);
-      });
+      .catch((err) => {});
   }, []);
 
