[Killed] ArrowFunction
client/src/components/PageNotFound.jsx:5:22
 
 import './PageNotFound.css';
 
-const PageNotFound = () => (
-  <div className="page-not-found">Page not found.</div>
-);
+const PageNotFound = () => undefined;
 
 export default PageNotFound;
