[Survived] ArrowFunction
client/src/components/Register.jsx:12:30
 
 import './Register.css';
 
-const useStyles = makeStyles((theme) => ({
-  root: {
-    display: 'flex',
-    flexWrap: 'wrap',
-  },
-  margin: {
-    margin: theme.spacing(1),
-  },
-  withoutLabel: {
-    marginTop: theme.spacing(3),
-  },
-  textField: {
-    width: '40ch',
-  },
-}));
+const useStyles = makeStyles(() => undefined);
 
 const register = ({ setLoggedInUser }) => {

[Survived] ObjectLiteral
client/src/components/Register.jsx:20:17
   margin: {
     margin: theme.spacing(1),
   },
-  withoutLabel: {
-    marginTop: theme.spacing(3),
-  },
+  withoutLabel: {},
   textField: {
     width: '40ch',

[Survived] StringLiteral
client/src/components/Register.jsx:40:15
   const [username, setUsername] = useState('');
   const [password, setPassword] = useState({
     amount: '',
-    password: '',
+    password: "Stryker was here!",
     weight: '',
     weightRange: '',

[Survived] StringLiteral
client/src/components/Register.jsx:41:13
   const [password, setPassword] = useState({
     amount: '',
     password: '',
-    weight: '',
+    weight: "Stryker was here!",
     weightRange: '',
     showPassword: false,

[Survived] BooleanLiteral
client/src/components/Register.jsx:43:19
     password: '',
     weight: '',
     weightRange: '',
-    showPassword: false,
+    showPassword: true,
   });
   const [passwordConfirm, setPasswordConfirm] = useState({

[Survived] StringLiteral
client/src/components/Register.jsx:46:13
     showPassword: false,
   });
   const [passwordConfirm, setPasswordConfirm] = useState({
-    amount: '',
+    amount: "Stryker was here!",
     password: '',
     weight: '',

[Survived] StringLiteral
client/src/components/Register.jsx:49:18
     amount: '',
     password: '',
     weight: '',
-    weightRange: '',
+    weightRange: "Stryker was here!",
     showPassword: false,
   });

[Survived] BooleanLiteral
client/src/components/Register.jsx:57:24
   // Error messages
   // --------------
 
-  let containsErrors = false;
+  let containsErrors = true;
   const [error, setError] = useState(false);
 

[Survived] BooleanLiteral
client/src/components/Register.jsx:58:38
   // --------------
 
   let containsErrors = false;
-  const [error, setError] = useState(false);
+  const [error, setError] = useState(true);
 
   const [errorEmail, setErrorEmail] = useState('');

[Survived] BlockStatement
client/src/components/Register.jsx:69:36
   // Clear out error messages
   // ------------------------
 
-  const clearErrorMessages = () => {
-    containsErrors = false;
-    setError(false);
-    setErrorEmail('');
-    setErrorUsername('');
-    setErrorPassword('');
-    setErrorPasswordConfirm('');
-  };
+  const clearErrorMessages = () => {};
 
   // ---------------------

[Survived] BooleanLiteral
client/src/components/Register.jsx:70:22
   // ------------------------
 
   const clearErrorMessages = () => {
-    containsErrors = false;
+    containsErrors = true;
     setError(false);
     setErrorEmail('');

[Survived] BooleanLiteral
client/src/components/Register.jsx:71:14
 
   const clearErrorMessages = () => {
     containsErrors = false;
-    setError(false);
+    setError(true);
     setErrorEmail('');
     setErrorUsername('');

[Survived] BlockStatement
client/src/components/Register.jsx:82:37
   // Validate email format
   // ---------------------
 
-  const validateEmailFormat = () => {
-    // Regex for email validation from: https://stackoverflow.com/a/46181/2040509
-    const regex = /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/;
-
-    if (!regex.test(String(email).toLowerCase())) {
-      setErrorEmail('Please enter a valid email');
-      containsErrors = true;
-      setError(true);
-      return;
-    }
-
-    setErrorEmail('');
-  };
+  const validateEmailFormat = () => {};
 
   // ------------------------

[Survived] BooleanLiteral
client/src/components/Register.jsx:86:9
     // Regex for email validation from: https://stackoverflow.com/a/46181/2040509
     const regex = /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/;
 
-    if (!regex.test(String(email).toLowerCase())) {
+    if (regex.test(String(email).toLowerCase())) {
       setErrorEmail('Please enter a valid email');
       containsErrors = true;

[Survived] ConditionalExpression
client/src/components/Register.jsx:86:9
     // Regex for email validation from: https://stackoverflow.com/a/46181/2040509
     const regex = /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/;
 
-    if (!regex.test(String(email).toLowerCase())) {
+    if (false) {
       setErrorEmail('Please enter a valid email');
       containsErrors = true;

[Survived] StringLiteral
client/src/components/Register.jsx:87:21
     const regex = /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/;
 
     if (!regex.test(String(email).toLowerCase())) {
-      setErrorEmail('Please enter a valid email');
+      setErrorEmail("");
       containsErrors = true;
       setError(true);

[Survived] BooleanLiteral
client/src/components/Register.jsx:88:24
 
     if (!regex.test(String(email).toLowerCase())) {
       setErrorEmail('Please enter a valid email');
-      containsErrors = true;
+      containsErrors = false;
       setError(true);
       return;

[Survived] BooleanLiteral
client/src/components/Register.jsx:89:16
     if (!regex.test(String(email).toLowerCase())) {
       setErrorEmail('Please enter a valid email');
       containsErrors = true;
-      setError(true);
+      setError(false);
       return;
     }

[Survived] BlockStatement
client/src/components/Register.jsx:100:40
   // Validate username format
   // ------------------------
 
-  const validateUsernameFormat = () => {
-    // Regex for username validation from: https://www.regextester.com/104030
-    const regex = /^[a-z0-9_-]{3,16}$/;
-
-    if (!regex.test(username)) {
-      setErrorUsername('Please enter a valid username');
-      containsErrors = true;
-      setError(true);
-      return;
-    }
-
-    setErrorUsername('');
-  };
+  const validateUsernameFormat = () => {};
 
   // ------------------------

[Survived] BooleanLiteral
client/src/components/Register.jsx:104:9
     // Regex for username validation from: https://www.regextester.com/104030
     const regex = /^[a-z0-9_-]{3,16}$/;
 
-    if (!regex.test(username)) {
+    if (regex.test(username)) {
       setErrorUsername('Please enter a valid username');
       containsErrors = true;

[Survived] ConditionalExpression
client/src/components/Register.jsx:104:9
     // Regex for username validation from: https://www.regextester.com/104030
     const regex = /^[a-z0-9_-]{3,16}$/;
 
-    if (!regex.test(username)) {
+    if (false) {
       setErrorUsername('Please enter a valid username');
       containsErrors = true;

[Survived] BooleanLiteral
client/src/components/Register.jsx:106:24
 
     if (!regex.test(username)) {
       setErrorUsername('Please enter a valid username');
-      containsErrors = true;
+      containsErrors = false;
       setError(true);
       return;

[Survived] BlockStatement
client/src/components/Register.jsx:118:40
   // Validate password format
   // ------------------------
 
-  const validatePasswordFormat = () => {
-    if (String(password).length < 3) {
-      setErrorPassword('Please enter a valid password');
-      containsErrors = true;
-      setError(true);
-      return;
-    }
-
-    setErrorPassword('');
-  };
+  const validatePasswordFormat = () => {};
 
   // -----------------------

[Survived] BlockStatement
client/src/components/Register.jsx:119:38
   // ------------------------
 
   const validatePasswordFormat = () => {
-    if (String(password).length < 3) {
-      setErrorPassword('Please enter a valid password');
-      containsErrors = true;
-      setError(true);
-      return;
-    }
+    if (String(password).length < 3) {}
 
     setErrorPassword('');

[Survived] EqualityOperator
client/src/components/Register.jsx:119:9
   // ------------------------
 
   const validatePasswordFormat = () => {
-    if (String(password).length < 3) {
+    if (String(password).length >= 3) {
       setErrorPassword('Please enter a valid password');
       containsErrors = true;

[Survived] BooleanLiteral
client/src/components/Register.jsx:121:24
   const validatePasswordFormat = () => {
     if (String(password).length < 3) {
       setErrorPassword('Please enter a valid password');
-      containsErrors = true;
+      containsErrors = false;
       setError(true);
       return;

[Survived] BlockStatement
client/src/components/Register.jsx:133:39
   // Validate password match
   // -----------------------
 
-  const validatePasswordMatch = () => {
-    if (password.password !== passwordConfirm.password) {
-      setErrorPasswordConfirm("Password fields don't match");
-      containsErrors = true;
-      setError(true);
-      return;
-    }
-
-    setErrorPasswordConfirm('');
-  };
+  const validatePasswordMatch = () => {};
 
   // --------------

[Survived] EqualityOperator
client/src/components/Register.jsx:134:9
   // -----------------------
 
   const validatePasswordMatch = () => {
-    if (password.password !== passwordConfirm.password) {
+    if (password.password === passwordConfirm.password) {
       setErrorPasswordConfirm("Password fields don't match");
       containsErrors = true;

[Survived] ConditionalExpression
client/src/components/Register.jsx:134:9
   // -----------------------
 
   const validatePasswordMatch = () => {
-    if (password.password !== passwordConfirm.password) {
+    if (false) {
       setErrorPasswordConfirm("Password fields don't match");
       containsErrors = true;

[Survived] BooleanLiteral
client/src/components/Register.jsx:136:24
   const validatePasswordMatch = () => {
     if (password.password !== passwordConfirm.password) {
       setErrorPasswordConfirm("Password fields don't match");
-      containsErrors = true;
+      containsErrors = false;
       setError(true);
       return;

[Survived] StringLiteral
client/src/components/Register.jsx:141:29
       return;
     }
 
-    setErrorPasswordConfirm('');
+    setErrorPasswordConfirm("Stryker was here!");
   };
 

[Survived] ObjectLiteral
client/src/components/Register.jsx:150:22
   // TODO: clear any tokens that might be lingering in the users cookies
 
   const sendUserData = async () => {
-    const userInfo = { email, username, password: password.password };
+    const userInfo = {};
 
     const response = await fetch('/api/register', {

[Survived] ObjectLiteral
client/src/components/Register.jsx:152:51
   const sendUserData = async () => {
     const userInfo = { email, username, password: password.password };
 
-    const response = await fetch('/api/register', {
-      method: 'POST',
-      headers: {
-        'Content-Type': 'application/json',
-      },
-      body: JSON.stringify(userInfo),
-    });
+    const response = await fetch('/api/register', {});
 
     const data = await response.json();

[Survived] StringLiteral
client/src/components/Register.jsx:153:15
     const userInfo = { email, username, password: password.password };
 
     const response = await fetch('/api/register', {
-      method: 'POST',
+      method: "",
       headers: {
         'Content-Type': 'application/json',

[Survived] BlockStatement
client/src/components/Register.jsx:164:34
     console.log(data);
 
     // Email already exists
-    if (data.emailAlreadyExists) {
-      setErrorEmail('An account with that email already exists');
-      containsErrors = true;
-      setError(true);
-    }
+    if (data.emailAlreadyExists) {}
 
     // Username is taken

[Survived] ConditionalExpression
client/src/components/Register.jsx:164:9
     console.log(data);
 
     // Email already exists
-    if (data.emailAlreadyExists) {
+    if (false) {
       setErrorEmail('An account with that email already exists');
       containsErrors = true;

[Survived] StringLiteral
client/src/components/Register.jsx:165:21
 
     // Email already exists
     if (data.emailAlreadyExists) {
-      setErrorEmail('An account with that email already exists');
+      setErrorEmail("");
       containsErrors = true;
       setError(true);

[Survived] BooleanLiteral
client/src/components/Register.jsx:166:24
     // Email already exists
     if (data.emailAlreadyExists) {
       setErrorEmail('An account with that email already exists');
-      containsErrors = true;
+      containsErrors = false;
       setError(true);
     }

[Survived] BlockStatement
client/src/components/Register.jsx:171:29
     }
 
     // Username is taken
-    if (data.usernameTaken) {
-      setErrorUsername('Username already taken');
-      containsErrors = true;
-      setError(true);
-    }
+    if (data.usernameTaken) {}
 
     // TODO: handle any server errors that might have occured

[Survived] ConditionalExpression
client/src/components/Register.jsx:171:9
     }
 
     // Username is taken
-    if (data.usernameTaken) {
+    if (false) {
       setErrorUsername('Username already taken');
       containsErrors = true;

[Survived] BooleanLiteral
client/src/components/Register.jsx:173:24
     // Username is taken
     if (data.usernameTaken) {
       setErrorUsername('Username already taken');
-      containsErrors = true;
+      containsErrors = false;
       setError(true);
     }

[Survived] BlockStatement
client/src/components/Register.jsx:179:38
 
     // TODO: handle any server errors that might have occured
 
-    if (data.registrationSuccessful) {
-      // TODO: show successful registration message
-      setLoggedInUser(data.userId);
-      history.push('/');
-    }
+    if (data.registrationSuccessful) {}
   };
 

[Survived] ConditionalExpression
client/src/components/Register.jsx:179:9
 
     // TODO: handle any server errors that might have occured
 
-    if (data.registrationSuccessful) {
+    if (false) {
       // TODO: show successful registration message
       setLoggedInUser(data.userId);

[Survived] BlockStatement
client/src/components/Register.jsx:190:29
   // Form submit
   // -----------
 
-  const submitForm = (e) => {
-    e.preventDefault();
-
-    // Clear our all errors before validating
-    clearErrorMessages();
-
-    // Validate all inputs
-    validateEmailFormat();
-    validateUsernameFormat();
-    validatePasswordFormat();
-    validatePasswordMatch();
-
-    // If any of the inputs don't pass validation stop submission
-    if (containsErrors) return;
-
-    // Send the data to the backend and do backend validation
-    sendUserData();
-  };
+  const submitForm = (e) => {};
 
   const handlePasswordChange = (prop) => (event) => {

[Survived] ConditionalExpression
client/src/components/Register.jsx:203:9
     validatePasswordMatch();
 
     // If any of the inputs don't pass validation stop submission
-    if (containsErrors) return;
+    if (false) return;
 
     // Send the data to the backend and do backend validation

[Survived] ConditionalExpression
client/src/components/Register.jsx:203:9
     validatePasswordMatch();
 
     // If any of the inputs don't pass validation stop submission
-    if (containsErrors) return;
+    if (true) return;
 
     // Send the data to the backend and do backend validation

[Survived] ArrowFunction
client/src/components/Register.jsx:209:32
     sendUserData();
   };
 
-  const handlePasswordChange = (prop) => (event) => {
-    setPassword({ ...password, [prop]: event.target.value });
-  };
+  const handlePasswordChange = () => undefined;
 
   const handleClickShowPassword = () => {

[Survived] BlockStatement
client/src/components/Register.jsx:209:53
     sendUserData();
   };
 
-  const handlePasswordChange = (prop) => (event) => {
-    setPassword({ ...password, [prop]: event.target.value });
-  };
+  const handlePasswordChange = (prop) => (event) => {};
 
   const handleClickShowPassword = () => {

[Survived] ObjectLiteral
client/src/components/Register.jsx:210:17
   };
 
   const handlePasswordChange = (prop) => (event) => {
-    setPassword({ ...password, [prop]: event.target.value });
+    setPassword({});
   };
 

[Survived] BlockStatement
client/src/components/Register.jsx:213:41
     setPassword({ ...password, [prop]: event.target.value });
   };
 
-  const handleClickShowPassword = () => {
-    setPassword({ ...password, showPassword: !password.showPassword });
-  };
+  const handleClickShowPassword = () => {};
 
   const handlePasswordConfirmChange = (prop) => (event) => {

[Survived] BooleanLiteral
client/src/components/Register.jsx:214:46
   };
 
   const handleClickShowPassword = () => {
-    setPassword({ ...password, showPassword: !password.showPassword });
+    setPassword({ ...password, showPassword: password.showPassword });
   };
 

[Survived] ObjectLiteral
client/src/components/Register.jsx:214:17
   };
 
   const handleClickShowPassword = () => {
-    setPassword({ ...password, showPassword: !password.showPassword });
+    setPassword({});
   };
 

[Survived] BlockStatement
client/src/components/Register.jsx:217:60
     setPassword({ ...password, showPassword: !password.showPassword });
   };
 
-  const handlePasswordConfirmChange = (prop) => (event) => {
-    setPasswordConfirm({ ...passwordConfirm, [prop]: event.target.value });
-  };
+  const handlePasswordConfirmChange = (prop) => (event) => {};
 
   const handleClickShowPasswordConfirm = () => {

[Survived] ArrowFunction
client/src/components/Register.jsx:217:39
     setPassword({ ...password, showPassword: !password.showPassword });
   };
 
-  const handlePasswordConfirmChange = (prop) => (event) => {
-    setPasswordConfirm({ ...passwordConfirm, [prop]: event.target.value });
-  };
+  const handlePasswordConfirmChange = () => undefined;
 
   const handleClickShowPasswordConfirm = () => {

[Survived] ObjectLiteral
client/src/components/Register.jsx:218:24
   };
 
   const handlePasswordConfirmChange = (prop) => (event) => {
-    setPasswordConfirm({ ...passwordConfirm, [prop]: event.target.value });
+    setPasswordConfirm({});
   };
 

[Survived] BlockStatement
client/src/components/Register.jsx:221:48
     setPasswordConfirm({ ...passwordConfirm, [prop]: event.target.value });
   };
 
-  const handleClickShowPasswordConfirm = () => {
-    setPasswordConfirm({ ...passwordConfirm, showPassword: !passwordConfirm.showPassword });
-  };
+  const handleClickShowPasswordConfirm = () => {};
 
   const handleMouseDownPassword = (event) => {

[Survived] BooleanLiteral
client/src/components/Register.jsx:222:60
   };
 
   const handleClickShowPasswordConfirm = () => {
-    setPasswordConfirm({ ...passwordConfirm, showPassword: !passwordConfirm.showPassword });
+    setPasswordConfirm({ ...passwordConfirm, showPassword: passwordConfirm.showPassword });
   };
 

[Survived] BlockStatement
client/src/components/Register.jsx:225:46
     setPasswordConfirm({ ...passwordConfirm, showPassword: !passwordConfirm.showPassword });
   };
 
-  const handleMouseDownPassword = (event) => {
-    event.preventDefault();
-  };
+  const handleMouseDownPassword = (event) => {};
 
   const handleMouseDownPasswordConfirm = (event) => {

[Survived] BlockStatement
client/src/components/Register.jsx:229:53
     event.preventDefault();
   };
 
-  const handleMouseDownPasswordConfirm = (event) => {
-    event.preventDefault();
-  };
+  const handleMouseDownPasswordConfirm = (event) => {};
 
   // ------

[Survived] LogicalOperator
client/src/components/Register.jsx:241:8
     <div className="register-page">
       <h1>Register</h1>
 
-      {error && (
-        <ul className="form-error">
-          {errorEmail && <li className="form-error__item">{errorEmail}</li>}
-          {errorUsername && (
-            <li className="form-error__item">{errorUsername}</li>
-          )}
-          {errorPassword && (
-            <li className="form-error__item">{errorPassword}</li>
-          )}
-          {errorPasswordConfirm && (
-            <li className="form-error__item">{errorPasswordConfirm}</li>
-          )}
-        </ul>
-      )}
+      {error || <ul className="form-error">
+          {errorEmail && <li className="form-error__item">{errorEmail}</li>}
+          {errorUsername && <li className="form-error__item">{errorUsername}</li>}
+          {errorPassword && <li className="form-error__item">{errorPassword}</li>}
+          {errorPasswordConfirm && <li className="form-error__item">{errorPasswordConfirm}</li>}
+        </ul>}
 
       <form className="register-form">

[Survived] ConditionalExpression
client/src/components/Register.jsx:241:8
     <div className="register-page">
       <h1>Register</h1>
 
-      {error && (
-        <ul className="form-error">
-          {errorEmail && <li className="form-error__item">{errorEmail}</li>}
-          {errorUsername && (
-            <li className="form-error__item">{errorUsername}</li>
-          )}
-          {errorPassword && (
-            <li className="form-error__item">{errorPassword}</li>
-          )}
-          {errorPasswordConfirm && (
-            <li className="form-error__item">{errorPasswordConfirm}</li>
-          )}
-        </ul>
-      )}
+      {false}
 
       <form className="register-form">

[Survived] LogicalOperator
client/src/components/Register.jsx:243:12
 
       {error && (
         <ul className="form-error">
-          {errorEmail && <li className="form-error__item">{errorEmail}</li>}
+          {errorEmail || <li className="form-error__item">{errorEmail}</li>}
           {errorUsername && (
             <li className="form-error__item">{errorUsername}</li>

[Survived] ConditionalExpression
client/src/components/Register.jsx:243:12
 
       {error && (
         <ul className="form-error">
-          {errorEmail && <li className="form-error__item">{errorEmail}</li>}
+          {true}
           {errorUsername && (
             <li className="form-error__item">{errorUsername}</li>

[Survived] LogicalOperator
client/src/components/Register.jsx:244:12
       {error && (
         <ul className="form-error">
           {errorEmail && <li className="form-error__item">{errorEmail}</li>}
-          {errorUsername && (
-            <li className="form-error__item">{errorUsername}</li>
-          )}
+          {errorUsername || <li className="form-error__item">{errorUsername}</li>}
           {errorPassword && (
             <li className="form-error__item">{errorPassword}</li>

[Survived] ConditionalExpression
client/src/components/Register.jsx:244:12
       {error && (
         <ul className="form-error">
           {errorEmail && <li className="form-error__item">{errorEmail}</li>}
-          {errorUsername && (
-            <li className="form-error__item">{errorUsername}</li>
-          )}
+          {true}
           {errorPassword && (
             <li className="form-error__item">{errorPassword}</li>

[Survived] ConditionalExpression
client/src/components/Register.jsx:247:12
           {errorUsername && (
             <li className="form-error__item">{errorUsername}</li>
           )}
-          {errorPassword && (
-            <li className="form-error__item">{errorPassword}</li>
-          )}
+          {true}
           {errorPasswordConfirm && (
             <li className="form-error__item">{errorPasswordConfirm}</li>

[Survived] ConditionalExpression
client/src/components/Register.jsx:247:12
           {errorUsername && (
             <li className="form-error__item">{errorUsername}</li>
           )}
-          {errorPassword && (
-            <li className="form-error__item">{errorPassword}</li>
-          )}
+          {false}
           {errorPasswordConfirm && (
             <li className="form-error__item">{errorPasswordConfirm}</li>

[Survived] ConditionalExpression
client/src/components/Register.jsx:250:12
           {errorPassword && (
             <li className="form-error__item">{errorPassword}</li>
           )}
-          {errorPasswordConfirm && (
-            <li className="form-error__item">{errorPasswordConfirm}</li>
-          )}
+          {false}
         </ul>
       )}

[Survived] ConditionalExpression
client/src/components/Register.jsx:250:12
           {errorPassword && (
             <li className="form-error__item">{errorPassword}</li>
           )}
-          {errorPasswordConfirm && (
-            <li className="form-error__item">{errorPasswordConfirm}</li>
-          )}
+          {true}
         </ul>
       )}

[Survived] ArrowFunction
client/src/components/Register.jsx:258:94
 
       <form className="register-form">
         <FormControl className={clsx(classes.margin, classes.textField)} variant="outlined">
-          <TextField id="outlined-required-email" label="Email" variant="outlined" onChange={(e) => setEmail(e.target.value)} value={email} />
+          <TextField id="outlined-required-email" label="Email" variant="outlined" onChange={() => undefined} value={email} />
         </FormControl>
         <br />

[Survived] ArrowFunction
client/src/components/Register.jsx:262:100
         </FormControl>
         <br />
         <FormControl className={clsx(classes.margin, classes.textField)} variant="outlined">
-          <TextField id="outlined-required-username" label="Username" variant="outlined" onChange={(e) => setUsername(e.target.value)} value={username} />
+          <TextField id="outlined-required-username" label="Username" variant="outlined" onChange={() => undefined} value={username} />
         </FormControl>
         <br />

[Survived] StringLiteral
client/src/components/Register.jsx:269:43
           <InputLabel htmlFor="outlined-adornment-password">Password</InputLabel>
           <OutlinedInput
             id="outlined-adornment-password"
-            type={password.showPassword ? 'text' : 'password'}
+            type={password.showPassword ? "" : 'password'}
             value={password.password}
             onChange={handlePasswordChange('password')}

[Survived] StringLiteral
client/src/components/Register.jsx:271:44
             id="outlined-adornment-password"
             type={password.showPassword ? 'text' : 'password'}
             value={password.password}
-            onChange={handlePasswordChange('password')}
+            onChange={handlePasswordChange("")}
             endAdornment={(
               <InputAdornment position="end">

[Survived] StringLiteral
client/src/components/Register.jsx:294:51
             id="outlined-adornment-password-confirm"
             type={passwordConfirm.showPassword ? 'text' : 'password'}
             value={passwordConfirm.password}
-            onChange={handlePasswordConfirmChange('password')}
+            onChange={handlePasswordConfirmChange("")}
             endAdornment={(
               <InputAdornment position="end">
