[Survived] BlockStatement
learnvault/server/utils/verifyToken.js:3:41
 const jwt = require('jsonwebtoken');
 
-const verifyToken = (req, res, next) => {
-  const { token } = req.cookies;
-
-  if (!token) {
-    res.error = 'Unauthorized: No token provided';
-    return res.status(401).send(res.error);
-  }
-
-  return jwt.verify(token, process.env.JWT_SECRET, (err, decoded) => {
-    if (err) {
-      return res.status(401).send('Unauthorized: Invalid token');
-    }
-
-    res.locals.userId = JSON.stringify(decoded.userId);
-    // console.log('verifyToken userId', res.locals.userId);
-    return next();
-  });
-};
+const verifyToken = (req, res, next) => {};
 
 module.exports = verifyToken;

[Survived] BlockStatement
learnvault/server/utils/verifyToken.js:6:15
 const verifyToken = (req, res, next) => {
   const { token } = req.cookies;
 
-  if (!token) {
-    res.error = 'Unauthorized: No token provided';
-    return res.status(401).send(res.error);
-  }
+  if (!token) {}
 
   return jwt.verify(token, process.env.JWT_SECRET, (err, decoded) => {

[Survived] BlockStatement
learnvault/server/utils/verifyToken.js:11:70
     return res.status(401).send(res.error);
   }
 
-  return jwt.verify(token, process.env.JWT_SECRET, (err, decoded) => {
-    if (err) {
-      return res.status(401).send('Unauthorized: Invalid token');
-    }
-
-    res.locals.userId = JSON.stringify(decoded.userId);
-    // console.log('verifyToken userId', res.locals.userId);
-    return next();
-  });
+  return jwt.verify(token, process.env.JWT_SECRET, (err, decoded) => {});
 };
 

[Survived] ConditionalExpression
learnvault/server/utils/verifyToken.js:12:9
   }
 
   return jwt.verify(token, process.env.JWT_SECRET, (err, decoded) => {
-    if (err) {
+    if (true) {
       return res.status(401).send('Unauthorized: Invalid token');
     }

[Survived] BlockStatement
learnvault/server/utils/verifyToken.js:12:14
   }
 
   return jwt.verify(token, process.env.JWT_SECRET, (err, decoded) => {
-    if (err) {
-      return res.status(401).send('Unauthorized: Invalid token');
-    }
+    if (err) {}
 
     res.locals.userId = JSON.stringify(decoded.userId);
