[Survived] ArrowFunction
client/src/components/ResultAlert.jsx:5:21
 
 import './ResultAlert.css';
 
-const ResultAlert = (props) => (
-  <div id="result-alert">
-    {props.result === 'error' ? (
-      <div>
-        <button
-          type="button"
-          onClick={() => {
-            props.setResult(null);
-          }}
-        >
-          X
-        </button>
-        <h1>Error in AddCollection</h1>
-        <p>Please check form and try again</p>
-      </div>
-    ) : (
-      <div>
-        <h1>AddCollection successful</h1>
-        <p></p>
-      </div>
-    )}
-  </div>
-);
+const ResultAlert = () => undefined;
 export default ResultAlert;
 

[Survived] ConditionalExpression
client/src/components/ResultAlert.jsx:7:6
 
 const ResultAlert = (props) => (
   <div id="result-alert">
-    {props.result === 'error' ? (
+    {true ? (
       <div>
         <button

[Survived] ConditionalExpression
client/src/components/ResultAlert.jsx:7:6
 
 const ResultAlert = (props) => (
   <div id="result-alert">
-    {props.result === 'error' ? (
+    {false ? (
       <div>
         <button

[Survived] BlockStatement
client/src/components/ResultAlert.jsx:11:26
       <div>
         <button
           type="button"
-          onClick={() => {
-            props.setResult(null);
-          }}
+          onClick={() => {}}
         >
           X
