[Survived] ArrowFunction
src/components/collections/AddCollection.jsx:15:30
 import './AddCollection.css';
 import ResultAlert from '../ResultAlert';
 
-const useStyles = makeStyles((theme) => ({
-  root: {
-    display: 'flex',
-    flexWrap: 'wrap',
-  },
-  margin: {
-    margin: theme.spacing(1),
-  },
-  formControl: {
-    margin: theme.spacing(3),
-  },
-  withoutLabel: {
-    marginTop: theme.spacing(3),
-  },
-  textField: {
-    width: '40ch',
-  },
-}));
+const useStyles = makeStyles(() => undefined);
 
 const AddCollection = ({ loggedInUser }) => {

[Survived] StringLiteral
src/components/collections/AddCollection.jsx:18:15
 const useStyles = makeStyles((theme) => ({
   root: {
     display: 'flex',
-    flexWrap: 'wrap',
+    flexWrap: "",
   },
   margin: {

[Survived] ObjectLiteral
src/components/collections/AddCollection.jsx:23:16
   margin: {
     margin: theme.spacing(1),
   },
-  formControl: {
-    margin: theme.spacing(3),
-  },
+  formControl: {},
   withoutLabel: {
     marginTop: theme.spacing(3),

[Survived] BooleanLiteral
src/components/collections/AddCollection.jsx:38:44
   const classes = useStyles();
   const linkField = { link: '' };
 
-  const [redirect, setRedirect] = useState(false);
+  const [redirect, setRedirect] = useState(true);
   const [result, setResult] = useState(null);
   const [formData, setFormData] = useState({

[Survived] StringLiteral
src/components/collections/AddCollection.jsx:42:12
   const [result, setResult] = useState(null);
   const [formData, setFormData] = useState({
     author: loggedInUser,
-    title: '',
+    title: "Stryker was here!",
     description: '',
     hidden: false,

[Survived] StringLiteral
src/components/collections/AddCollection.jsx:43:18
   const [formData, setFormData] = useState({
     author: loggedInUser,
     title: '',
-    description: '',
+    description: "Stryker was here!",
     hidden: false,
     contributors: '',

[Survived] BooleanLiteral
src/components/collections/AddCollection.jsx:44:13
     author: loggedInUser,
     title: '',
     description: '',
-    hidden: false,
+    hidden: true,
     contributors: '',
     text: '',

[Survived] StringLiteral
src/components/collections/AddCollection.jsx:45:19
     title: '',
     description: '',
     hidden: false,
-    contributors: '',
+    contributors: "Stryker was here!",
     text: '',
     category: '',

[Survived] StringLiteral
src/components/collections/AddCollection.jsx:47:15
     hidden: false,
     contributors: '',
     text: '',
-    category: '',
+    category: "Stryker was here!",
     tags: '',
     links: '',

[Survived] StringLiteral
src/components/collections/AddCollection.jsx:49:12
     text: '',
     category: '',
     tags: '',
-    links: '',
+    links: "Stryker was here!",
   });
 

[Survived] BooleanLiteral
src/components/collections/AddCollection.jsx:65:48
     id,
   } = formData;
 
-  const [checked, setChecked] = React.useState(false);
+  const [checked, setChecked] = React.useState(true);
 
   const handleChange = (event) => {

[Survived] BlockStatement
src/components/collections/AddCollection.jsx:67:35
 
   const [checked, setChecked] = React.useState(false);
 
-  const handleChange = (event) => {
-    setChecked(event.target.checked);
-    setFormData({
-      ...formData,
-      hidden: checked,
-    });
-  };
+  const handleChange = (event) => {};
 
   // this is for link input fields

[Survived] ObjectLiteral
src/components/collections/AddCollection.jsx:76:47
   };
 
   // this is for link input fields
-  const [linkInput, setLinkInput] = useState([{ ...linkField }]);
+  const [linkInput, setLinkInput] = useState([{}]);
 
   // Add new link field to form so you can add multiple links

[Survived] BlockStatement
src/components/collections/AddCollection.jsx:79:30
   const [linkInput, setLinkInput] = useState([{ ...linkField }]);
 
   // Add new link field to form so you can add multiple links
-  const addLinkField = () => {
-    setLinkInput([...linkInput, { ...linkField }]);
-  };
+  const addLinkField = () => {};
 
   const updateForm = (e) => {

[Survived] BlockStatement
src/components/collections/AddCollection.jsx:83:29
     setLinkInput([...linkInput, { ...linkField }]);
   };
 
-  const updateForm = (e) => {
-    if (e.target.name === 'hidden') {
-      setFormData({
-        ...formData,
-        hidden: !hidden,
-      });
-    } else {
-      setFormData({
-        ...formData,
-        [e.target.name]: e.target.value,
-      });
-    }
-  };
+  const updateForm = (e) => {};
 
   const addCollection = (e) => {

[Survived] BlockStatement
src/components/collections/AddCollection.jsx:84:37
   };
 
   const updateForm = (e) => {
-    if (e.target.name === 'hidden') {
-      setFormData({
-        ...formData,
-        hidden: !hidden,
-      });
-    } else {
+    if (e.target.name === 'hidden') {} else {
       setFormData({
         ...formData,

[Survived] ConditionalExpression
src/components/collections/AddCollection.jsx:84:9
   };
 
   const updateForm = (e) => {
-    if (e.target.name === 'hidden') {
+    if (false) {
       setFormData({
         ...formData,

[Survived] BooleanLiteral
src/components/collections/AddCollection.jsx:87:17
     if (e.target.name === 'hidden') {
       setFormData({
         ...formData,
-        hidden: !hidden,
+        hidden: hidden,
       });
     } else {

[Survived] BlockStatement
src/components/collections/AddCollection.jsx:89:12
         ...formData,
         hidden: !hidden,
       });
-    } else {
-      setFormData({
-        ...formData,
-        [e.target.name]: e.target.value,
-      });
-    }
+    } else {}
   };
 

[Survived] BlockStatement
src/components/collections/AddCollection.jsx:100:44
   const addCollection = (e) => {
     e.preventDefault();
     const temp = [];
-    Object.keys(formData).forEach((key) => {
-      if (key.indexOf('link') > -1 && key !== 'links') {
-        temp.push(formData[key]);
-        delete formData[key];
-      }
-      formData.links = String(temp);
-    });
+    Object.keys(formData).forEach((key) => {});
     fetch('/api/collections', {
       method: 'POST',

[Survived] ConditionalExpression
src/components/collections/AddCollection.jsx:101:11
     e.preventDefault();
     const temp = [];
     Object.keys(formData).forEach((key) => {
-      if (key.indexOf('link') > -1 && key !== 'links') {
+      if (true) {
         temp.push(formData[key]);
         delete formData[key];

[Survived] ConditionalExpression
src/components/collections/AddCollection.jsx:101:11
     e.preventDefault();
     const temp = [];
     Object.keys(formData).forEach((key) => {
-      if (key.indexOf('link') > -1 && key !== 'links') {
+      if (true && key !== 'links') {
         temp.push(formData[key]);
         delete formData[key];

[Survived] StringLiteral
src/components/collections/AddCollection.jsx:107:11
       }
       formData.links = String(temp);
     });
-    fetch('/api/collections', {
+    fetch("", {
       method: 'POST',
       headers: {

[Survived] ArrowFunction
src/components/collections/AddCollection.jsx:114:13
       },
       body: JSON.stringify(formData),
     })
-      .then((response) => response.json())
+      .then(() => undefined)
       .then((data) => {
         if (data) {

[Survived] BlockStatement
src/components/collections/AddCollection.jsx:115:23
       body: JSON.stringify(formData),
     })
       .then((response) => response.json())
-      .then((data) => {
-        if (data) {
-          if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
-            console.log('AddCollection successful!');
-            console.log('result? ', result);
-          }
-          setResult('success');
-          setTimeout(() => setRedirect(true), 2000);
-        }
-      })
+      .then((data) => {})
       .catch((err) => {
         if (process.env.NODE_ENV === 'development'

[Survived] ConditionalExpression
src/components/collections/AddCollection.jsx:116:13
     })
       .then((response) => response.json())
       .then((data) => {
-        if (data) {
+        if (false) {
           if (process.env.NODE_ENV === 'development'
           || process.env.NODE_ENV === 'test') {

[Survived] BlockStatement
src/components/collections/AddCollection.jsx:116:19
     })
       .then((response) => response.json())
       .then((data) => {
-        if (data) {
-          if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
-            console.log('AddCollection successful!');
-            console.log('result? ', result);
-          }
-          setResult('success');
-          setTimeout(() => setRedirect(true), 2000);
-        }
+        if (data) {}
       })
       .catch((err) => {

[Survived] ConditionalExpression
src/components/collections/AddCollection.jsx:117:15
       .then((response) => response.json())
       .then((data) => {
         if (data) {
-          if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
+          if (false) {
             console.log('AddCollection successful!');
             console.log('result? ', result);

[Survived] ConditionalExpression
src/components/collections/AddCollection.jsx:117:15
       .then((response) => response.json())
       .then((data) => {
         if (data) {
-          if (process.env.NODE_ENV === 'development'
+          if (false
           || process.env.NODE_ENV === 'test') {
             console.log('AddCollection successful!');

[Survived] BlockStatement
src/components/collections/AddCollection.jsx:118:47
       .then((data) => {
         if (data) {
           if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
-            console.log('AddCollection successful!');
-            console.log('result? ', result);
-          }
+          || process.env.NODE_ENV === 'test') {}
           setResult('success');
           setTimeout(() => setRedirect(true), 2000);

[Survived] StringLiteral
src/components/collections/AddCollection.jsx:122:21
             console.log('AddCollection successful!');
             console.log('result? ', result);
           }
-          setResult('success');
+          setResult("");
           setTimeout(() => setRedirect(true), 2000);
         }

[Survived] BooleanLiteral
src/components/collections/AddCollection.jsx:123:40
             console.log('result? ', result);
           }
           setResult('success');
-          setTimeout(() => setRedirect(true), 2000);
+          setTimeout(() => setRedirect(false), 2000);
         }
       })

[Survived] ArrowFunction
src/components/collections/AddCollection.jsx:123:22
             console.log('result? ', result);
           }
           setResult('success');
-          setTimeout(() => setRedirect(true), 2000);
+          setTimeout(() => undefined, 2000);
         }
       })

[Survived] BlockStatement
src/components/collections/AddCollection.jsx:126:23
           setTimeout(() => setRedirect(true), 2000);
         }
       })
-      .catch((err) => {
-        if (process.env.NODE_ENV === 'development'
-        || process.env.NODE_ENV === 'test') {
-          console.log(err);
-        }
-        setResult('error');
-      });
+      .catch((err) => {});
   };
 

[Survived] ConditionalExpression
src/components/collections/AddCollection.jsx:127:13
         }
       })
       .catch((err) => {
-        if (process.env.NODE_ENV === 'development'
-        || process.env.NODE_ENV === 'test') {
+        if (true) {
           console.log(err);
         }

[Survived] ConditionalExpression
src/components/collections/AddCollection.jsx:127:13
         }
       })
       .catch((err) => {
-        if (process.env.NODE_ENV === 'development'
+        if (true
         || process.env.NODE_ENV === 'test') {
           console.log(err);

[Survived] StringLiteral
src/components/collections/AddCollection.jsx:131:19
         || process.env.NODE_ENV === 'test') {
           console.log(err);
         }
-        setResult('error');
+        setResult("");
       });
   };

[Survived] ConditionalExpression
src/components/collections/AddCollection.jsx:138:8
   return (
     <div>
       {redirect ? <Redirect to="/" /> : null}
-      {result !== null && <ResultAlert result={result} setResult={setResult} />}
+      {false}
       <div className="addCollection">
         <h1>Add New Collection</h1>

[Survived] ConditionalExpression
src/components/collections/AddCollection.jsx:138:8
   return (
     <div>
       {redirect ? <Redirect to="/" /> : null}
-      {result !== null && <ResultAlert result={result} setResult={setResult} />}
+      {false && <ResultAlert result={result} setResult={setResult} />}
       <div className="addCollection">
         <h1>Add New Collection</h1>

[Survived] ArrowFunction
src/components/collections/AddCollection.jsx:144:109
         <form>
           <br />
           <FormControl className={clsx(classes.margin, classes.textField)} variant="outlined">
-            <TextField id="outlined-required-title" name="title" label="Title" variant="outlined" onChange={(e) => updateForm(e)} />
+            <TextField id="outlined-required-title" name="title" label="Title" variant="outlined" onChange={() => undefined} />
           </FormControl>
           <br />

[Survived] ArrowFunction
src/components/collections/AddCollection.jsx:148:127
           </FormControl>
           <br />
           <FormControl className={clsx(classes.margin, classes.textField)} variant="outlined">
-            <TextField id="outlined-required-description" name="description" label="Description" variant="outlined" onChange={(e) => updateForm(e)} />
+            <TextField id="outlined-required-description" name="description" label="Description" variant="outlined" onChange={() => undefined} />
           </FormControl>
           <br />

[Survived] ArrowFunction
src/components/collections/AddCollection.jsx:166:130
           </FormControl>
           <br />
           <FormControl className={clsx(classes.margin, classes.textField)} variant="outlined">
-            <TextField id="outlined-required-contributors" name="contributors" label="Contributors" variant="outlined" onChange={(e) => updateForm(e)} />
+            <TextField id="outlined-required-contributors" name="contributors" label="Contributors" variant="outlined" onChange={() => undefined} />
           </FormControl>
           <br />

[Survived] ArrowFunction
src/components/collections/AddCollection.jsx:170:106
           </FormControl>
           <br />
           <FormControl className={clsx(classes.margin, classes.textField)} variant="outlined">
-            <TextField id="outlined-required-text" name="text" label="Text" variant="outlined" onChange={(e) => updateForm(e)} />
+            <TextField id="outlined-required-text" name="text" label="Text" variant="outlined" onChange={() => undefined} />
           </FormControl>
           <br />

[Survived] ArrowFunction
src/components/collections/AddCollection.jsx:174:118
           </FormControl>
           <br />
           <FormControl className={clsx(classes.margin, classes.textField)} variant="outlined">
-            <TextField id="outlined-required-category" name="category" label="Category" variant="outlined" onChange={(e) => updateForm(e)} />
+            <TextField id="outlined-required-category" name="category" label="Category" variant="outlined" onChange={() => undefined} />
           </FormControl>
           <br />

[Survived] ArrowFunction
src/components/collections/AddCollection.jsx:178:106
           </FormControl>
           <br />
           <FormControl className={clsx(classes.margin, classes.textField)} variant="outlined">
-            <TextField id="outlined-required-tags" name="tags" label="Tags" variant="outlined" onChange={(e) => updateForm(e)} />
+            <TextField id="outlined-required-tags" name="tags" label="Tags" variant="outlined" onChange={() => undefined} />
           </FormControl>
           <br />

[Killed] BlockStatement
src/components/collections/AddCollection.jsx:181:40
             <TextField id="outlined-required-tags" name="tags" label="Tags" variant="outlined" onChange={(e) => updateForm(e)} />
           </FormControl>
           <br />
-          {linkInput.map((val, idx) => {
-            const link = `link-${idx}`;
-            return (
-              <div key={`link-${idx}`}>
-                <FormControl className={clsx(classes.margin, classes.textField)} variant="outlined">
-                  <TextField id={`outlined-required-link-${idx}`} name={link} label="Link" variant="outlined" onChange={(e) => updateForm(e)} />
-                </FormControl>
-                <IconButton color="primary" id="add-link" aria-label="add link" component="span" className={classes.margin} onClick={addLinkField}>
-                  <AddBoxIcon size="small" />
-                </IconButton>
-              </div>
-            );
-          })}
+          {linkInput.map((val, idx) => {})}
           <br />
           <Button onClick={addCollection} id="submit-button" variant="contained" color="primary">Submit</Button>

[Killed] StringLiteral
src/components/collections/AddCollection.jsx:182:26
           </FormControl>
           <br />
           {linkInput.map((val, idx) => {
-            const link = `link-${idx}`;
+            const link = "";
             return (
               <div key={`link-${idx}`}>

[Survived] ArrowFunction
src/components/collections/AddCollection.jsx:186:121
             return (
               <div key={`link-${idx}`}>
                 <FormControl className={clsx(classes.margin, classes.textField)} variant="outlined">
-                  <TextField id={`outlined-required-link-${idx}`} name={link} label="Link" variant="outlined" onChange={(e) => updateForm(e)} />
+                  <TextField id={`outlined-required-link-${idx}`} name={link} label="Link" variant="outlined" onChange={() => undefined} />
                 </FormControl>
                 <IconButton color="primary" id="add-link" aria-label="add link" component="span" className={classes.margin} onClick={addLinkField}>

[Survived] StringLiteral
src/components/collections/AddCollection.jsx:186:34
             return (
               <div key={`link-${idx}`}>
                 <FormControl className={clsx(classes.margin, classes.textField)} variant="outlined">
-                  <TextField id={`outlined-required-link-${idx}`} name={link} label="Link" variant="outlined" onChange={(e) => updateForm(e)} />
+                  <TextField id={""} name={link} label="Link" variant="outlined" onChange={(e) => updateForm(e)} />
                 </FormControl>
                 <IconButton color="primary" id="add-link" aria-label="add link" component="span" className={classes.margin} onClick={addLinkField}>
