[Survived] BlockStatement
src/components/collections/AllCollections.jsx:14:19
   // console.log('useState collections', collections);
   // console.log('useParams userId', userId);
 
-  useEffect(() => {
-    // console.log('Invoked useEffect userCollections', userCollections);
-
-    // Check if we are trying to get all collections for a specific user
-    if (userCollections) {
-      // console.log('fetching only collections for user', userId);
-      fetch(`/api/collections/user/${userId}`)
-        .then((res) => res.json())
-        .then((result) => {
-          // console.log(`AllCollections fetch /api/collections/${userId}`, result);
-          setCollections(result);
-        });
-
-      return;
-    }
-
-    // Otherwise just get all collections
-    // console.log('fetching all collections');
-    fetch('/api/collections')
-      .then((res) => res.json())
-      .then((result) => {
-        // console.log('AllCollections fetch /api/collections', result);
-        setCollections(result);
-      });
-  }, [userId]);
+  useEffect(() => {}, [userId]);
 
   return (

[Survived] ConditionalExpression
src/components/collections/AllCollections.jsx:18:9
     // console.log('Invoked useEffect userCollections', userCollections);
 
     // Check if we are trying to get all collections for a specific user
-    if (userCollections) {
+    if (true) {
       // console.log('fetching only collections for user', userId);
       fetch(`/api/collections/user/${userId}`)

[Survived] BlockStatement
src/components/collections/AllCollections.jsx:18:26
     // console.log('Invoked useEffect userCollections', userCollections);
 
     // Check if we are trying to get all collections for a specific user
-    if (userCollections) {
-      // console.log('fetching only collections for user', userId);
-      fetch(`/api/collections/user/${userId}`)
-        .then((res) => res.json())
-        .then((result) => {
-          // console.log(`AllCollections fetch /api/collections/${userId}`, result);
-          setCollections(result);
-        });
-
-      return;
-    }
+    if (userCollections) {}
 
     // Otherwise just get all collections

[Killed] ArrowFunction
src/components/collections/AllCollections.jsx:21:15
     if (userCollections) {
       // console.log('fetching only collections for user', userId);
       fetch(`/api/collections/user/${userId}`)
-        .then((res) => res.json())
+        .then(() => undefined)
         .then((result) => {
           // console.log(`AllCollections fetch /api/collections/${userId}`, result);

[Survived] BlockStatement
src/components/collections/AllCollections.jsx:22:27
       // console.log('fetching only collections for user', userId);
       fetch(`/api/collections/user/${userId}`)
         .then((res) => res.json())
-        .then((result) => {
-          // console.log(`AllCollections fetch /api/collections/${userId}`, result);
-          setCollections(result);
-        });
+        .then((result) => {});
 
       return;

[Survived] BlockStatement
src/components/collections/AllCollections.jsx:34:25
     // console.log('fetching all collections');
     fetch('/api/collections')
       .then((res) => res.json())
-      .then((result) => {
-        // console.log('AllCollections fetch /api/collections', result);
-        setCollections(result);
-      });
+      .then((result) => {});
   }, [userId]);
 

[Killed] StringLiteral
src/components/collections/AllCollections.jsx:42:58
 
   return (
     <div>
-      <h1>{userCollections ? `${userId}'s Collections` : 'All Collections'}</h1>
+      <h1>{userCollections ? `${userId}'s Collections` : ""}</h1>
       {collections[0] !== undefined ? (
         collections.map((collection) => (

[Survived] EqualityOperator
src/components/collections/AllCollections.jsx:43:8
   return (
     <div>
       <h1>{userCollections ? `${userId}'s Collections` : 'All Collections'}</h1>
-      {collections[0] !== undefined ? (
+      {collections[0] === undefined ? (
         collections.map((collection) => (
           <Collection

[Survived] ConditionalExpression
src/components/collections/AllCollections.jsx:43:8
   return (
     <div>
       <h1>{userCollections ? `${userId}'s Collections` : 'All Collections'}</h1>
-      {collections[0] !== undefined ? (
+      {true ? (
         collections.map((collection) => (
           <Collection

[Survived] ArrowFunction
src/components/collections/AllCollections.jsx:44:25
     <div>
       <h1>{userCollections ? `${userId}'s Collections` : 'All Collections'}</h1>
       {collections[0] !== undefined ? (
-        collections.map((collection) => (
-          <Collection
-            key={collection._id}
-            id={collection._id}
-            title={collection.title}
-            description={collection.description}
-            author={collection.author}
-            loggedInUser={loggedInUser}
-            likes={collection.likes}
-          />
-        ))
+        collections.map(() => undefined)
       ) : (
         <li> Loading...</li>
