[Survived] BlockStatement
src/components/collections/EditButton.jsx:5:26
 
 import './EditButton.css';
 
-const EditButton = () => {
-  return (
-    <>
-      <span
-        onClick={() => console.log('edit!')}
-        onKeyPress={() => console.log('edit!')}
-        type="button"
-        className="button-edit"
-        role="button"
-        tabIndex={0}
-      >
-        <i className="far fa-edit" />
-        Edit
-      </span>
-    </>
-  );
-};
+const EditButton = () => {};
 
 export default EditButton;

[Survived] ArrowFunction
src/components/collections/EditButton.jsx:9:18
   return (
     <>
       <span
-        onClick={() => console.log('edit!')}
+        onClick={() => undefined}
         onKeyPress={() => console.log('edit!')}
         type="button"

[Survived] ArrowFunction
src/components/collections/EditButton.jsx:10:21
     <>
       <span
         onClick={() => console.log('edit!')}
-        onKeyPress={() => console.log('edit!')}
+        onKeyPress={() => undefined}
         type="button"
         className="button-edit"
