[Killed] ArrayDeclaration
src/components/collections/ExpandedCollection.jsx:14:57
 
 const ExpandedCollection = ({ loggedInUser }) => {
   // console.log('Invoked ExpandedCollection', loggedInUser);
-  const [collection, setCollection] = useState({ likes: [] });
+  const [collection, setCollection] = useState({ likes: ["Stryker was here"] });
   const { id } = useParams();
 

[Killed] ObjectLiteral
src/components/collections/ExpandedCollection.jsx:14:48
 
 const ExpandedCollection = ({ loggedInUser }) => {
   // console.log('Invoked ExpandedCollection', loggedInUser);
-  const [collection, setCollection] = useState({ likes: [] });
+  const [collection, setCollection] = useState({});
   const { id } = useParams();
 

[Killed] BlockStatement
src/components/collections/ExpandedCollection.jsx:20:19
   // console.log('useState collection', collection);
   // console.log('useParams id', id);
 
-  useEffect(() => {
-    // console.log('Fetching /api/collections for', id);
-    fetch(`/api/collections/${id}`)
-      .then((res) => res.json())
-      .then((result) => {
-        if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
-          console.log(result);
-        }
-        setCollection(result);
-      });
-  }, []);
+  useEffect(() => {}, []);
 
   // console.log('useEffect collection', collection);

[Survived] StringLiteral
src/components/collections/ExpandedCollection.jsx:22:11
 
   useEffect(() => {
     // console.log('Fetching /api/collections for', id);
-    fetch(`/api/collections/${id}`)
+    fetch("")
       .then((res) => res.json())
       .then((result) => {

[Killed] ArrowFunction
src/components/collections/ExpandedCollection.jsx:23:13
   useEffect(() => {
     // console.log('Fetching /api/collections for', id);
     fetch(`/api/collections/${id}`)
-      .then((res) => res.json())
+      .then(() => undefined)
       .then((result) => {
         if (process.env.NODE_ENV === 'development'

[Killed] BlockStatement
src/components/collections/ExpandedCollection.jsx:24:25
     // console.log('Fetching /api/collections for', id);
     fetch(`/api/collections/${id}`)
       .then((res) => res.json())
-      .then((result) => {
-        if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
-          console.log(result);
-        }
-        setCollection(result);
-      });
+      .then((result) => {});
   }, []);
 

[Survived] EqualityOperator
src/components/collections/ExpandedCollection.jsx:25:13
     fetch(`/api/collections/${id}`)
       .then((res) => res.json())
       .then((result) => {
-        if (process.env.NODE_ENV === 'development'
+        if (process.env.NODE_ENV !== 'development'
           || process.env.NODE_ENV === 'test') {
           console.log(result);

[Survived] ConditionalExpression
src/components/collections/ExpandedCollection.jsx:25:13
     fetch(`/api/collections/${id}`)
       .then((res) => res.json())
       .then((result) => {
-        if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
+        if (false) {
           console.log(result);
         }

[Killed] ConditionalExpression
src/components/collections/ExpandedCollection.jsx:44:8
         <div className="creator__author">{collection.author}</div>
       </div>
 
-      {collection.links && (
-        <div className="links">
-          {collection.links.map((link) => (
-            <div className="links__item" key={link}>
-              {/* <a href={link} target="_blank" rel="noreferrer">
-                {link}
-              </a> */}
-              <Link href={link}>{link}</Link>
-            </div>
-          ))}
-        </div>
-      )}
+      {false}
 
       {loggedInUser ? (

[Killed] ConditionalExpression
src/components/collections/ExpandedCollection.jsx:44:8
         <div className="creator__author">{collection.author}</div>
       </div>
 
-      {collection.links && (
-        <div className="links">
-          {collection.links.map((link) => (
-            <div className="links__item" key={link}>
-              {/* <a href={link} target="_blank" rel="noreferrer">
-                {link}
-              </a> */}
-              <Link href={link}>{link}</Link>
-            </div>
-          ))}
-        </div>
-      )}
+      {true}
 
       {loggedInUser ? (

[Killed] ArrowFunction
src/components/collections/ExpandedCollection.jsx:46:33
 
       {collection.links && (
         <div className="links">
-          {collection.links.map((link) => (
-            <div className="links__item" key={link}>
-              {/* <a href={link} target="_blank" rel="noreferrer">
-                {link}
-              </a> */}
-              <Link href={link}>{link}</Link>
-            </div>
-          ))}
+          {collection.links.map(() => undefined)}
         </div>
       )}

[Killed] EqualityOperator
src/components/collections/ExpandedCollection.jsx:66:12
             id={id}
           />
           <SaveButton loggedInUser={loggedInUser} id={id} />
-          {loggedInUser === collection.author && (
+          {loggedInUser !== collection.author && (
             <EditButton
               loggedInUser={loggedInUser}

[Killed] ConditionalExpression
src/components/collections/ExpandedCollection.jsx:66:12
             id={id}
           />
           <SaveButton loggedInUser={loggedInUser} id={id} />
-          {loggedInUser === collection.author && (
+          {true && (
             <EditButton
               loggedInUser={loggedInUser}
