[Killed] StringLiteral
src/components/collections/Collection.jsx:23:42
     </div>
     <div>
       {/* className="collection__button" */}
-      <Button component={RouterLink} to={`/collections/${id}`} variant="contained" color="primary">
+      <Button component={RouterLink} to={""} variant="contained" color="primary">
         View Collection
       </Button>
