[Killed] BlockStatement
src/components/collections/LikeButton.jsx:17:23
       body: JSON.stringify(payload),
     })
       .then((response) => response.json())
-      .then((data) => {
-        if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
-          console.log('Success:', data);
-        }
-        return data;
-      })
+      .then((data) => {})
       .catch((error) => {
         if (process.env.NODE_ENV === 'development'

[Killed] LogicalOperator
src/components/collections/LikeButton.jsx:18:13
     })
       .then((response) => response.json())
       .then((data) => {
-        if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
+        if (process.env.NODE_ENV === 'development' && process.env.NODE_ENV === 'test') {
           console.log('Success:', data);
         }

[Killed] StringLiteral
src/components/collections/LikeButton.jsx:20:23
       .then((data) => {
         if (process.env.NODE_ENV === 'development'
           || process.env.NODE_ENV === 'test') {
-          console.log('Success:', data);
+          console.log("", data);
         }
         return data;

[Killed] BlockStatement
src/components/collections/LikeButton.jsx:24:25
         }
         return data;
       })
-      .catch((error) => {
-        if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
-          console.error('Error:', error);
-        }
-        // throw error
-      });
+      .catch((error) => {});
   }
 

[Killed] LogicalOperator
src/components/collections/LikeButton.jsx:25:13
         return data;
       })
       .catch((error) => {
-        if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
+        if (process.env.NODE_ENV === 'development' && process.env.NODE_ENV === 'test') {
           console.error('Error:', error);
         }

[Killed] ConditionalExpression
src/components/collections/LikeButton.jsx:25:13
         return data;
       })
       .catch((error) => {
-        if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
+        if (false) {
           console.error('Error:', error);
         }

[Killed] BlockStatement
src/components/collections/LikeButton.jsx:26:47
       })
       .catch((error) => {
         if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
-          console.error('Error:', error);
-        }
+          || process.env.NODE_ENV === 'test') {}
         // throw error
       });

[Killed] ArrowFunction
src/components/collections/LikeButton.jsx:36:18
   return (
     <>
       <span
-        onClick={() => likeButtonClick(id, loggedInUser, likes)}
+        onClick={() => undefined}
         onKeyPress={() => likeButtonClick(id, loggedInUser, likes)}
         type="button"

[Killed] ArrowFunction
src/components/collections/LikeButton.jsx:37:21
     <>
       <span
         onClick={() => likeButtonClick(id, loggedInUser, likes)}
-        onKeyPress={() => likeButtonClick(id, loggedInUser, likes)}
+        onKeyPress={() => undefined}
         type="button"
         className="button-like"
