[Killed] BlockStatement
src/components/collections/SaveButton.jsx:4:45
 import React from 'react';
 
 const SaveButton = ({ id, loggedInUser }) => {
-  function likeButtonClick(eventId, userId) {
-    const payload = { id: userId, collectionId: id };
-
-    fetch(`/api/collections/save/${id}`, {
-      method: 'PUT',
-      headers: {
-        'Content-Type': 'application/json',
-      },
-      body: JSON.stringify(payload),
-    })
-      .then((response) => response.json())
-      .then((data) => {
-        if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
-          console.log('Success:', data);
-        }
-        return data;
-      })
-      .catch((error) => {
-        if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
-          console.error('Error:', error);
-        }
-      });
-  }
+  function likeButtonClick(eventId, userId) {}
 
   return (

[Killed] ObjectLiteral
src/components/collections/SaveButton.jsx:5:21
 
 const SaveButton = ({ id, loggedInUser }) => {
   function likeButtonClick(eventId, userId) {
-    const payload = { id: userId, collectionId: id };
+    const payload = {};
 
     fetch(`/api/collections/save/${id}`, {

[Killed] StringLiteral
src/components/collections/SaveButton.jsx:7:11
   function likeButtonClick(eventId, userId) {
     const payload = { id: userId, collectionId: id };
 
-    fetch(`/api/collections/save/${id}`, {
+    fetch("", {
       method: 'PUT',
       headers: {

[Killed] StringLiteral
src/components/collections/SaveButton.jsx:8:15
     const payload = { id: userId, collectionId: id };
 
     fetch(`/api/collections/save/${id}`, {
-      method: 'PUT',
+      method: "",
       headers: {
         'Content-Type': 'application/json',

[Killed] StringLiteral
src/components/collections/SaveButton.jsx:10:25
     fetch(`/api/collections/save/${id}`, {
       method: 'PUT',
       headers: {
-        'Content-Type': 'application/json',
+        'Content-Type': "",
       },
       body: JSON.stringify(payload),

[Killed] BlockStatement
src/components/collections/SaveButton.jsx:17:47
       .then((response) => response.json())
       .then((data) => {
         if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
-          console.log('Success:', data);
-        }
+          || process.env.NODE_ENV === 'test') {}
         return data;
       })

[Killed] BlockStatement
src/components/collections/SaveButton.jsx:22:25
         }
         return data;
       })
-      .catch((error) => {
-        if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
-          console.error('Error:', error);
-        }
-      });
+      .catch((error) => {});
   }
 

[Killed] StringLiteral
src/components/collections/SaveButton.jsx:25:25
       .catch((error) => {
         if (process.env.NODE_ENV === 'development'
           || process.env.NODE_ENV === 'test') {
-          console.error('Error:', error);
+          console.error("", error);
         }
       });

[Killed] ArrowFunction
src/components/collections/SaveButton.jsx:32:16
 
   return (
     <span
-      onClick={() => likeButtonClick(id, loggedInUser)}
+      onClick={() => undefined}
       onKeyPress={() => likeButtonClick(id, loggedInUser)}
       role="button"

[Killed] ArrowFunction
src/components/collections/SaveButton.jsx:33:19
   return (
     <span
       onClick={() => likeButtonClick(id, loggedInUser)}
-      onKeyPress={() => likeButtonClick(id, loggedInUser)}
+      onKeyPress={() => undefined}
       role="button"
       tabIndex={0}
