[Survived] StringLiteral
src/components/collections/SavedCollections.jsx:16:15
     // Get all collections for user
     // console.log('fetching savedcollections', loggedInUser);
     fetch(`/api/collections/savedcollections/${loggedInUser}`, {
-      method: 'GET',
+      method: "",
       headers: {
         'Content-Type': 'application/json',

[Killed] BlockStatement
src/components/collections/SavedCollections.jsx:22:23
       },
     })
       .then((response) => response.json())
-      .then((data) => {
-        // console.log('fetch savedcollectiond data', data);
-        if (data.length > 0) {
-          data.map((id) => fetch(`/api/collections/${id}`)
-            .then((res) => res.json())
-            .then((result) => {
-              // console.log('pushing currentCollection', result);
-              currentCollections.push(result);
-            }).then(() => {
-              setCollections([...currentCollections]);
-            }));
-        }
-      })
+      .then((data) => {})
       .catch((error) => {
         if (process.env.NODE_ENV === 'development'

[Killed] ConditionalExpression
src/components/collections/SavedCollections.jsx:24:13
       .then((response) => response.json())
       .then((data) => {
         // console.log('fetch savedcollectiond data', data);
-        if (data.length > 0) {
+        if (false) {
           data.map((id) => fetch(`/api/collections/${id}`)
             .then((res) => res.json())

[Killed] EqualityOperator
src/components/collections/SavedCollections.jsx:24:13
       .then((response) => response.json())
       .then((data) => {
         // console.log('fetch savedcollectiond data', data);
-        if (data.length > 0) {
+        if (data.length <= 0) {
           data.map((id) => fetch(`/api/collections/${id}`)
             .then((res) => res.json())

[Killed] ArrowFunction
src/components/collections/SavedCollections.jsx:25:20
       .then((data) => {
         // console.log('fetch savedcollectiond data', data);
         if (data.length > 0) {
-          data.map((id) => fetch(`/api/collections/${id}`)
-            .then((res) => res.json())
-            .then((result) => {
-              // console.log('pushing currentCollection', result);
-              currentCollections.push(result);
-            }).then(() => {
-              setCollections([...currentCollections]);
-            }));
+          data.map(() => undefined);
         }
       })

[Survived] StringLiteral
src/components/collections/SavedCollections.jsx:25:34
       .then((data) => {
         // console.log('fetch savedcollectiond data', data);
         if (data.length > 0) {
-          data.map((id) => fetch(`/api/collections/${id}`)
+          data.map((id) => fetch("")
             .then((res) => res.json())
             .then((result) => {

[Killed] ArrowFunction
src/components/collections/SavedCollections.jsx:26:19
         // console.log('fetch savedcollectiond data', data);
         if (data.length > 0) {
           data.map((id) => fetch(`/api/collections/${id}`)
-            .then((res) => res.json())
+            .then(() => undefined)
             .then((result) => {
               // console.log('pushing currentCollection', result);

[Killed] BlockStatement
src/components/collections/SavedCollections.jsx:27:31
         if (data.length > 0) {
           data.map((id) => fetch(`/api/collections/${id}`)
             .then((res) => res.json())
-            .then((result) => {
-              // console.log('pushing currentCollection', result);
-              currentCollections.push(result);
-            }).then(() => {
+            .then((result) => {}).then(() => {
               setCollections([...currentCollections]);
             }));

[Killed] BlockStatement
src/components/collections/SavedCollections.jsx:30:27
             .then((result) => {
               // console.log('pushing currentCollection', result);
               currentCollections.push(result);
-            }).then(() => {
-              setCollections([...currentCollections]);
-            }));
+            }).then(() => {}));
         }
       })

[Survived] ConditionalExpression
src/components/collections/SavedCollections.jsx:36:13
         }
       })
       .catch((error) => {
-        if (process.env.NODE_ENV === 'development'
+        if (true
           || process.env.NODE_ENV === 'test') {
           console.error('Error:', error);

[Survived] ConditionalExpression
src/components/collections/SavedCollections.jsx:36:13
         }
       })
       .catch((error) => {
-        if (process.env.NODE_ENV === 'development'
-          || process.env.NODE_ENV === 'test') {
+        if (true) {
           console.error('Error:', error);
         }

[Killed] EqualityOperator
src/components/collections/SavedCollections.jsx:50:8
   return (
     <div>
       <h1>Saved Collections</h1>
-      {collections[0] !== undefined
+      {collections[0] === undefined
         ? (
           collections.map((collection) => (

[Killed] ConditionalExpression
src/components/collections/SavedCollections.jsx:50:8
   return (
     <div>
       <h1>Saved Collections</h1>
-      {collections[0] !== undefined
+      {false
         ? (
           collections.map((collection) => (

[Killed] ArrowFunction
src/components/collections/SavedCollections.jsx:52:27
       <h1>Saved Collections</h1>
       {collections[0] !== undefined
         ? (
-          collections.map((collection) => (
-            <Collection
-              key={collection._id}
-              id={collection._id}
-              title={collection.title}
-              description={collection.description}
-              author={collection.author}
-              loggedInUser={loggedInUser}
-              likes={collection.likes}
-            />
-          ))) : <li> Loading...</li>}
+          collections.map(() => undefined)) : <li> Loading...</li>}
     </div>
   );
