[Survived] StringLiteral
learnvault/client/src/index.jsx:5:40
 import { render } from 'react-dom';
 import App from './App';
 
-render(<App />, document.querySelector('#app'));
+render(<App />, document.querySelector(""));
 
