[Survived] StringLiteral
learnvault/client/src/App.jsx:19:52
 import './App.css';
 
 const App = () => {
-  const [loggedInUser, setLoggedInUser] = useState('');
+  const [loggedInUser, setLoggedInUser] = useState("Stryker was here!");
   const [timerId, setTimerId] = useState('');
 

[Survived] StringLiteral
learnvault/client/src/App.jsx:20:42
 
 const App = () => {
   const [loggedInUser, setLoggedInUser] = useState('');
-  const [timerId, setTimerId] = useState('');
+  const [timerId, setTimerId] = useState("Stryker was here!");
 
   useEffect(() => {

[Survived] BlockStatement
learnvault/client/src/App.jsx:22:19
   const [loggedInUser, setLoggedInUser] = useState('');
   const [timerId, setTimerId] = useState('');
 
-  useEffect(() => {
-    fetch('/api/checkToken')
-      .then((res) => {
-        if (res.status === 200) {
-          return res.json();
-        }
-        const error = new Error(res.statusText);
-        console.error('Error: fetch /api/checkToken did not return status 200', error);
-        // throw error;
-      })
-      .then((data) => {
-        console.log('Success: fetch /api/checkToken', data);
-        setLoggedInUser(data);
-      })
-      .catch((err) => {
-        console.error('Error: fetch /api/checkToken caught error', err);
-        setLoggedInUser('');
-      });
-  }, []);
+  useEffect(() => {}, []);
 
   return (

[Survived] BlockStatement
learnvault/client/src/App.jsx:24:22
 
   useEffect(() => {
     fetch('/api/checkToken')
-      .then((res) => {
-        if (res.status === 200) {
-          return res.json();
-        }
-        const error = new Error(res.statusText);
-        console.error('Error: fetch /api/checkToken did not return status 200', error);
-        // throw error;
-      })
+      .then((res) => {})
       .then((data) => {
         console.log('Success: fetch /api/checkToken', data);

[Survived] ConditionalExpression
learnvault/client/src/App.jsx:25:13
   useEffect(() => {
     fetch('/api/checkToken')
       .then((res) => {
-        if (res.status === 200) {
+        if (true) {
           return res.json();
         }

[Survived] BlockStatement
learnvault/client/src/App.jsx:32:23
         console.error('Error: fetch /api/checkToken did not return status 200', error);
         // throw error;
       })
-      .then((data) => {
-        console.log('Success: fetch /api/checkToken', data);
-        setLoggedInUser(data);
-      })
+      .then((data) => {})
       .catch((err) => {
         console.error('Error: fetch /api/checkToken caught error', err);

[Survived] BlockStatement
learnvault/client/src/App.jsx:36:23
         console.log('Success: fetch /api/checkToken', data);
         setLoggedInUser(data);
       })
-      .catch((err) => {
-        console.error('Error: fetch /api/checkToken caught error', err);
-        setLoggedInUser('');
-      });
+      .catch((err) => {});
   }, []);
 

[Survived] StringLiteral
learnvault/client/src/App.jsx:37:23
         setLoggedInUser(data);
       })
       .catch((err) => {
-        console.error('Error: fetch /api/checkToken caught error', err);
+        console.error("", err);
         setLoggedInUser('');
       });
