[Survived] ArrowFunction
client/src/components/ErrorAlert.jsx:3:20
 import React from 'react';
 
-const ErrorAlert = (props) => (
-  <div>
-    <button
-      type="button"
-      onClick={() => {
-        props.setResult('null');
-      }}
-    >
-      X
-    </button>
-    <h1>Error in AddCollection</h1>
-    <p>Please check form and try again</p>
-  </div>
-);
+const ErrorAlert = () => undefined;
 export default ErrorAlert;
 

[Survived] BlockStatement
client/src/components/ErrorAlert.jsx:7:22
   <div>
     <button
       type="button"
-      onClick={() => {
-        props.setResult('null');
-      }}
+      onClick={() => {}}
     >
       X
