[Killed] BlockStatement
client/src/components/Nav.jsx:11:24
 }) => {
   const history = useHistory();
 
-  const logout = () => {
-    // console.log('logging out');
-    fetch('/api/logout')
-      .then((response) => response.json())
-      .then((data) => {
-        console.log('Success /api/logout: ', data);
-      })
-      .catch((err) => {
-        console.log('Error /api/logout: ', err);
-      });
-    clearTimeout(timerId);
-    setTimerId('');
-    setLoggedInUser('');
-    history.push('/');
-  };
+  const logout = () => {};
 
   return (

[Survived] BlockStatement
client/src/components/Nav.jsx:15:23
     // console.log('logging out');
     fetch('/api/logout')
       .then((response) => response.json())
-      .then((data) => {
-        console.log('Success /api/logout: ', data);
-      })
+      .then((data) => {})
       .catch((err) => {
         console.log('Error /api/logout: ', err);

[Survived] BlockStatement
client/src/components/Nav.jsx:18:23
       .then((data) => {
         console.log('Success /api/logout: ', data);
       })
-      .catch((err) => {
-        console.log('Error /api/logout: ', err);
-      });
+      .catch((err) => {});
     clearTimeout(timerId);
     setTimerId('');

[Killed] ConditionalExpression
client/src/components/Nav.jsx:37:12
             </Link>
           </li>
 
-          {!loggedInUser && (
-            <>
-              <li className="nav__item">
-                <Link to="/login" className="nav__link" id="nav-login">
-                  Login
-                </Link>
-              </li>
-              <li className="nav__item">
-                <Link to="/register" className="nav__link" id="nav-register">
-                  Register
-                </Link>
-              </li>
-            </>
-          )}
+          {false}
           {loggedInUser && (
             <>

[Killed] LogicalOperator
client/src/components/Nav.jsx:37:12
             </Link>
           </li>
 
-          {!loggedInUser && (
-            <>
-              <li className="nav__item">
-                <Link to="/login" className="nav__link" id="nav-login">
-                  Login
-                </Link>
-              </li>
-              <li className="nav__item">
-                <Link to="/register" className="nav__link" id="nav-register">
-                  Register
-                </Link>
-              </li>
-            </>
-          )}
+          {!loggedInUser || <>
+              <li className="nav__item">
+                <Link to="/login" className="nav__link" id="nav-login">
+                  Login
+                </Link>
+              </li>
+              <li className="nav__item">
+                <Link to="/register" className="nav__link" id="nav-register">
+                  Register
+                </Link>
+              </li>
+            </>}
           {loggedInUser && (
             <>

[Killed] ConditionalExpression
client/src/components/Nav.jsx:51:12
               </li>
             </>
           )}
-          {loggedInUser && (
-            <>
-              <li className="nav__item">
-                <Link to="/addcollection" className="nav__link" id="nav-addcollection">
-                  Add Collection
-                </Link>
-              </li>
-              <li className="nav__item">
-                <Link to="/savedcollections" className="nav__link" id="nav-savedcollections">
-                  Saved Collections
-                </Link>
-              </li>
-              {/* Profile nav bar item not completed but functionality can be added */}
-              {/* <li className="nav__item">
-                <Link to="/profile" className="nav__link" id="nav-profile">
-                  Profile
-                </Link>
-              </li> */}
-              <li className="nav__item">
-                <button type="button" className="nav__link" onClick={logout} id="nav-logout">
-                  Logout
-                </button>
-              </li>
-            </>
-          )}
+          {true}
         </ul>
       </nav>

[Killed] ConditionalExpression
client/src/components/Nav.jsx:51:12
               </li>
             </>
           )}
-          {loggedInUser && (
-            <>
-              <li className="nav__item">
-                <Link to="/addcollection" className="nav__link" id="nav-addcollection">
-                  Add Collection
-                </Link>
-              </li>
-              <li className="nav__item">
-                <Link to="/savedcollections" className="nav__link" id="nav-savedcollections">
-                  Saved Collections
-                </Link>
-              </li>
-              {/* Profile nav bar item not completed but functionality can be added */}
-              {/* <li className="nav__item">
-                <Link to="/profile" className="nav__link" id="nav-profile">
-                  Profile
-                </Link>
-              </li> */}
-              <li className="nav__item">
-                <button type="button" className="nav__link" onClick={logout} id="nav-logout">
-                  Logout
-                </button>
-              </li>
-            </>
-          )}
+          {false}
         </ul>
       </nav>
