[Survived] ArrowFunction
client/src/components/Profile.jsx:3:17
 import React from 'react';
 
-const Profile = () => (
-  <div className="profile">
-    This is the profile...
-  </div>
-);
+const Profile = () => undefined;
 
 export default Profile;
