[Survived] StringLiteral
client/src/components/Register.jsx:15:44
   // -----------
 
   const [email, setEmail] = useState('');
-  const [username, setUsername] = useState('');
+  const [username, setUsername] = useState("Stryker was here!");
   const [password, setPassword] = useState('');
   const [passwordConfirm, setPasswordConfirm] = useState('');

[Survived] BlockStatement
client/src/components/Register.jsx:52:51
     // Regex for email validation from: https://stackoverflow.com/a/46181/2040509
     const regex = /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/;
 
-    if (!regex.test(String(email).toLowerCase())) {
-      setErrorEmail('Please enter a valid email');
-      containsErrors = true;
-      setError(true);
-      return;
-    }
+    if (!regex.test(String(email).toLowerCase())) {}
 
     setErrorEmail('');

[Survived] StringLiteral
client/src/components/Register.jsx:59:19
       return;
     }
 
-    setErrorEmail('');
+    setErrorEmail("Stryker was here!");
   };
 

[Survived] ConditionalExpression
client/src/components/Register.jsx:70:9
     // Regex for username validation from: https://www.regextester.com/104030
     const regex = /^[a-z0-9_-]{3,16}$/;
 
-    if (!regex.test(username)) {
+    if (true) {
       setErrorUsername('Please enter a valid username');
       containsErrors = true;

[Survived] StringLiteral
client/src/components/Register.jsx:77:22
       return;
     }
 
-    setErrorUsername('');
+    setErrorUsername("Stryker was here!");
   };
 

[Survived] ConditionalExpression
client/src/components/Register.jsx:85:9
   // ------------------------
 
   const validatePasswordFormat = () => {
-    if (String(password).length < 3) {
+    if (true) {
       setErrorPassword('Please enter a valid password');
       containsErrors = true;

[Survived] StringLiteral
client/src/components/Register.jsx:86:24
 
   const validatePasswordFormat = () => {
     if (String(password).length < 3) {
-      setErrorPassword('Please enter a valid password');
+      setErrorPassword("");
       containsErrors = true;
       setError(true);

[Survived] BlockStatement
client/src/components/Register.jsx:99:39
   // Validate password match
   // -----------------------
 
-  const validatePasswordMatch = () => {
-    if (password !== passwordConfirm) {
-      setErrorPasswordConfirm("Password fields don't match");
-      containsErrors = true;
-      setError(true);
-      return;
-    }
-
-    setErrorPasswordConfirm('');
-  };
+  const validatePasswordMatch = () => {};
 
   // --------------

[Survived] EqualityOperator
client/src/components/Register.jsx:100:9
   // -----------------------
 
   const validatePasswordMatch = () => {
-    if (password !== passwordConfirm) {
+    if (password === passwordConfirm) {
       setErrorPasswordConfirm("Password fields don't match");
       containsErrors = true;

[Survived] BlockStatement
client/src/components/Register.jsx:100:39
   // -----------------------
 
   const validatePasswordMatch = () => {
-    if (password !== passwordConfirm) {
-      setErrorPasswordConfirm("Password fields don't match");
-      containsErrors = true;
-      setError(true);
-      return;
-    }
+    if (password !== passwordConfirm) {}
 
     setErrorPasswordConfirm('');

[Survived] ObjectLiteral
client/src/components/Register.jsx:116:22
   // TODO: clear any tokens that might be lingering in the users cookies
 
   const sendUserData = async () => {
-    const userInfo = { email, username, password };
+    const userInfo = {};
 
     const response = await fetch('/api/register', {

[Survived] StringLiteral
client/src/components/Register.jsx:118:34
   const sendUserData = async () => {
     const userInfo = { email, username, password };
 
-    const response = await fetch('/api/register', {
+    const response = await fetch("", {
       method: 'POST',
       headers: {

[Survived] ConditionalExpression
client/src/components/Register.jsx:130:9
     console.log(data);
 
     // Email already exists
-    if (data.emailAlreadyExists) {
+    if (true) {
       setErrorEmail('An account with that email already exists');
       containsErrors = true;

[Survived] ConditionalExpression
client/src/components/Register.jsx:145:9
 
     // TODO: handle any server errors that might have occured
 
-    if (data.registrationSuccessful) {
+    if (true) {
       // TODO: show successful registration message
       setLoggedInUser(data.userId);

[Survived] LogicalOperator
client/src/components/Register.jsx:189:12
           {errorUsername && (
             <li className="form-error__item">{errorUsername}</li>
           )}
-          {errorPassword && (
-            <li className="form-error__item">{errorPassword}</li>
-          )}
+          {errorPassword || <li className="form-error__item">{errorPassword}</li>}
           {errorPasswordConfirm && (
             <li className="form-error__item">{errorPasswordConfirm}</li>

[Survived] ArrowFunction
client/src/components/Register.jsx:205:23
             type="text"
             className="input-label__input"
             id="register-email"
-            onChange={(e) => setEmail(e.target.value)}
+            onChange={() => undefined}
             value={email}
           />

[Survived] ArrowFunction
client/src/components/Register.jsx:219:23
             type="text"
             className="input-label__input"
             id="register-username"
-            onChange={(e) => setUsername(e.target.value)}
+            onChange={() => undefined}
             value={username}
           />

[Survived] ArrowFunction
client/src/components/Register.jsx:233:23
             type="password"
             className="input-label__input"
             id="register-password"
-            onChange={(e) => setPassword(e.target.value)}
+            onChange={() => undefined}
             value={password}
           />

[Survived] ArrowFunction
client/src/components/Register.jsx:244:23
             type="password"
             className="input-label__input"
             id="register-confirm-password"
-            onChange={(e) => setPasswordConfirm(e.target.value)}
+            onChange={() => undefined}
             value={passwordConfirm}
           />
