[Survived] ObjectLiteral
src/components/collections/AddCollection.jsx:8:21
 import ResultAlert from '../ResultAlert';
 
 const AddCollection = () => {
-  const linkField = { link: '' };
+  const linkField = {};
 
   const [redirect, setRedirect] = useState(false);

[Survived] StringLiteral
src/components/collections/AddCollection.jsx:14:12
   const [result, setResult] = useState(null);
   const [formData, setFormData] = useState({
     author: '',
-    title: '',
+    title: "Stryker was here!",
     description: '',
     hidden: false,

[Survived] StringLiteral
src/components/collections/AddCollection.jsx:18:11
     description: '',
     hidden: false,
     contributors: '',
-    text: '',
+    text: "Stryker was here!",
     category: '',
     tags: '',

[Survived] ArrayDeclaration
src/components/collections/AddCollection.jsx:29:18
 
   // Add new link field to form so you can add multiple links
   const addLinkField = () => {
-    setLinkInput([...linkInput, { ...linkField }]);
+    setLinkInput([]);
   };
 

[Survived] EqualityOperator
src/components/collections/AddCollection.jsx:33:9
   };
 
   const updateForm = (e) => {
-    if (e.target.name === 'hidden') {
+    if (e.target.name !== 'hidden') {
       setFormData({
         ...formData,

[Survived] ObjectLiteral
src/components/collections/AddCollection.jsx:39:19
         hidden: !hidden,
       });
     } else {
-      setFormData({
-        ...formData,
-        [e.target.name]: e.target.value,
-      });
+      setFormData({});
     }
   };

[Survived] BlockStatement
src/components/collections/AddCollection.jsx:76:23
       body: JSON.stringify(formData),
     })
       .then((response) => response.json())
-      .then((data) => {
-        if (data) {
-          console.log('AddCollection successful!');
-          setResult('success');
-          console.log('result? ', result);
-          setTimeout(() => setRedirect(true), 2000);
-        }
-      })
+      .then((data) => {})
       .catch((err) => {
         console.log(err);

[Survived] BlockStatement
src/components/collections/AddCollection.jsx:77:19
     })
       .then((response) => response.json())
       .then((data) => {
-        if (data) {
-          console.log('AddCollection successful!');
-          setResult('success');
-          console.log('result? ', result);
-          setTimeout(() => setRedirect(true), 2000);
-        }
+        if (data) {}
       })
       .catch((err) => {

[Survived] BooleanLiteral
src/components/collections/AddCollection.jsx:81:40
           console.log('AddCollection successful!');
           setResult('success');
           console.log('result? ', result);
-          setTimeout(() => setRedirect(true), 2000);
+          setTimeout(() => setRedirect(false), 2000);
         }
       })

[Survived] ArrowFunction
src/components/collections/AddCollection.jsx:81:22
           console.log('AddCollection successful!');
           setResult('success');
           console.log('result? ', result);
-          setTimeout(() => setRedirect(true), 2000);
+          setTimeout(() => undefined, 2000);
         }
       })

[Survived] BlockStatement
src/components/collections/AddCollection.jsx:84:23
           setTimeout(() => setRedirect(true), 2000);
         }
       })
-      .catch((err) => {
-        console.log(err);
-        setResult('error');
-      });
+      .catch((err) => {});
   };
 

[Survived] ConditionalExpression
src/components/collections/AddCollection.jsx:93:8
   return (
     <div>
       {redirect ? <Redirect to="/" /> : null}
-      {result !== null && <ResultAlert result={result} setResult={setResult} />}
+      {true}
       <div className="addCollection">
         <h1>Add New Collection</h1>

[Survived] ConditionalExpression
src/components/collections/AddCollection.jsx:93:8
   return (
     <div>
       {redirect ? <Redirect to="/" /> : null}
-      {result !== null && <ResultAlert result={result} setResult={setResult} />}
+      {true && <ResultAlert result={result} setResult={setResult} />}
       <div className="addCollection">
         <h1>Add New Collection</h1>

[Survived] ArrowFunction
src/components/collections/AddCollection.jsx:104:25
               type="text"
               name="author"
               required
-              onChange={(e) => updateForm(e)}
+              onChange={() => undefined}
               value={author}
             />

[Survived] ArrowFunction
src/components/collections/AddCollection.jsx:138:25
             <input
               type="checkbox"
               name="hidden"
-              onChange={(e) => updateForm(e)}
+              onChange={() => undefined}
               value={hidden}
             />

[Survived] ArrowFunction
src/components/collections/AddCollection.jsx:148:25
             <input
               type="text"
               name="contributors"
-              onChange={(e) => updateForm(e)}
+              onChange={() => undefined}
               value={contributors}
             />

[Survived] ArrowFunction
src/components/collections/AddCollection.jsx:158:25
             <input
               type="text"
               name="text"
-              onChange={(e) => updateForm(e)}
+              onChange={() => undefined}
               value={text}
             />

[Survived] ArrowFunction
src/components/collections/AddCollection.jsx:168:25
             <input
               type="text"
               name="category"
-              onChange={(e) => updateForm(e)}
+              onChange={() => undefined}
               value={category}
             />

[Survived] ArrowFunction
src/components/collections/AddCollection.jsx:178:25
             <input
               type="text"
               name="tags"
-              onChange={(e) => updateForm(e)}
+              onChange={() => undefined}
               value={tags}
             />

[Killed] BlockStatement
src/components/collections/AddCollection.jsx:183:40
             />
           </label>
           <br />
-          {linkInput.map((val, idx) => {
-            const link = `link-${idx}`;
-            return (
-              <div key={`link-${idx}`}>
-                <label>
-                  Link:
-                  <input
-                    type="text"
-                    name={link}
-                    id={link}
-                    onChange={(e) => updateForm(e)}
-                  />
-                </label>
-                <button
-                  type="button"
-                  id="add-link"
-                  onClick={() => {
-                    addLinkField();
-                  }}
-                >
-                  +
-                </button>
-              </div>
-            );
-          })}
+          {linkInput.map((val, idx) => {})}
           <br />
           <button type="submit" onClick={addCollection}>

[Survived] StringLiteral
src/components/collections/AddCollection.jsx:186:25
           {linkInput.map((val, idx) => {
             const link = `link-${idx}`;
             return (
-              <div key={`link-${idx}`}>
+              <div key={""}>
                 <label>
                   Link:

[Survived] ArrowFunction
src/components/collections/AddCollection.jsx:193:31
                     type="text"
                     name={link}
                     id={link}
-                    onChange={(e) => updateForm(e)}
+                    onChange={() => undefined}
                   />
                 </label>

[Survived] BlockStatement
src/components/collections/AddCollection.jsx:199:34
                 <button
                   type="button"
                   id="add-link"
-                  onClick={() => {
-                    addLinkField();
-                  }}
+                  onClick={() => {}}
                 >
                   +
