[Killed] BlockStatement
src/components/collections/ExpandedCollection.jsx:17:19
   // console.log('useState collection', collection);
   // console.log('useParams id', id);
 
-  useEffect(() => {
-    // console.log('Fetching /api/collections for', id);
-    fetch(`/api/collections/${id}`)
-      .then((res) => res.json())
-      .then((result) => {
-        console.log(result);
-        setCollection(result);
-      });
-  }, []);
+  useEffect(() => {}, []);
 
   // console.log('useEffect collection', collection);

[Killed] BlockStatement
src/components/collections/ExpandedCollection.jsx:21:25
     // console.log('Fetching /api/collections for', id);
     fetch(`/api/collections/${id}`)
       .then((res) => res.json())
-      .then((result) => {
-        console.log(result);
-        setCollection(result);
-      });
+      .then((result) => {});
   }, []);
 

[Killed] LogicalOperator
src/components/collections/ExpandedCollection.jsx:38:8
         <div className="creator__author">{collection.author}</div>
       </div>
 
-      {collection.links && (
-        <div className="links">
-          {collection.links.map((link) => (
-            <div className="links__item" key={link}>
-              <a href={link} target="_blank" rel="noreferrer">
-                {link}
-              </a>
-            </div>
-          ))}
-        </div>
-      )}
+      {collection.links || <div className="links">
+          {collection.links.map(link => <div className="links__item" key={link}>
+              <a href={link} target="_blank" rel="noreferrer">
+                {link}
+              </a>
+            </div>)}
+        </div>}
 
       {loggedInUser ? (

[Killed] ConditionalExpression
src/components/collections/ExpandedCollection.jsx:38:8
         <div className="creator__author">{collection.author}</div>
       </div>
 
-      {collection.links && (
-        <div className="links">
-          {collection.links.map((link) => (
-            <div className="links__item" key={link}>
-              <a href={link} target="_blank" rel="noreferrer">
-                {link}
-              </a>
-            </div>
-          ))}
-        </div>
-      )}
+      {false}
 
       {loggedInUser ? (

[Killed] ArrowFunction
src/components/collections/ExpandedCollection.jsx:40:33
 
       {collection.links && (
         <div className="links">
-          {collection.links.map((link) => (
-            <div className="links__item" key={link}>
-              <a href={link} target="_blank" rel="noreferrer">
-                {link}
-              </a>
-            </div>
-          ))}
+          {collection.links.map(() => undefined)}
         </div>
       )}
