[Killed] BlockStatement
src/components/collections/LikeButton.jsx:6:45
 import './LikeButton.css';
 
 const LikeButton = ({ id, loggedInUser, likes }) => {
-  function likeButtonClick(eventId, userId) {
-    const payload = { id: userId, collectionId: id };
-
-    fetch(`/api/collections/like/${id}`, {
-      method: 'PUT',
-      headers: {
-        'Content-Type': 'application/json',
-      },
-      body: JSON.stringify(payload),
-    })
-      .then((response) => response.json())
-      .then((data) => {
-        console.log('Success:', data);
-      })
-      .catch((error) => {
-        console.error('Error:', error);
-      });
-  }
+  function likeButtonClick(eventId, userId) {}
 
   return (

[Killed] BlockStatement
src/components/collections/LikeButton.jsx:17:23
       body: JSON.stringify(payload),
     })
       .then((response) => response.json())
-      .then((data) => {
-        console.log('Success:', data);
-      })
+      .then((data) => {})
       .catch((error) => {
         console.error('Error:', error);

[Killed] BlockStatement
src/components/collections/LikeButton.jsx:20:25
       .then((data) => {
         console.log('Success:', data);
       })
-      .catch((error) => {
-        console.error('Error:', error);
-      });
+      .catch((error) => {});
   }
 
