[Killed] BlockStatement
src/components/collections/SaveButton.jsx:4:45
 import React from 'react';
 
 const SaveButton = ({ id, loggedInUser }) => {
-  function likeButtonClick(eventId, userId) {
-    const payload = { id: userId, collectionId: id };
-
-    fetch(`/api/collections/save/${id}`, {
-      method: 'PUT',
-      headers: {
-        'Content-Type': 'application/json',
-      },
-      body: JSON.stringify(payload),
-    })
-      .then((response) => response.json())
-      .then((data) => {
-        console.log('Success:', data);
-      })
-      .catch((error) => {
-        console.error('Error:', error);
-      });
-  }
+  function likeButtonClick(eventId, userId) {}
 
   return (
