[Survived] BlockStatement
learnvault/server/controllers/user.js:13:36
 // Logout user
 // ----------
 
-exports.logoutUser = (req, res) => {
-  return res.clearCookie('token').send({ attempt: 'success' });
-};
+exports.logoutUser = (req, res) => {};
 
 // ----------

[Survived] StringLiteral
learnvault/server/controllers/user.js:14:26
 // ----------
 
 exports.logoutUser = (req, res) => {
-  return res.clearCookie('token').send({ attempt: 'success' });
+  return res.clearCookie("").send({ attempt: 'success' });
 };
 

[Survived] ConditionalExpression
learnvault/server/controllers/user.js:27:9
   User.findOne({ email }, (err, user) => {
     // Database error
     // TODO: pass something back to the front-end to let the client know a DB error occured
-    if (err) {
+    if (true) {
       console.error('Database error: ', err);
       return res.redirect('/login');

[Survived] BlockStatement
learnvault/server/controllers/user.js:27:14
   User.findOne({ email }, (err, user) => {
     // Database error
     // TODO: pass something back to the front-end to let the client know a DB error occured
-    if (err) {
-      console.error('Database error: ', err);
-      return res.redirect('/login');
-    }
+    if (err) {}
 
     // User doesn't exist

[Survived] ConditionalExpression
learnvault/server/controllers/user.js:34:9
 
     // User doesn't exist
     // TODO: pass something back to let the front-end know that user doesn't exist
-    if (!user) {
+    if (false) {
       console.log('User doesn\'t exist');
       return res.redirect('/login');

[Survived] ConditionalExpression
learnvault/server/controllers/user.js:34:9
 
     // User doesn't exist
     // TODO: pass something back to let the front-end know that user doesn't exist
-    if (!user) {
+    if (true) {
       console.log('User doesn\'t exist');
       return res.redirect('/login');

[Survived] StringLiteral
learnvault/server/controllers/user.js:36:27
     // TODO: pass something back to let the front-end know that user doesn't exist
     if (!user) {
       console.log('User doesn\'t exist');
-      return res.redirect('/login');
+      return res.redirect("");
     }
 

[Survived] BlockStatement
learnvault/server/controllers/user.js:40:77
     }
 
     // compare passwords and make sure they match
-    return bcrypt.compare(password, user.password, (bcryptError, result) => {
-      // TODO: let the front-end know that bcrypt ran into an error
-      if (bcryptError) {
-        console.log('Bcrypt error: ', bcryptError);
-        return res.redirect('/login');
-      }
-
-      // TODO: let the client know the password is incorrect
-      if (!result) {
-        console.log('Incorrect password');
-        return res.redirect('/login');
-      }
-
-      // If everything went well, issue a token
-      const { _id: userId } = user;
-      const payload = { userId };
-      const token = jwt.sign(payload, secret, { expiresIn: process.env.JWT_EXPIRATION });
-      return res.cookie('token', token, { httpOnly: true }).send({ attempt: 'success', userId });
-    });
+    return bcrypt.compare(password, user.password, (bcryptError, result) => {});
   });
 };

[Survived] ConditionalExpression
learnvault/server/controllers/user.js:42:11
     // compare passwords and make sure they match
     return bcrypt.compare(password, user.password, (bcryptError, result) => {
       // TODO: let the front-end know that bcrypt ran into an error
-      if (bcryptError) {
+      if (true) {
         console.log('Bcrypt error: ', bcryptError);
         return res.redirect('/login');

[Survived] BlockStatement
learnvault/server/controllers/user.js:42:24
     // compare passwords and make sure they match
     return bcrypt.compare(password, user.password, (bcryptError, result) => {
       // TODO: let the front-end know that bcrypt ran into an error
-      if (bcryptError) {
-        console.log('Bcrypt error: ', bcryptError);
-        return res.redirect('/login');
-      }
+      if (bcryptError) {}
 
       // TODO: let the client know the password is incorrect

[Survived] StringLiteral
learnvault/server/controllers/user.js:43:21
     return bcrypt.compare(password, user.password, (bcryptError, result) => {
       // TODO: let the front-end know that bcrypt ran into an error
       if (bcryptError) {
-        console.log('Bcrypt error: ', bcryptError);
+        console.log("", bcryptError);
         return res.redirect('/login');
       }

[Survived] StringLiteral
learnvault/server/controllers/user.js:44:29
       // TODO: let the front-end know that bcrypt ran into an error
       if (bcryptError) {
         console.log('Bcrypt error: ', bcryptError);
-        return res.redirect('/login');
+        return res.redirect("");
       }
 

[Survived] BooleanLiteral
learnvault/server/controllers/user.js:48:11
       }
 
       // TODO: let the client know the password is incorrect
-      if (!result) {
+      if (result) {
         console.log('Incorrect password');
         return res.redirect('/login');

[Survived] ConditionalExpression
learnvault/server/controllers/user.js:48:11
       }
 
       // TODO: let the client know the password is incorrect
-      if (!result) {
+      if (true) {
         console.log('Incorrect password');
         return res.redirect('/login');

[Survived] StringLiteral
learnvault/server/controllers/user.js:50:29
       // TODO: let the client know the password is incorrect
       if (!result) {
         console.log('Incorrect password');
-        return res.redirect('/login');
+        return res.redirect("");
       }
 

[Survived] ObjectLiteral
learnvault/server/controllers/user.js:55:23
 
       // If everything went well, issue a token
       const { _id: userId } = user;
-      const payload = { userId };
+      const payload = {};
       const token = jwt.sign(payload, secret, { expiresIn: process.env.JWT_EXPIRATION });
       return res.cookie('token', token, { httpOnly: true }).send({ attempt: 'success', userId });

[Survived] BooleanLiteral
learnvault/server/controllers/user.js:57:53
       const { _id: userId } = user;
       const payload = { userId };
       const token = jwt.sign(payload, secret, { expiresIn: process.env.JWT_EXPIRATION });
-      return res.cookie('token', token, { httpOnly: true }).send({ attempt: 'success', userId });
+      return res.cookie('token', token, { httpOnly: false }).send({ attempt: 'success', userId });
     });
   });

[Survived] ObjectLiteral
learnvault/server/controllers/user.js:57:41
       const { _id: userId } = user;
       const payload = { userId };
       const token = jwt.sign(payload, secret, { expiresIn: process.env.JWT_EXPIRATION });
-      return res.cookie('token', token, { httpOnly: true }).send({ attempt: 'success', userId });
+      return res.cookie('token', token, {}).send({ attempt: 'success', userId });
     });
   });

[Survived] ObjectLiteral
learnvault/server/controllers/user.js:73:39
   // Check to see if somebody with that email is already registered
   // --------------------------------------------------------------
 
-  const emailFromDb = await User.find({ email });
+  const emailFromDb = await User.find({});
 
   if (emailFromDb.length) {

[Survived] BlockStatement
learnvault/server/controllers/user.js:75:27
 
   const emailFromDb = await User.find({ email });
 
-  if (emailFromDb.length) {
-    return res.send({ emailAlreadyExists: true });
-  }
+  if (emailFromDb.length) {}
 
   // ---------------------------------------------

[Survived] ConditionalExpression
learnvault/server/controllers/user.js:75:7
 
   const emailFromDb = await User.find({ email });
 
-  if (emailFromDb.length) {
+  if (true) {
     return res.send({ emailAlreadyExists: true });
   }

[Survived] BooleanLiteral
learnvault/server/controllers/user.js:76:43
   const emailFromDb = await User.find({ email });
 
   if (emailFromDb.length) {
-    return res.send({ emailAlreadyExists: true });
+    return res.send({ emailAlreadyExists: false });
   }
 

[Survived] ObjectLiteral
learnvault/server/controllers/user.js:76:21
   const emailFromDb = await User.find({ email });
 
   if (emailFromDb.length) {
-    return res.send({ emailAlreadyExists: true });
+    return res.send({});
   }
 

[Survived] ConditionalExpression
learnvault/server/controllers/user.js:85:7
 
   const userFromDb = await User.find({ username });
 
-  if (userFromDb.length) {
+  if (true) {
     return res.send({ usernameTaken: true });
   }

[Survived] BlockStatement
learnvault/server/controllers/user.js:85:26
 
   const userFromDb = await User.find({ username });
 
-  if (userFromDb.length) {
-    return res.send({ usernameTaken: true });
-  }
+  if (userFromDb.length) {}
 
   // ------------------------------------------------------------

[Survived] BooleanLiteral
learnvault/server/controllers/user.js:86:38
   const userFromDb = await User.find({ username });
 
   if (userFromDb.length) {
-    return res.send({ usernameTaken: true });
+    return res.send({ usernameTaken: false });
   }
 

[Survived] ObjectLiteral
learnvault/server/controllers/user.js:86:21
   const userFromDb = await User.find({ username });
 
   if (userFromDb.length) {
-    return res.send({ usernameTaken: true });
+    return res.send({});
   }
 

[Survived] BlockStatement
learnvault/server/controllers/user.js:99:23
 
   return user
     .save()
-    .then((result) => {
-      console.log('User added to the DB!');
-
-      const { _id: userId } = result;
-      const payload = { userId };
-      const token = jwt.sign(payload, secret, { expiresIn: process.env.JWT_EXPIRATION });
-      return res.cookie('token', token, { httpOnly: true }).send({ registrationSuccessful: true, userId });
-    })
+    .then((result) => {})
     .catch((err) => {
       console.log('Error when saving user to DB: ', err);

[Survived] StringLiteral
learnvault/server/controllers/user.js:100:19
   return user
     .save()
     .then((result) => {
-      console.log('User added to the DB!');
+      console.log("");
 
       const { _id: userId } = result;

[Survived] ObjectLiteral
learnvault/server/controllers/user.js:103:23
       console.log('User added to the DB!');
 
       const { _id: userId } = result;
-      const payload = { userId };
+      const payload = {};
       const token = jwt.sign(payload, secret, { expiresIn: process.env.JWT_EXPIRATION });
       return res.cookie('token', token, { httpOnly: true }).send({ registrationSuccessful: true, userId });

[Survived] BooleanLiteral
learnvault/server/controllers/user.js:105:53
       const { _id: userId } = result;
       const payload = { userId };
       const token = jwt.sign(payload, secret, { expiresIn: process.env.JWT_EXPIRATION });
-      return res.cookie('token', token, { httpOnly: true }).send({ registrationSuccessful: true, userId });
+      return res.cookie('token', token, { httpOnly: false }).send({ registrationSuccessful: true, userId });
     })
     .catch((err) => {

[Survived] BooleanLiteral
learnvault/server/controllers/user.js:105:92
       const { _id: userId } = result;
       const payload = { userId };
       const token = jwt.sign(payload, secret, { expiresIn: process.env.JWT_EXPIRATION });
-      return res.cookie('token', token, { httpOnly: true }).send({ registrationSuccessful: true, userId });
+      return res.cookie('token', token, { httpOnly: true }).send({ registrationSuccessful: false, userId });
     })
     .catch((err) => {

[Survived] BlockStatement
learnvault/server/controllers/user.js:107:21
       const token = jwt.sign(payload, secret, { expiresIn: process.env.JWT_EXPIRATION });
       return res.cookie('token', token, { httpOnly: true }).send({ registrationSuccessful: true, userId });
     })
-    .catch((err) => {
-      console.log('Error when saving user to DB: ', err);
-      res.send({ error: err });
-    });
+    .catch((err) => {});
 };
 
