[Survived] BooleanLiteral
learnvault/server/models/Collection.js:25:37
   //   type: Schema.Types.ObjectId,
   //   ref: 'users',
   // },
-  author: { type: String, required: true },
+  author: { type: String, required: false },
   title: { type: String, required: true },
   description: { type: String, required: true },

[Survived] BooleanLiteral
learnvault/server/models/Collection.js:26:36
   //   ref: 'users',
   // },
   author: { type: String, required: true },
-  title: { type: String, required: true },
+  title: { type: String, required: false },
   description: { type: String, required: true },
   hidden: { type: Boolean, required: true },

[Survived] BooleanLiteral
learnvault/server/models/Collection.js:27:42
   // },
   author: { type: String, required: true },
   title: { type: String, required: true },
-  description: { type: String, required: true },
+  description: { type: String, required: false },
   hidden: { type: Boolean, required: true },
   contributors: [{ type: String }],

[Survived] ObjectLiteral
learnvault/server/models/Collection.js:27:16
   // },
   author: { type: String, required: true },
   title: { type: String, required: true },
-  description: { type: String, required: true },
+  description: {},
   hidden: { type: Boolean, required: true },
   contributors: [{ type: String }],

[Survived] BooleanLiteral
learnvault/server/models/Collection.js:28:38
   author: { type: String, required: true },
   title: { type: String, required: true },
   description: { type: String, required: true },
-  hidden: { type: Boolean, required: true },
+  hidden: { type: Boolean, required: false },
   contributors: [{ type: String }],
   // contributors: [

[Survived] ObjectLiteral
learnvault/server/models/Collection.js:28:11
   author: { type: String, required: true },
   title: { type: String, required: true },
   description: { type: String, required: true },
-  hidden: { type: Boolean, required: true },
+  hidden: {},
   contributors: [{ type: String }],
   // contributors: [

[Survived] ObjectLiteral
learnvault/server/models/Collection.js:29:18
   title: { type: String, required: true },
   description: { type: String, required: true },
   hidden: { type: Boolean, required: true },
-  contributors: [{ type: String }],
+  contributors: [{}],
   // contributors: [
   //   {

[Survived] ArrayDeclaration
learnvault/server/models/Collection.js:29:17
   title: { type: String, required: true },
   description: { type: String, required: true },
   hidden: { type: Boolean, required: true },
-  contributors: [{ type: String }],
+  contributors: [],
   // contributors: [
   //   {

[Survived] ObjectLiteral
learnvault/server/models/Collection.js:38:9
   //     },
   //   },
   // ],
-  text: {
-    type: String,
-  },
+  text: {},
   links: [{ type: String }],
   // likes: [

[Survived] ObjectLiteral
learnvault/server/models/Collection.js:51:13
   //   },
   // ],
   likes: [{ type: String }],
-  category: {
-    type: String,
-  },
+  category: {},
   tags: [{ type: String }],
   updated: {

[Survived] ObjectLiteral
learnvault/server/models/Collection.js:54:10
   category: {
     type: String,
   },
-  tags: [{ type: String }],
+  tags: [{}],
   updated: {
     type: Date,
