[Survived] ObjectLiteral
learnvault/server/models/user.js:6:10
 const { Schema } = mongoose;
 
 const userSchema = new Schema({
-  email: {
-    type: String,
-    required: true,
-  },
+  email: {},
   username: {
     type: String,

[Survived] ArrayDeclaration
learnvault/server/models/user.js:19:5
     required: true,
   },
   savedcollections:
-    [{ type: String }]
+    []
   ,
 });

[Survived] StringLiteral
learnvault/server/models/user.js:23:33
   ,
 });
 
-module.exports = mongoose.model('User', userSchema);
+module.exports = mongoose.model("", userSchema);
 
