[Survived] BlockStatement
server/routes/api/collections.js:72:37
 // @desc    Get all collections
 // @access  Public
 
-router.get('/', async (req, res) => {
-  try {
-    const collections = await Collection.find({ hidden: 'false' }).sort({
-      date: -1,
-    });
-    res.json(collections);
-  } catch (err) {
-    console.error(err.message);
-    res.status(500).send('Server Error');
-  }
-});
+router.get('/', async (req, res) => {});
 
 // POST '/api/collections'  - Create a new collection

[Survived] BlockStatement
server/routes/api/collections.js:73:7
 // @access  Public
 
 router.get('/', async (req, res) => {
-  try {
-    const collections = await Collection.find({ hidden: 'false' }).sort({
-      date: -1,
-    });
-    res.json(collections);
-  } catch (err) {
+  try {} catch (err) {
     console.error(err.message);
     res.status(500).send('Server Error');

[Survived] UnaryOperator
server/routes/api/collections.js:75:13
 router.get('/', async (req, res) => {
   try {
     const collections = await Collection.find({ hidden: 'false' }).sort({
-      date: -1,
+      date: +1,
     });
     res.json(collections);

[Survived] BlockStatement
server/routes/api/collections.js:78:17
       date: -1,
     });
     res.json(collections);
-  } catch (err) {
-    console.error(err.message);
-    res.status(500).send('Server Error');
-  }
+  } catch (err) {}
 });
 

[Survived] ConditionalExpression
server/routes/api/collections.js:112:11
 
       const collectionDetails = {};
 
-      if (author) collectionDetails.author = author;
+      if (true) collectionDetails.author = author;
       if (title) collectionDetails.title = title;
       if (description) collectionDetails.description = description;

[Survived] ConditionalExpression
server/routes/api/collections.js:112:11
 
       const collectionDetails = {};
 
-      if (author) collectionDetails.author = author;
+      if (false) collectionDetails.author = author;
       if (title) collectionDetails.title = title;
       if (description) collectionDetails.description = description;

[Survived] ConditionalExpression
server/routes/api/collections.js:113:11
       const collectionDetails = {};
 
       if (author) collectionDetails.author = author;
-      if (title) collectionDetails.title = title;
+      if (true) collectionDetails.title = title;
       if (description) collectionDetails.description = description;
       if (hidden !== undefined) collectionDetails.hidden = hidden;

[Survived] ConditionalExpression
server/routes/api/collections.js:113:11
       const collectionDetails = {};
 
       if (author) collectionDetails.author = author;
-      if (title) collectionDetails.title = title;
+      if (false) collectionDetails.title = title;
       if (description) collectionDetails.description = description;
       if (hidden !== undefined) collectionDetails.hidden = hidden;

[Survived] ConditionalExpression
server/routes/api/collections.js:114:11
 
       if (author) collectionDetails.author = author;
       if (title) collectionDetails.title = title;
-      if (description) collectionDetails.description = description;
+      if (false) collectionDetails.description = description;
       if (hidden !== undefined) collectionDetails.hidden = hidden;
       if (category) collectionDetails.category = category;

[Survived] ConditionalExpression
server/routes/api/collections.js:114:11
 
       if (author) collectionDetails.author = author;
       if (title) collectionDetails.title = title;
-      if (description) collectionDetails.description = description;
+      if (true) collectionDetails.description = description;
       if (hidden !== undefined) collectionDetails.hidden = hidden;
       if (category) collectionDetails.category = category;

[Survived] ConditionalExpression
server/routes/api/collections.js:115:11
       if (author) collectionDetails.author = author;
       if (title) collectionDetails.title = title;
       if (description) collectionDetails.description = description;
-      if (hidden !== undefined) collectionDetails.hidden = hidden;
+      if (true) collectionDetails.hidden = hidden;
       if (category) collectionDetails.category = category;
       if (text) collectionDetails.text = text;

[Survived] ConditionalExpression
server/routes/api/collections.js:115:11
       if (author) collectionDetails.author = author;
       if (title) collectionDetails.title = title;
       if (description) collectionDetails.description = description;
-      if (hidden !== undefined) collectionDetails.hidden = hidden;
+      if (false) collectionDetails.hidden = hidden;
       if (category) collectionDetails.category = category;
       if (text) collectionDetails.text = text;

[Survived] ConditionalExpression
server/routes/api/collections.js:116:11
       if (title) collectionDetails.title = title;
       if (description) collectionDetails.description = description;
       if (hidden !== undefined) collectionDetails.hidden = hidden;
-      if (category) collectionDetails.category = category;
+      if (false) collectionDetails.category = category;
       if (text) collectionDetails.text = text;
 

[Survived] ConditionalExpression
server/routes/api/collections.js:116:11
       if (title) collectionDetails.title = title;
       if (description) collectionDetails.description = description;
       if (hidden !== undefined) collectionDetails.hidden = hidden;
-      if (category) collectionDetails.category = category;
+      if (true) collectionDetails.category = category;
       if (text) collectionDetails.text = text;
 

[Survived] ConditionalExpression
server/routes/api/collections.js:117:11
       if (description) collectionDetails.description = description;
       if (hidden !== undefined) collectionDetails.hidden = hidden;
       if (category) collectionDetails.category = category;
-      if (text) collectionDetails.text = text;
+      if (false) collectionDetails.text = text;
 
       if (contributors) {

[Survived] ConditionalExpression
server/routes/api/collections.js:117:11
       if (description) collectionDetails.description = description;
       if (hidden !== undefined) collectionDetails.hidden = hidden;
       if (category) collectionDetails.category = category;
-      if (text) collectionDetails.text = text;
+      if (true) collectionDetails.text = text;
 
       if (contributors) {

[Survived] BlockStatement
server/routes/api/collections.js:119:25
       if (category) collectionDetails.category = category;
       if (text) collectionDetails.text = text;
 
-      if (contributors) {
-        collectionDetails.contributors = contributors
-          .split(',')
-          .map((contributor) => contributor.trim());
-      }
+      if (contributors) {}
 
       if (tags) {

[Survived] ConditionalExpression
server/routes/api/collections.js:119:11
       if (category) collectionDetails.category = category;
       if (text) collectionDetails.text = text;
 
-      if (contributors) {
+      if (true) {
         collectionDetails.contributors = contributors
           .split(',')

[Survived] ArrowFunction
server/routes/api/collections.js:122:16
       if (contributors) {
         collectionDetails.contributors = contributors
           .split(',')
-          .map((contributor) => contributor.trim());
+          .map(() => undefined);
       }
 

[Survived] BlockStatement
server/routes/api/collections.js:125:17
           .map((contributor) => contributor.trim());
       }
 
-      if (tags) {
-        collectionDetails.tags = tags.split(',').map((tag) => tag.trim());
-      }
+      if (tags) {}
 
       if (links) {

[Survived] ConditionalExpression
server/routes/api/collections.js:125:11
           .map((contributor) => contributor.trim());
       }
 
-      if (tags) {
+      if (true) {
         collectionDetails.tags = tags.split(',').map((tag) => tag.trim());
       }

[Survived] ArrowFunction
server/routes/api/collections.js:126:54
       }
 
       if (tags) {
-        collectionDetails.tags = tags.split(',').map((tag) => tag.trim());
+        collectionDetails.tags = tags.split(',').map(() => undefined);
       }
 

[Survived] StringLiteral
server/routes/api/collections.js:126:45
       }
 
       if (tags) {
-        collectionDetails.tags = tags.split(',').map((tag) => tag.trim());
+        collectionDetails.tags = tags.split("").map((tag) => tag.trim());
       }
 

[Survived] ConditionalExpression
server/routes/api/collections.js:129:11
         collectionDetails.tags = tags.split(',').map((tag) => tag.trim());
       }
 
-      if (links) {
+      if (false) {
         collectionDetails.links = links.split(',').map((link) => link.trim());
       }

[Survived] BlockStatement
server/routes/api/collections.js:129:18
         collectionDetails.tags = tags.split(',').map((tag) => tag.trim());
       }
 
-      if (links) {
-        collectionDetails.links = links.split(',').map((link) => link.trim());
-      }
+      if (links) {}
 
       // console.log('collectionDetails', collectionDetails);

[Survived] ArrowFunction
server/routes/api/collections.js:130:56
       }
 
       if (links) {
-        collectionDetails.links = links.split(',').map((link) => link.trim());
+        collectionDetails.links = links.split(',').map(() => undefined);
       }
 

[Survived] BlockStatement
server/routes/api/collections.js:139:19
       await collection.save();
 
       res.status(200).json(collection);
-    } catch (err) {
-      console.error(err.message);
-      res.status(500).send('Server Error');
-    }
+    } catch (err) {}
   }
 );

[Survived] BlockStatement
server/routes/api/collections.js:152:7
 // @access  Private
 
 router.get('/:id', async (req, res) => {
-  try {
-    // Get user ID
-
-    const collection = await Collection.findById(req.params.id);
-
-    // Check if collection is public or private
-    // If collection is private - check if user has access to view collection
-
-    if (!collection) {
-      return res.status(404).json({ msg: 'Collection not found' });
-    }
-
-    return res.json(collection);
-  } catch (err) {
+  try {} catch (err) {
     console.error(err.message);
     if (err.kind === 'ObjectId') {

[Survived] ConditionalExpression
server/routes/api/collections.js:160:9
     // Check if collection is public or private
     // If collection is private - check if user has access to view collection
 
-    if (!collection) {
+    if (true) {
       return res.status(404).json({ msg: 'Collection not found' });
     }

[Survived] BlockStatement
server/routes/api/collections.js:160:22
     // Check if collection is public or private
     // If collection is private - check if user has access to view collection
 
-    if (!collection) {
-      return res.status(404).json({ msg: 'Collection not found' });
-    }
+    if (!collection) {}
 
     return res.json(collection);

[Survived] ObjectLiteral
server/routes/api/collections.js:161:35
     // If collection is private - check if user has access to view collection
 
     if (!collection) {
-      return res.status(404).json({ msg: 'Collection not found' });
+      return res.status(404).json({});
     }
 

[Survived] BlockStatement
server/routes/api/collections.js:165:17
     }
 
     return res.json(collection);
-  } catch (err) {
-    console.error(err.message);
-    if (err.kind === 'ObjectId') {
-      return res.status(404).json({ msg: 'Collection not found' });
-    }
-    return res
-      .status(500)
-      .send(
-        'Server Error or Collection not found due to invalid Collection ID'
-      );
-  }
+  } catch (err) {}
 });
 

[Survived] BlockStatement
server/routes/api/collections.js:167:34
     return res.json(collection);
   } catch (err) {
     console.error(err.message);
-    if (err.kind === 'ObjectId') {
-      return res.status(404).json({ msg: 'Collection not found' });
-    }
+    if (err.kind === 'ObjectId') {}
     return res
       .status(500)

[Survived] ConditionalExpression
server/routes/api/collections.js:167:9
     return res.json(collection);
   } catch (err) {
     console.error(err.message);
-    if (err.kind === 'ObjectId') {
+    if (true) {
       return res.status(404).json({ msg: 'Collection not found' });
     }

[Survived] ObjectLiteral
server/routes/api/collections.js:168:35
   } catch (err) {
     console.error(err.message);
     if (err.kind === 'ObjectId') {
-      return res.status(404).json({ msg: 'Collection not found' });
+      return res.status(404).json({});
     }
     return res

[Survived] StringLiteral
server/routes/api/collections.js:173:9
     return res
       .status(500)
       .send(
-        'Server Error or Collection not found due to invalid Collection ID'
+        ""
       );
   }

[Survived] ConditionalExpression
server/routes/api/collections.js:197:7
 
   const collectionDetails = {};
 
-  if (title) collectionDetails.title = title;
+  if (true) collectionDetails.title = title;
   if (description) collectionDetails.description = description;
   if (hidden) collectionDetails.hidden = hidden;

[Survived] ConditionalExpression
server/routes/api/collections.js:197:7
 
   const collectionDetails = {};
 
-  if (title) collectionDetails.title = title;
+  if (false) collectionDetails.title = title;
   if (description) collectionDetails.description = description;
   if (hidden) collectionDetails.hidden = hidden;

[Survived] ConditionalExpression
server/routes/api/collections.js:199:7
 
   if (title) collectionDetails.title = title;
   if (description) collectionDetails.description = description;
-  if (hidden) collectionDetails.hidden = hidden;
+  if (false) collectionDetails.hidden = hidden;
   if (category) collectionDetails.category = category;
   if (text) collectionDetails.text = text;

[Survived] ConditionalExpression
server/routes/api/collections.js:199:7
 
   if (title) collectionDetails.title = title;
   if (description) collectionDetails.description = description;
-  if (hidden) collectionDetails.hidden = hidden;
+  if (true) collectionDetails.hidden = hidden;
   if (category) collectionDetails.category = category;
   if (text) collectionDetails.text = text;

[Survived] ConditionalExpression
server/routes/api/collections.js:200:7
   if (title) collectionDetails.title = title;
   if (description) collectionDetails.description = description;
   if (hidden) collectionDetails.hidden = hidden;
-  if (category) collectionDetails.category = category;
+  if (true) collectionDetails.category = category;
   if (text) collectionDetails.text = text;
 

[Survived] ConditionalExpression
server/routes/api/collections.js:200:7
   if (title) collectionDetails.title = title;
   if (description) collectionDetails.description = description;
   if (hidden) collectionDetails.hidden = hidden;
-  if (category) collectionDetails.category = category;
+  if (false) collectionDetails.category = category;
   if (text) collectionDetails.text = text;
 

[Survived] StringLiteral
server/routes/api/collections.js:205:14
 
   if (contributors) {
     collectionDetails.contributors = contributors
-      .split(',')
+      .split("")
       .map((contributor) => contributor.trim());
   }

[Survived] ConditionalExpression
server/routes/api/collections.js:209:7
       .map((contributor) => contributor.trim());
   }
 
-  if (tags) {
+  if (false) {
     collectionDetails.tags = tags.split(',').map((tag) => tag.trim());
   }

[Survived] BlockStatement
server/routes/api/collections.js:217:7
     collectionDetails.links = links.split(',').map((link) => link.trim());
   }
 
-  try {
-    const collection = await Collection.findOneAndUpdate(
-      {
-        _id: req.params.id,
-      },
-      collectionDetails,
-      { new: true, upsert: false }
-    );
-
-    if (!collection) {
-      console.log('no collection');
-      return res.status(404).json({ msg: 'Collection not found' });
-    }
-
-    return res.json(collection);
-  } catch (err) {
+  try {} catch (err) {
     console.error(err.message);
 

[Survived] ObjectLiteral
server/routes/api/collections.js:219:7
 
   try {
     const collection = await Collection.findOneAndUpdate(
-      {
-        _id: req.params.id,
-      },
+      {},
       collectionDetails,
       { new: true, upsert: false }

[Survived] BooleanLiteral
server/routes/api/collections.js:223:14
         _id: req.params.id,
       },
       collectionDetails,
-      { new: true, upsert: false }
+      { new: false, upsert: false }
     );
 

[Survived] BooleanLiteral
server/routes/api/collections.js:223:28
         _id: req.params.id,
       },
       collectionDetails,
-      { new: true, upsert: false }
+      { new: true, upsert: true }
     );
 

[Survived] BlockStatement
server/routes/api/collections.js:226:22
       { new: true, upsert: false }
     );
 
-    if (!collection) {
-      console.log('no collection');
-      return res.status(404).json({ msg: 'Collection not found' });
-    }
+    if (!collection) {}
 
     return res.json(collection);

[Survived] BooleanLiteral
server/routes/api/collections.js:226:9
       { new: true, upsert: false }
     );
 
-    if (!collection) {
+    if (collection) {
       console.log('no collection');
       return res.status(404).json({ msg: 'Collection not found' });

[Survived] BlockStatement
server/routes/api/collections.js:232:17
     }
 
     return res.json(collection);
-  } catch (err) {
-    console.error(err.message);
-
-    return res.status(500).json({ msg: 'Server Error' });
-  }
+  } catch (err) {}
 });
 

[Survived] StringLiteral
server/routes/api/collections.js:235:40
   } catch (err) {
     console.error(err.message);
 
-    return res.status(500).json({ msg: 'Server Error' });
+    return res.status(500).json({ msg: "" });
   }
 });

[Survived] BlockStatement
server/routes/api/collections.js:244:43
 // @desc    Delete a collection by ID
 // @access  Private
 
-router.delete('/:id', async (req, res) => {
-  try {
-    const collection = await Collection.findById(req.params.id);
-
-    if (!collection) {
-      return res.status(404).json({ msg: 'Collection not found' });
-    }
-
-    // TO DO: Check if user is authorized to delete post
-
-    await collection.remove();
-
-    return res.json('Collection Deleted');
-  } catch (err) {
-    console.error(err.message);
-    return res.status(500).send('Server Error');
-  }
-});
+router.delete('/:id', async (req, res) => {});
 
 // PUT - 'api/collections/like/:id' - Like a collection

[Survived] BlockStatement
server/routes/api/collections.js:245:7
 // @access  Private
 
 router.delete('/:id', async (req, res) => {
-  try {
-    const collection = await Collection.findById(req.params.id);
-
-    if (!collection) {
-      return res.status(404).json({ msg: 'Collection not found' });
-    }
-
-    // TO DO: Check if user is authorized to delete post
-
-    await collection.remove();
-
-    return res.json('Collection Deleted');
-  } catch (err) {
+  try {} catch (err) {
     console.error(err.message);
     return res.status(500).send('Server Error');

[Survived] StringLiteral
server/routes/api/collections.js:249:42
     const collection = await Collection.findById(req.params.id);
 
     if (!collection) {
-      return res.status(404).json({ msg: 'Collection not found' });
+      return res.status(404).json({ msg: "" });
     }
 

[Survived] StringLiteral
server/routes/api/collections.js:256:21
 
     await collection.remove();
 
-    return res.json('Collection Deleted');
+    return res.json("");
   } catch (err) {
     console.error(err.message);

[Survived] BlockStatement
server/routes/api/collections.js:257:17
     await collection.remove();
 
     return res.json('Collection Deleted');
-  } catch (err) {
-    console.error(err.message);
-    return res.status(500).send('Server Error');
-  }
+  } catch (err) {}
 });
 

[Survived] BlockStatement
server/routes/api/collections.js:268:45
 // @desc    Delete a collection by ID
 // @access  Private
 
-router.put('/like/:id', async (req, res) => {
-  const collection = await Collection.findById(req.body.collectionId);
-
-  try {
-    if (collection.likes.filter((like) => like === req.body.id).length > 0) {
-      return res
-        .status(400)
-        .json({ msg: 'You have already liked this collection' });
-    }
-
-    collection.likes.push(req.body.id);
-
-    await collection.save();
-
-    return res.send(collection.likes);
-  } catch (err) {
-    console.error(err.message);
-    return res.status(500).send('Server Error');
-  }
-});
+router.put('/like/:id', async (req, res) => {});
 
 // PUT - 'api/collections/unlike/:id' - Unlike a collection

[Survived] BlockStatement
server/routes/api/collections.js:271:7
 router.put('/like/:id', async (req, res) => {
   const collection = await Collection.findById(req.body.collectionId);
 
-  try {
-    if (collection.likes.filter((like) => like === req.body.id).length > 0) {
-      return res
-        .status(400)
-        .json({ msg: 'You have already liked this collection' });
-    }
-
-    collection.likes.push(req.body.id);
-
-    await collection.save();
-
-    return res.send(collection.likes);
-  } catch (err) {
+  try {} catch (err) {
     console.error(err.message);
     return res.status(500).send('Server Error');

[Survived] ArrowFunction
server/routes/api/collections.js:272:33
   const collection = await Collection.findById(req.body.collectionId);
 
   try {
-    if (collection.likes.filter((like) => like === req.body.id).length > 0) {
+    if (collection.likes.filter(() => undefined).length > 0) {
       return res
         .status(400)

[Survived] ConditionalExpression
server/routes/api/collections.js:272:9
   const collection = await Collection.findById(req.body.collectionId);
 
   try {
-    if (collection.likes.filter((like) => like === req.body.id).length > 0) {
+    if (false) {
       return res
         .status(400)

[Survived] ObjectLiteral
server/routes/api/collections.js:275:15
     if (collection.likes.filter((like) => like === req.body.id).length > 0) {
       return res
         .status(400)
-        .json({ msg: 'You have already liked this collection' });
+        .json({});
     }
 

[Survived] BlockStatement
server/routes/api/collections.js:283:17
     await collection.save();
 
     return res.send(collection.likes);
-  } catch (err) {
-    console.error(err.message);
-    return res.status(500).send('Server Error');
-  }
+  } catch (err) {}
 });
 

[Survived] BlockStatement
server/routes/api/collections.js:297:7
 router.put('/unlike/:id', async (req, res) => {
   const collection = await Collection.findById(req.params.id);
 
-  try {
-    if (
-      collection.likes.filter((like) => like.user === req.user.name).length ===
-      0
-    ) {
-      return res
-        .status(400)
-        .json({ msg: 'You have not liked this collection' });
-    }
-
-    const indexToRemove = collection.likes.map((like) =>
-      like.user.toString().indexOf(req.user.name)
-    );
-
-    collection.likes.splice(indexToRemove, 1);
-
-    await collection.save();
-
-    return res.send(collection.likes);
-  } catch (err) {
+  try {} catch (err) {
     console.error(err.message);
     return res.status(500).send('Server Error');

[Survived] ConditionalExpression
server/routes/api/collections.js:299:41
 
   try {
     if (
-      collection.likes.filter((like) => like.user === req.user.name).length ===
+      collection.likes.filter((like) => true).length ===
       0
     ) {

[Survived] EqualityOperator
server/routes/api/collections.js:299:7
 
   try {
     if (
-      collection.likes.filter((like) => like.user === req.user.name).length ===
-      0
+      collection.likes.filter(like => like.user === req.user.name).length !== 0
     ) {
       return res

[Survived] BlockStatement
server/routes/api/collections.js:301:7
     if (
       collection.likes.filter((like) => like.user === req.user.name).length ===
       0
-    ) {
-      return res
-        .status(400)
-        .json({ msg: 'You have not liked this collection' });
-    }
+    ) {}
 
     const indexToRemove = collection.likes.map((like) =>

[Survived] ObjectLiteral
server/routes/api/collections.js:304:15
     ) {
       return res
         .status(400)
-        .json({ msg: 'You have not liked this collection' });
+        .json({});
     }
 

[Survived] ArrowFunction
server/routes/api/collections.js:307:48
         .json({ msg: 'You have not liked this collection' });
     }
 
-    const indexToRemove = collection.likes.map((like) =>
-      like.user.toString().indexOf(req.user.name)
+    const indexToRemove = collection.likes.map(() => undefined
     );
 

[Survived] BlockStatement
server/routes/api/collections.js:327:45
 // @desc    Save a collection by ID
 // @access  Private
 
-router.put('/save/:id', async (req, res) => {
-  const user = await User.findById(req.body.id);
-
-  try {
-    if (
-      user.savedcollections.filter((col) => col === req.body.collectionId)
-        .length > 0
-    ) {
-      return res
-        .status(400)
-        .json({ msg: 'You have already saved this collection' });
-    }
-
-    user.savedcollections.push(req.body.collectionId);
-
-    await user.save();
-
-    return res.send(user.savedcollections);
-  } catch (err) {
-    console.error(err.message);
-    return res.status(500).send('Server Error');
-  }
-});
+router.put('/save/:id', async (req, res) => {});
 
 // GET - 'api/collections/savedcollections' - Get saved collections

[Survived] BlockStatement
server/routes/api/collections.js:330:7
 router.put('/save/:id', async (req, res) => {
   const user = await User.findById(req.body.id);
 
-  try {
-    if (
-      user.savedcollections.filter((col) => col === req.body.collectionId)
-        .length > 0
-    ) {
-      return res
-        .status(400)
-        .json({ msg: 'You have already saved this collection' });
-    }
-
-    user.savedcollections.push(req.body.collectionId);
-
-    await user.save();
-
-    return res.send(user.savedcollections);
-  } catch (err) {
+  try {} catch (err) {
     console.error(err.message);
     return res.status(500).send('Server Error');

[Survived] EqualityOperator
server/routes/api/collections.js:332:7
 
   try {
     if (
-      user.savedcollections.filter((col) => col === req.body.collectionId)
-        .length > 0
+      user.savedcollections.filter(col => col === req.body.collectionId).length <= 0
     ) {
       return res

[Survived] EqualityOperator
server/routes/api/collections.js:332:45
 
   try {
     if (
-      user.savedcollections.filter((col) => col === req.body.collectionId)
+      user.savedcollections.filter((col) => col !== req.body.collectionId)
         .length > 0
     ) {

[Survived] BlockStatement
server/routes/api/collections.js:334:7
     if (
       user.savedcollections.filter((col) => col === req.body.collectionId)
         .length > 0
-    ) {
-      return res
-        .status(400)
-        .json({ msg: 'You have already saved this collection' });
-    }
+    ) {}
 
     user.savedcollections.push(req.body.collectionId);

[Survived] BlockStatement
server/routes/api/collections.js:345:17
     await user.save();
 
     return res.send(user.savedcollections);
-  } catch (err) {
-    console.error(err.message);
-    return res.status(500).send('Server Error');
-  }
+  } catch (err) {}
 });
 

[Survived] BlockStatement
server/routes/api/collections.js:356:61
 // @desc    Get saved collections for logged in user
 // @access  Private
 
-router.get('/savedcollections/:userId', async (req, res) => {
-  // const collection = await Collection.findById((req.body.collectionId));
-  const user = await User.findById(req.params.userId);
-
-  try {
-    if (user.savedcollections.length === 0) {
-      return res
-        .status(400)
-        .json({ msg: 'You have not saved any collections' });
-    }
-
-    return res.send(user.savedcollections);
-  } catch (err) {
-    console.error(err.message);
-    return res.status(500).send('Server Error');
-  }
-});
+router.get('/savedcollections/:userId', async (req, res) => {});
 
 // PUT -     'api/collections/links/:id' - Add a link to a collection

[Survived] StringLiteral
server/routes/api/collections.js:356:12
 // @desc    Get saved collections for logged in user
 // @access  Private
 
-router.get('/savedcollections/:userId', async (req, res) => {
+router.get("", async (req, res) => {
   // const collection = await Collection.findById((req.body.collectionId));
   const user = await User.findById(req.params.userId);

[Survived] BlockStatement
server/routes/api/collections.js:360:7
   // const collection = await Collection.findById((req.body.collectionId));
   const user = await User.findById(req.params.userId);
 
-  try {
-    if (user.savedcollections.length === 0) {
-      return res
-        .status(400)
-        .json({ msg: 'You have not saved any collections' });
-    }
-
-    return res.send(user.savedcollections);
-  } catch (err) {
+  try {} catch (err) {
     console.error(err.message);
     return res.status(500).send('Server Error');

[Survived] ConditionalExpression
server/routes/api/collections.js:361:9
   const user = await User.findById(req.params.userId);
 
   try {
-    if (user.savedcollections.length === 0) {
+    if (true) {
       return res
         .status(400)

[Survived] BlockStatement
server/routes/api/collections.js:361:45
   const user = await User.findById(req.params.userId);
 
   try {
-    if (user.savedcollections.length === 0) {
-      return res
-        .status(400)
-        .json({ msg: 'You have not saved any collections' });
-    }
+    if (user.savedcollections.length === 0) {}
 
     return res.send(user.savedcollections);
