[Survived] BlockStatement
server/routes/api/collections.js:389:49
 // @desc    Update collection category
 // @access  Private
 
-router.put('/category/:id', async (req, res) => {
-  const collection = Collection.findById(req.params.id);
-
-  try {
-    collection.category = req.category;
-
-    await collection.save();
-    res.send(collection.category);
-  } catch (err) {
-    console.error(err.message);
-    res.status(500).send('Server Error');
-  }
-});
+router.put('/category/:id', async (req, res) => {});
 
 // PUT - 'api/collections/tags/:id' - Update collection tags

[Survived] BlockStatement
server/routes/api/collections.js:392:7
 router.put('/category/:id', async (req, res) => {
   const collection = Collection.findById(req.params.id);
 
-  try {
-    collection.category = req.category;
-
-    await collection.save();
-    res.send(collection.category);
-  } catch (err) {
+  try {} catch (err) {
     console.error(err.message);
     res.status(500).send('Server Error');

[Survived] BlockStatement
server/routes/api/collections.js:397:17
 
     await collection.save();
     res.send(collection.category);
-  } catch (err) {
-    console.error(err.message);
-    res.status(500).send('Server Error');
-  }
+  } catch (err) {}
 });
 

[Survived] BlockStatement
server/routes/api/collections.js:408:45
 // @desc    Update tags on a collection
 // @access  Private
 
-router.put('/tags/:id', async (req, res) => {
-  const collection = Collection.findById(req.params.id);
-
-  try {
-    if (
-      collection.tags.filter((tag) => tag.toString() === req.tag).length > 0
-    ) {
-      return res.status(400).json({ msg: 'Tag already exists on collection' });
-    }
-
-    collection.tags.push(req.tag);
-
-    await collection.save();
-
-    return res.send(collection.tags);
-  } catch (err) {
-    console.error(err.message);
-    return res.status(500).send('Server Error');
-  }
-});
+router.put('/tags/:id', async (req, res) => {});
 
 // PUT - 'api/collections/contributors/:id' - Update contributors on a collection

[Survived] BlockStatement
server/routes/api/collections.js:411:7
 router.put('/tags/:id', async (req, res) => {
   const collection = Collection.findById(req.params.id);
 
-  try {
-    if (
-      collection.tags.filter((tag) => tag.toString() === req.tag).length > 0
-    ) {
-      return res.status(400).json({ msg: 'Tag already exists on collection' });
-    }
-
-    collection.tags.push(req.tag);
-
-    await collection.save();
-
-    return res.send(collection.tags);
-  } catch (err) {
+  try {} catch (err) {
     console.error(err.message);
     return res.status(500).send('Server Error');

[Survived] EqualityOperator
server/routes/api/collections.js:413:7
 
   try {
     if (
-      collection.tags.filter((tag) => tag.toString() === req.tag).length > 0
+      collection.tags.filter(tag => tag.toString() === req.tag).length >= 0
     ) {
       return res.status(400).json({ msg: 'Tag already exists on collection' });

[Survived] ArrowFunction
server/routes/api/collections.js:413:30
 
   try {
     if (
-      collection.tags.filter((tag) => tag.toString() === req.tag).length > 0
+      collection.tags.filter(() => undefined).length > 0
     ) {
       return res.status(400).json({ msg: 'Tag already exists on collection' });

[Survived] BlockStatement
server/routes/api/collections.js:414:7
   try {
     if (
       collection.tags.filter((tag) => tag.toString() === req.tag).length > 0
-    ) {
-      return res.status(400).json({ msg: 'Tag already exists on collection' });
-    }
+    ) {}
 
     collection.tags.push(req.tag);

[Survived] ObjectLiteral
server/routes/api/collections.js:415:35
     if (
       collection.tags.filter((tag) => tag.toString() === req.tag).length > 0
     ) {
-      return res.status(400).json({ msg: 'Tag already exists on collection' });
+      return res.status(400).json({});
     }
 

[Survived] BlockStatement
server/routes/api/collections.js:423:17
     await collection.save();
 
     return res.send(collection.tags);
-  } catch (err) {
-    console.error(err.message);
-    return res.status(500).send('Server Error');
-  }
+  } catch (err) {}
 });
 

[Survived] BlockStatement
server/routes/api/collections.js:439:45
 // @desc    Get a collection by userI
 // @access  Public
 
-router.get('/user/:id', async (req, res) => {
-  const userId = req.params.id;
-
-  try {
-    const collections = await Collection.find({ author: userId }).sort({
-      date: -1,
-    });
-    res.json(collections);
-  } catch (err) {
-    console.error(err.message);
-    res.status(500).send('Server Error');
-  }
-});
+router.get('/user/:id', async (req, res) => {});
 
 module.exports = router;

[Survived] BlockStatement
server/routes/api/collections.js:442:7
 router.get('/user/:id', async (req, res) => {
   const userId = req.params.id;
 
-  try {
-    const collections = await Collection.find({ author: userId }).sort({
-      date: -1,
-    });
-    res.json(collections);
-  } catch (err) {
+  try {} catch (err) {
     console.error(err.message);
     res.status(500).send('Server Error');

[Survived] ObjectLiteral
server/routes/api/collections.js:443:72
   const userId = req.params.id;
 
   try {
-    const collections = await Collection.find({ author: userId }).sort({
-      date: -1,
-    });
+    const collections = await Collection.find({ author: userId }).sort({});
     res.json(collections);
   } catch (err) {

[Survived] UnaryOperator
server/routes/api/collections.js:444:13
 
   try {
     const collections = await Collection.find({ author: userId }).sort({
-      date: -1,
+      date: +1,
     });
     res.json(collections);
