[Survived] StringLiteral
steve/learnvault/server/server.js:2:25
 const path = require('path');
-const express = require('express');
+const express = require("");
 const mongoose = require('mongoose');
 const cookieParser = require('cookie-parser');

[Survived] StringLiteral
steve/learnvault/server/server.js:4:30
 const path = require('path');
 const express = require('express');
 const mongoose = require('mongoose');
-const cookieParser = require('cookie-parser');
+const cookieParser = require("");
 const env = require('dotenv').config();
 

[Survived] ConditionalExpression
steve/learnvault/server/server.js:11:14
 const verifyToken = require('./utils/verifyToken');
 
 const app = express();
-const PORT = process.env.PORT || 5000;
+const PORT = true;
 
 // ------

[Survived] LogicalOperator
steve/learnvault/server/server.js:11:14
 const verifyToken = require('./utils/verifyToken');
 
 const app = express();
-const PORT = process.env.PORT || 5000;
+const PORT = process.env.PORT && 5000;
 
 // ------

[Survived] StringLiteral
steve/learnvault/server/server.js:17:61
 // Routes
 // ------
 
-app.use(express.static(path.join(__dirname, '..', 'client', 'dist')));
+app.use(express.static(path.join(__dirname, '..', 'client', "")));
 app.use(express.json({ extended: false }));
 app.use(cookieParser());

[Survived] BooleanLiteral
steve/learnvault/server/server.js:18:34
 // ------
 
 app.use(express.static(path.join(__dirname, '..', 'client', 'dist')));
-app.use(express.json({ extended: false }));
+app.use(express.json({ extended: true }));
 app.use(cookieParser());
 

[Survived] ObjectLiteral
steve/learnvault/server/server.js:18:22
 // ------
 
 app.use(express.static(path.join(__dirname, '..', 'client', 'dist')));
-app.use(express.json({ extended: false }));
+app.use(express.json({}));
 app.use(cookieParser());
 

[Survived] StringLiteral
steve/learnvault/server/server.js:23:9
 
 app.post('/api/register', userController.registerUser);
 app.post('/api/login', userController.loginUser);
-app.get('/api/logout', userController.logoutUser);
+app.get("", userController.logoutUser);
 // Used to check if the users token is valid
 // Allows us to protect routes on the client side

[Survived] BlockStatement
steve/learnvault/server/server.js:26:57
 app.get('/api/logout', userController.logoutUser);
 // Used to check if the users token is valid
 // Allows us to protect routes on the client side
-app.get('/api/checkToken', [verifyToken], (req, res) => {
-  res.status(200).send(res.locals.userId);
-});
+app.get('/api/checkToken', [verifyToken], (req, res) => {});
 
 // Collection routes

[Survived] StringLiteral
steve/learnvault/server/server.js:26:9
 app.get('/api/logout', userController.logoutUser);
 // Used to check if the users token is valid
 // Allows us to protect routes on the client side
-app.get('/api/checkToken', [verifyToken], (req, res) => {
+app.get("", [verifyToken], (req, res) => {
   res.status(200).send(res.locals.userId);
 });

[Survived] BlockStatement
steve/learnvault/server/server.js:34:28
 app.use('/api/collections', require('./routes/api/collections'));
 
 // Let React handle all other routes
-app.get('*', (req, res) => {
-  res.sendFile(path.join(__dirname, '..', 'client', 'dist', 'index.html'));
-});
+app.get('*', (req, res) => {});
 
 // -------------

[Survived] StringLiteral
steve/learnvault/server/server.js:34:9
 app.use('/api/collections', require('./routes/api/collections'));
 
 // Let React handle all other routes
-app.get('*', (req, res) => {
+app.get("", (req, res) => {
   res.sendFile(path.join(__dirname, '..', 'client', 'dist', 'index.html'));
 });

[Survived] StringLiteral
steve/learnvault/server/server.js:35:37
 
 // Let React handle all other routes
 app.get('*', (req, res) => {
-  res.sendFile(path.join(__dirname, '..', 'client', 'dist', 'index.html'));
+  res.sendFile(path.join(__dirname, "", 'client', 'dist', 'index.html'));
 });
 

[Survived] BooleanLiteral
steve/learnvault/server/server.js:44:20
 // -----------------
 
 mongoose.connect(process.env.DB, {
-  useNewUrlParser: true,
+  useNewUrlParser: false,
   useUnifiedTopology: true,
   useCreateIndex: true,

[Survived] BooleanLiteral
steve/learnvault/server/server.js:45:23
 
 mongoose.connect(process.env.DB, {
   useNewUrlParser: true,
-  useUnifiedTopology: true,
+  useUnifiedTopology: false,
   useCreateIndex: true,
   useFindAndModify: false,

[Survived] BooleanLiteral
steve/learnvault/server/server.js:46:19
 mongoose.connect(process.env.DB, {
   useNewUrlParser: true,
   useUnifiedTopology: true,
-  useCreateIndex: true,
+  useCreateIndex: false,
   useFindAndModify: false,
 });

[Survived] BooleanLiteral
steve/learnvault/server/server.js:47:21
   useNewUrlParser: true,
   useUnifiedTopology: true,
   useCreateIndex: true,
-  useFindAndModify: false,
+  useFindAndModify: true,
 });
 

[Survived] BlockStatement
steve/learnvault/server/server.js:52:23
 
 const db = mongoose.connection;
 db.on('error', console.error.bind(console, 'connection error:'));
-db.once('open', () => {
-  app.listen(PORT, () => {
-    console.log(`Server running at port ${PORT}`);
-  });
-});
+db.once('open', () => {});
 

[Survived] BlockStatement
steve/learnvault/server/server.js:53:26
 const db = mongoose.connection;
 db.on('error', console.error.bind(console, 'connection error:'));
 db.once('open', () => {
-  app.listen(PORT, () => {
-    console.log(`Server running at port ${PORT}`);
-  });
+  app.listen(PORT, () => {});
 });
 
